Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# daysFuture
source: {count, plural, zero{{numeric, select, true{in {digits} days} other{today}}} one{{numeric, select, true{in {digits} day} other{tomorrow}}} other{in {digits} days}}
af: {days, plural, zero{{numeric, select, true{oor {days} dae} other{vandag}}} one{{numeric, select, true{oor {days} dag} other{môre}}} two{{numeric, select, true{oor {days} dae} other{oormôre}}} other{oor {days} dae}}
am: {count, plural, zero{{numeric, select, true{በ{digits} ቀናት ውስጥ} other{ዛሬ}}} one{{numeric, select, true{በ{digits} ቀን ውስጥ} other{ነገ}}} two{{numeric, select, true{በ{digits} ቀናት ውስጥ} other{ከነገ ወዲያ}}} other{በ{digits} ቀናት ውስጥ}}
ar: {days, plural, =0{{numeric, select, true{خلال {days} يوم} other{اليوم}}} =1{{numeric, select, true{خلال يوم واحد} other{غدًا}}} =2{{numeric, select, true{خلال يومين} other{بعد الغد}}} few{خلال {days} أيام} many{خلال {days} يومًا} other{خلال {days} يوم}}
as: {days, plural, zero{{numeric, select, true{{days} দিনত} other{আজি}}} one{{numeric, select, true{{days} দিনত} other{কাইলৈ}}} two{{numeric, select, true{{days} দিনত} other{পৰহিলৈ}}} other{{days} দিনত}}
ast: {days, plural, =0{{numeric, select, true{en {days} díes} other{güei}}} =1{{numeric, select, true{en {days} día} other{mañana}}} =2{{numeric, select, true{en {days} díes} other{pasao mañana}}} other{en {days} díes}}
az: {days, plural, zero{{numeric, select, true{{days} gün ərzində} other{bu gün}}} one{{numeric, select, true{{days} gün ərzində} other{sabah}}} other{{days} gün ərzində}}
be: {days, plural, =0{{numeric, select, true{праз {days} дня} other{сёння}}} =1{{numeric, select, true{праз {days} дзень} other{заўтра}}} =2{{numeric, select, true{праз {days} дня} other{паслязаўтра}}} few{праз {days} дні} many{праз {days} дзён} other{праз {days} дня}}
bg: {days, plural, =0{{numeric, select, true{след {days} дни} other{днес}}} =1{{numeric, select, true{след {days} ден} other{утре}}} =2{{numeric, select, true{след {days} дни} other{вдругиден}}} other{след {days} дни}}
bn: {days, plural, zero{{numeric, select, true{{days} দিনের মধ্যে} other{আজ}}} one{{numeric, select, true{{days} দিনের মধ্যে} other{আগামীকাল}}} two{{numeric, select, true{{days} দিনের মধ্যে} other{আগামী পরশু}}} other{{days} দিনের মধ্যে}}
br: {days, plural, =0{{numeric, select, true{a-benn {days} deiz} other{hiziv}}} =1{{numeric, select, true{a-benn {days} deiz} other{warcʼhoazh}}} =2{a-benn {days} zeiz} many{a-benn {days} a zeizioù} other{a-benn {days} deiz}}
bs: {days, plural, =0{{numeric, select, true{za {days} dana} other{danas}}} =1{{numeric, select, true{za {days} dan} other{sutra}}} =2{{numeric, select, true{za {days} dana} other{prekosutra}}} other{za {days} dana}}
bs_cyrl: {count, plural, zero{{numeric, select, true{за {digits} дана} other{данас}}} one{{numeric, select, true{за {digits} дан} other{сутра}}} two{{numeric, select, true{за {digits} дана} other{прекосутра}}} other{за {digits} дана}}
ca: {days, plural, =0{{numeric, select, true{d’aquí a {days} dies} other{avui}}} =1{{numeric, select, true{d’aquí a {days} dia} other{demà}}} =2{{numeric, select, true{d’aquí a {days} dies} other{demà passat}}} other{d’aquí a {days} dies}}
cs: {days, plural, =0{{numeric, select, true{za {days} dní} other{dnes}}} =1{{numeric, select, true{za {days} den} other{zítra}}} =2{{numeric, select, true{za {days} dní} other{pozítří}}} few{za {days} dny} many{za {days} dne} other{za {days} dní}}
cy: {days, plural, =0{{numeric, select, true{ymhen {days} diwrnod} other{heddiw}}} =1{{numeric, select, true{ymhen diwrnod} other{yfory}}} =2{{numeric, select, true{ymhen deuddydd} other{drennydd}}} other{ymhen {days} diwrnod}}
da: {days, plural, =0{{numeric, select, true{om {days} dage} other{i dag}}} =1{{numeric, select, true{om {days} dag} other{i morgen}}} =2{{numeric, select, true{om {days} dage} other{i overmorgen}}} other{om {days} dage}}
de: {days, plural, =0{{numeric, select, true{in {days} Tagen} other{heute}}} =1{{numeric, select, true{in {days} Tag} other{morgen}}} =2{{numeric, select, true{in {days} Tagen} other{übermorgen}}} other{in {days} Tagen}}
dz: {days, plural, zero{{numeric, select, true{ཉིནམ་ {days} ནང་} other{ད་རིས་}}} one{{numeric, select, true{ཉིནམ་ {days} ནང་} other{ནངས་པ་}}} two{{numeric, select, true{ཉིནམ་ {days} ནང་} other{གནངས་ཚེ}}} other{ཉིནམ་ {days} ནང་}}
el: {days, plural, =0{{numeric, select, true{σε {days} ημέρες} other{σήμερα}}} =1{{numeric, select, true{σε {days} ημέρα} other{αύριο}}} =2{{numeric, select, true{σε {days} ημέρες} other{μεθαύριο}}} other{σε {days} ημέρες}}
eo: {days, plural, =0{{numeric, select, true{post {days} tagoj} other{hodiaŭ}}} =1{{numeric, select, true{post {days} tago} other{morgaŭ}}} other{post {days} tagoj}}
es: {days, plural, zero{{numeric, select, true{dentro de {days} días} other{hoy}}} one{{numeric, select, true{dentro de {days} día} other{mañana}}} two{{numeric, select, true{dentro de {days} días} other{pasado mañana}}} other{dentro de {days} días}}
et: {days, plural, =0{{numeric, select, true{{days} päeva pärast} other{täna}}} =1{{numeric, select, true{{days} päeva pärast} other{homme}}} =2{{numeric, select, true{{days} päeva pärast} other{ülehomme}}} other{{days} päeva pärast}}
eu: {days, plural, zero{{numeric, select, true{{days} egun barru} other{gaur}}} one{{numeric, select, true{{days} egun barru} other{bihar}}} two{{numeric, select, true{{days} egun barru} other{etzi}}} other{{days} egun barru}}
fa: {days, plural, =0{{numeric, select, true{{days} روز دیگر} other{امروز}}} =1{{numeric, select, true{{days} روز دیگر} other{فردا}}} =2{{numeric, select, true{{days} روز دیگر} other{پس‌فردا}}} other{{days} روز دیگر}}
fi: {days, plural, zero{{numeric, select, true{{days} päivän päästä} other{tänään}}} one{{numeric, select, true{{days} päivän päästä} other{huomenna}}} two{{numeric, select, true{{days} päivän päästä} other{ylihuomenna}}} other{{days} päivän päästä}}
fil: {days, plural, =0{{numeric, select, true{sa {days} araw} other{ngayong araw}}} =1{{numeric, select, true{sa {days} araw} other{bukas}}} =2{{numeric, select, true{sa {days} araw} other{Samakalawa}}} other{sa {days} araw}}
fo: {days, plural, zero{{numeric, select, true{um {days} dagar} other{í dag}}} one{{numeric, select, true{um {days} dag} other{í morgin}}} two{{numeric, select, true{um {days} dagar} other{í ovurmorgin}}} other{um {days} dagar}}
fr: {days, plural, zero{{numeric, select, true{dans {days} jours} other{aujourd’hui}}} one{{numeric, select, true{dans {days} jour} other{demain}}} two{{numeric, select, true{dans {days} jours} other{après-demain}}} other{dans {days} jours}}
fur: {count, plural, zero{{numeric, select, true{ca di {digits} zornadis} other{vuê}}} one{{numeric, select, true{ca di {digits} zornade} other{doman}}} two{{numeric, select, true{ca di {digits} zornadis} other{passantdoman}}} other{ca di {digits} zornadis}}
fy: {days, plural, =0{{numeric, select, true{Oer {days} deien} other{vandaag}}} =1{{numeric, select, true{Oer {days} dei} other{morgen}}} =2{{numeric, select, true{Oer {days} deien} other{Oermorgen}}} other{Oer {days} deien}}
ga: {days, plural, zero{{numeric, select, true{i gceann {days} lá} other{inniu}}} one{{numeric, select, true{i gceann {days} lá} other{amárach}}} two{{numeric, select, true{i gceann {days} lá} other{arú amárach}}} other{i gceann {days} lá}}
gd: {days, plural, =0{{numeric, select, true{an ceann {days} latha} other{an-diugh}}} =1{{numeric, select, true{an ceann {days} latha} other{a-màireach}}} =2{{numeric, select, true{an ceann {days} latha} other{an-earar}}} few{an ceann {days} làithean} other{an ceann {days} latha}}
gl: {days, plural, =0{{numeric, select, true{en {days} días} other{hoxe}}} =1{{numeric, select, true{en {days} día} other{mañá}}} =2{{numeric, select, true{en {days} días} other{pasadomañá}}} other{en {days} días}}
gu: {days, plural, zero{{numeric, select, true{{days} દિવસમાં} other{આજે}}} one{{numeric, select, true{{days} દિવસમાં} other{આવતીકાલે}}} two{{numeric, select, true{{days} દિવસમાં} other{પરમદિવસે}}} other{{days} દિવસમાં}}
he: {days, plural, =0{{numeric, select, true{בעוד {days} ימים} other{היום}}} =1{{numeric, select, true{בעוד יום {days}} other{מחר}}} =2{{numeric, select, true{בעוד יומיים} other{מחרתיים}}} other{בעוד {days} ימים}}
hi: {days, plural, zero{{numeric, select, true{{days} दिन में} other{आज}}} one{{numeric, select, true{{days} दिन में} other{कल}}} two{{numeric, select, true{{days} दिन में} other{परसों}}} other{{days} दिन में}}
hi_latn: {days, plural, =0{{numeric, select, true{{days} din mein} other{aaj}}} =1{{numeric, select, true{{days} din mein} other{aane wala kal}}} =2{{numeric, select, true{{days} din mein} other{aane wala parson}}} other{{days} din mein}}
hr: {days, plural, zero{{numeric, select, true{za {days} dana} other{danas}}} one{{numeric, select, true{za {days} dan} other{sutra}}} two{{numeric, select, true{za {days} dana} other{prekosutra}}} other{za {days} dana}}
hu: {days, plural, =0{{numeric, select, true{{days} nap múlva} other{ma}}} =1{{numeric, select, true{{days} nap múlva} other{holnap}}} =2{{numeric, select, true{{days} nap múlva} other{holnapután}}} other{{days} nap múlva}}
hy: {days, plural, zero{{numeric, select, true{{days} օրից} other{այսօր}}} one{{numeric, select, true{{days} օրից} other{վաղը}}} two{{numeric, select, true{{days} օրից} other{վաղը չէ մյուս օրը}}} other{{days} օրից}}
ia: {days, plural, =0{{numeric, select, true{in {days} dies} other{hodie}}} =1{{numeric, select, true{in {days} die} other{deman}}} other{in {days} dies}}
id: {days, plural, zero{{numeric, select, true{dalam {days} hari} other{hari ini}}} one{{numeric, select, true{dalam {days} hari} other{besok}}} two{{numeric, select, true{dalam {days} hari} other{lusa}}} other{dalam {days} hari}}
is: {days, plural, zero{{numeric, select, true{eftir {days} daga} other{í dag}}} one{{numeric, select, true{eftir {days} dag} other{á morgun}}} two{{numeric, select, true{eftir {days} daga} other{eftir tvo daga}}} other{eftir {days} daga}}
it: {days, plural, zero{{numeric, select, true{tra {days} giorni} other{oggi}}} one{{numeric, select, true{tra {days} giorno} other{domani}}} two{{numeric, select, true{tra {days} giorni} other{dopodomani}}} other{tra {days} giorni}}
ja: {days, plural, =0{{numeric, select, true{{days} 日後} other{今日}}} =1{{numeric, select, true{{days} 日後} other{明日}}} =2{{numeric, select, true{{days} 日後} other{明後日}}} other{{days} 日後}}
ka: {days, plural, zero{{numeric, select, true{{days} დღეში} other{დღეს}}} one{{numeric, select, true{{days} დღეში} other{ხვალ}}} two{{numeric, select, true{{days} დღეში} other{ზეგ}}} other{{days} დღეში}}
kab: {days, plural, zero{{numeric, select, true{deg {days} n wussan} other{Ass-a}}} one{{numeric, select, true{deg {days} n wass} other{Azekka}}} other{deg {days} n wussan}}
kk: {days, plural, zero{{numeric, select, true{{days} күннен кейін} other{бүгін}}} one{{numeric, select, true{{days} күннен кейін} other{ертең}}} two{{numeric, select, true{{days} күннен кейін} other{бүрсігүні}}} other{{days} күннен кейін}}
km: {count, plural, zero{{numeric, select, true{{digits} ថ្ងៃទៀត} other{ថ្ងៃ​នេះ}}} one{{numeric, select, true{{digits} ថ្ងៃទៀត} other{ថ្ងៃ​ស្អែក}}} two{{numeric, select, true{{digits} ថ្ងៃទៀត} other{​ខាន​ស្អែក}}} other{{digits} ថ្ងៃទៀត}}
kn: {days, plural, =0{{numeric, select, true{{days} ದಿನಗಳಲ್ಲಿ} other{ಇಂದು}}} =1{{numeric, select, true{{days} ದಿನದಲ್ಲಿ} other{ನಾಳೆ}}} =2{{numeric, select, true{{days} ದಿನಗಳಲ್ಲಿ} other{ನಾಡಿದ್ದು}}} other{{days} ದಿನಗಳಲ್ಲಿ}}
ko: {days, plural, zero{{numeric, select, true{{days}일 후} other{오늘}}} one{{numeric, select, true{{days}일 후} other{내일}}} two{{numeric, select, true{{days}일 후} other{모레}}} other{{days}일 후}}
ky: {days, plural, =0{{numeric, select, true{{days} күндөн кийин} other{бүгүн}}} =1{{numeric, select, true{{days} күндөн кийин} other{эртең}}} =2{{numeric, select, true{{days} күндөн кийин} other{бүрсүгүнү}}} other{{days} күндөн кийин}}
lb: {days, plural, zero{{numeric, select, true{a(n) {days} Deeg} other{haut}}} one{{numeric, select, true{an {days} Dag} other{muer}}} other{a(n) {days} Deeg}}
lo: {days, plural, =0{{numeric, select, true{ໃນອີກ {days} ມື້} other{ມື້ນີ້}}} =1{{numeric, select, true{ໃນອີກ {days} ມື້} other{ມື້ອື່ນ}}} =2{{numeric, select, true{ໃນອີກ {days} ມື້} other{ມື້ຮື}}} other{ໃນອີກ {days} ມື້}}
lt: {days, plural, =0{{numeric, select, true{po {days} dienų} other{šiandien}}} =1{{numeric, select, true{po {days} dienos} other{rytoj}}} =2{{numeric, select, true{po {days} dienų} other{poryt}}} many{po {days} dienos} other{po {days} dienų}}
lv: {days, plural, =0{{numeric, select, true{pēc {days} dienām} other{šodien}}} =1{{numeric, select, true{pēc {days} dienas} other{rīt}}} =2{{numeric, select, true{pēc {days} dienām} other{parīt}}} other{pēc {days} dienām}}
mai: {days, plural, zero{{numeric, select, true{{days} दिन मे} other{आजुक दिन}}} one{{numeric, select, true{{days} दिन मे} other{काल्हिक दिन}}} other{{days} दिन मे}}
mi: {count, plural, zero{{numeric, select, true{+{digits} rā} other{i tēnei rā}}} one{{numeric, select, true{+{digits} rā} other{āpōpō}}} other{+{digits} rā}}
mk: {days, plural, =0{{numeric, select, true{за {days} дена} other{денес}}} =1{{numeric, select, true{за {days} ден} other{утре}}} =2{{numeric, select, true{за {days} дена} other{задутре}}} other{за {days} дена}}
ml: {days, plural, zero{{numeric, select, true{{days} ദിവസത്തിൽ} other{ഇന്ന്}}} one{{numeric, select, true{{days} ദിവസത്തിൽ} other{നാളെ}}} two{{numeric, select, true{{days} ദിവസത്തിൽ} other{മറ്റന്നാൾ}}} other{{days} ദിവസത്തിൽ}}
mn: {days, plural, zero{{numeric, select, true{{days} өдрийн дараа} other{өнөөдөр}}} one{{numeric, select, true{{days} өдрийн дараа} other{маргааш}}} two{{numeric, select, true{{days} өдрийн дараа} other{нөгөөдөр}}} other{{days} өдрийн дараа}}
mr: {days, plural, =0{{numeric, select, true{येत्या {days} दिवसांमध्ये} other{आज}}} =1{{numeric, select, true{येत्या {days} दिवसामध्ये} other{उद्या}}} other{येत्या {days} दिवसांमध्ये}}
ms: {days, plural, zero{{numeric, select, true{dalam {days} hari} other{hari ini}}} one{{numeric, select, true{dalam {days} hari} other{esok}}} two{{numeric, select, true{dalam {days} hari} other{lusa}}} other{dalam {days} hari}}
ms_arab: {count, plural, zero{{numeric, select, true{دالم {digits} هاري} other{هاري ني}}} one{{numeric, select, true{دالم {digits} هاري} other{ايسوق}}} two{{numeric, select, true{دالم {digits} هاري} other{هاري سلڤس ايسوق}}} other{دالم {digits} هاري}}
mt: {days, plural, zero{{numeric, select, true{fi żmien {days} ġurnata oħra} other{illum}}} one{{numeric, select, true{fi żmien ġurnata} other{għada}}} two{fi żmien jumejn oħra} few{fi żmien {days} ġranet oħra} many{fi żmien {days}-il ġurnata oħra} other{fi żmien {days} ġurnata oħra}}
my: {days, plural, =0{{numeric, select, true{{days} ရက်အတွင်း} other{ယနေ့}}} =1{{numeric, select, true{{days} ရက်အတွင်း} other{မနက်ဖြန်}}} =2{{numeric, select, true{{days} ရက်အတွင်း} other{သန်ဘက်ခါ}}} other{{days} ရက်အတွင်း}}
ne: {days, plural, =0{{numeric, select, true{{days} दिनमा} other{आज}}} =1{{numeric, select, true{{days} दिनमा} other{भोलि}}} =2{{numeric, select, true{{days} दिनमा} other{पर्सि}}} other{{days} दिनमा}}
nl: {days, plural, zero{{numeric, select, true{over {days} dagen} other{vandaag}}} one{{numeric, select, true{over {days} dag} other{morgen}}} two{{numeric, select, true{over {days} dagen} other{overmorgen}}} other{over {days} dagen}}
no: {days, plural, zero{{numeric, select, true{om {days} døgn} other{i dag}}} one{{numeric, select, true{om {days} døgn} other{i morgen}}} two{{numeric, select, true{om {days} døgn} other{i overmorgen}}} other{om {days} døgn}}
or: {days, plural, zero{{numeric, select, true{{days} ଦିନରେ} other{ଆଜି}}} one{{numeric, select, true{{days} ଦିନରେ} other{ଆସନ୍ତାକାଲି}}} other{{days} ଦିନରେ}}
pa: {days, plural, =0{{numeric, select, true{{days} ਦਿਨਾਂ ਵਿੱਚ} other{ਅੱਜ}}} =1{{numeric, select, true{{days} ਦਿਨ ਵਿੱਚ} other{ਭਲਕੇ}}} other{{days} ਦਿਨਾਂ ਵਿੱਚ}}
pl: {count, plural, zero{{numeric, select, true{za {digits} dnia} other{dzisiaj}}} one{{numeric, select, true{za {digits} dzień} other{jutro}}} two{{numeric, select, true{za {digits} dnia} other{pojutrze}}} few{za {digits} dni} many{za {digits} dni} other{za {digits} dnia}}
ps: {days, plural, =0{{numeric, select, true{په {days} ورځو کې} other{نن}}} =1{{numeric, select, true{په {days} ورځ کې} other{سبا}}} other{په {days} ورځو کې}}
pt: {days, plural, =0{{numeric, select, true{em {days} dias} other{hoje}}} =1{{numeric, select, true{em {days} dia} other{amanhã}}} =2{{numeric, select, true{em {days} dias} other{depois de amanhã}}} other{em {days} dias}}
ro: {days, plural, =0{{numeric, select, true{peste {days} de zile} other{azi}}} =1{{numeric, select, true{peste {days} zi} other{mâine}}} =2{{numeric, select, true{peste {days} de zile} other{poimâine}}} few{peste {days} zile} other{peste {days} de zile}}
ru: {days, plural, =0{{numeric, select, true{через {days} дня} other{сегодня}}} =1{{numeric, select, true{через {days} день} other{завтра}}} =2{{numeric, select, true{через {days} дня} other{послезавтра}}} many{через {days} дней} other{через {days} дня}}
sc: {days, plural, =0{{numeric, select, true{intro de {days} dies} other{oe}}} =1{{numeric, select, true{intro de {days} die} other{cras}}} other{intro de {days} dies}}
sd: {days, plural, =0{{numeric, select, true{{days} ڏينهن ۾} other{اڄ}}} =1{{numeric, select, true{{days} ڏينهن ۾} other{سڀاڻي}}} other{{days} ڏينهن ۾}}
se: {count, plural, zero{{numeric, select, true{{digits} jándora maŋŋilit} other{odne}}} one{{numeric, select, true{{digits} jándor maŋŋilit} other{ihttin}}} two{{numeric, select, true{{digits} jándor amaŋŋilit} other{paijeelittáá}}} other{{digits} jándora maŋŋilit}}
se_fi: {days, plural, =2{{numeric, select, true{{days} beaivve siste} other{don beaivve}}} other{{days} beaivve siste}}
si: {days, plural, =0{{numeric, select, true{දින {days}න්} other{අද}}} =1{{numeric, select, true{දින {days}න්} other{හෙට}}} =2{{numeric, select, true{දින {days}න්} other{අනිද්දා}}} other{දින {days}න්}}
sk: {days, plural, zero{{numeric, select, true{o {days} dní} other{dnes}}} one{{numeric, select, true{o {days} deň} other{zajtra}}} two{{numeric, select, true{o {days} dní} other{pozajtra}}} few{o {days} dni} many{o {days} dňa} other{o {days} dní}}
sl: {days, plural, =0{{numeric, select, true{čez {days} dni} other{danes}}} =1{{numeric, select, true{čez {days} dan} other{jutri}}} =2{{numeric, select, true{čez {days} dneva} other{pojutrišnjem}}} other{čez {days} dni}}
sq: {days, plural, zero{{numeric, select, true{pas {days} ditësh} other{sot}}} one{{numeric, select, true{pas {days} dite} other{nesër}}} other{pas {days} ditësh}}
sr: {days, plural, =0{{numeric, select, true{за {days} дана} other{данас}}} =1{{numeric, select, true{за {days} дан} other{сутра}}} =2{{numeric, select, true{за {days} дана} other{прекосутра}}} other{за {days} дана}}
sr_latn: {days, plural, =0{{numeric, select, true{za {days} dana} other{danas}}} =1{{numeric, select, true{za {days} dan} other{sutra}}} =2{{numeric, select, true{za {days} dana} other{prekosutra}}} other{za {days} dana}}
sv: {days, plural, =0{{numeric, select, true{om {days} dagar} other{i dag}}} =1{{numeric, select, true{om {days} dag} other{i morgon}}} =2{{numeric, select, true{om {days} dagar} other{i övermorgon}}} other{om {days} dagar}}
sw: {days, plural, =0{{numeric, select, true{baada ya siku {days}} other{leo}}} =1{{numeric, select, true{baada ya siku {days}} other{kesho}}} =2{{numeric, select, true{baada ya siku {days}} other{kesho kutwa}}} other{baada ya siku {days}}}
ta: {days, plural, =0{{numeric, select, true{{days} நாட்களில்} other{இன்று}}} =1{{numeric, select, true{{days} நாளில்} other{நாளை}}} =2{{numeric, select, true{{days} நாட்களில்} other{நாளை மறுநாள்}}} other{{days} நாட்களில்}}
te: {days, plural, zero{{numeric, select, true{{days} రోజుల్లో} other{ఈ రోజు}}} one{{numeric, select, true{{days} రోజులో} other{రేపు}}} two{{numeric, select, true{{days} రోజుల్లో} other{ఎల్లుండి}}} other{{days} రోజుల్లో}}
tg: {days, plural, =0{{numeric, select, true{пас аз {days} рӯз} other{имрӯз}}} =1{{numeric, select, true{пас аз {days} рӯз} other{фардо}}} other{пас аз {days} рӯз}}
th: {days, plural, zero{{numeric, select, true{ในอีก {days} วัน} other{วันนี้}}} one{{numeric, select, true{ในอีก {days} วัน} other{พรุ่งนี้}}} two{{numeric, select, true{ในอีก {days} วัน} other{มะรืนนี้}}} other{ในอีก {days} วัน}}
tk: {days, plural, zero{{numeric, select, true{{days} günden} other{şu gün}}} one{{numeric, select, true{{days} günden} other{ertir}}} other{{days} günden}}
tr: {days, plural, =0{{numeric, select, true{{days} gün sonra} other{bugün}}} =1{{numeric, select, true{{days} gün sonra} other{yarın}}} =2{{numeric, select, true{{days} gün sonra} other{öbür gün}}} other{{days} gün sonra}}
tt: {days, plural, zero{{numeric, select, true{{days} көннән} other{бүген}}} one{{numeric, select, true{{days} көннән} other{иртәгә}}} other{{days} көннән}}
ug: {count, plural, zero{{numeric, select, true{{digits} كۈندىن كېيىن} other{بۈگۈن}}} one{{numeric, select, true{{digits} كۈندىن كېيىن} other{ئەتە}}} other{{digits} كۈندىن كېيىن}}
uk: {count, plural, zero{{numeric, select, true{через {digits} дня} other{сьогодні}}} one{{numeric, select, true{через {digits} день} other{завтра}}} two{{numeric, select, true{через {digits} дня} other{післязавтра}}} few{через {digits} дні} many{через {digits} днів} other{через {digits} дня}}
ur: {days, plural, =0{{numeric, select, true{{days} دنوں میں} other{آج}}} =1{{numeric, select, true{{days} دن میں} other{آئندہ کل}}} =2{{numeric, select, true{{days} دنوں میں} other{آنے والا پرسوں}}} other{{days} دنوں میں}}
uz: {days, plural, =0{{numeric, select, true{{days} kundan keyin} other{bugun}}} =1{{numeric, select, true{{days} kundan keyin} other{ertaga}}} other{{days} kundan keyin}}
uz_cyrl: {days, plural, zero{{numeric, select, true{{days} кундан сўнг} other{бугун}}} one{{numeric, select, true{{days} кундан сўнг} other{эртага}}} other{{days} кундан сўнг}}
vi: {days, plural, zero{{numeric, select, true{sau {days} ngày nữa} other{Hôm nay}}} one{{numeric, select, true{sau {days} ngày nữa} other{Ngày mai}}} two{{numeric, select, true{sau {days} ngày nữa} other{Ngày kia}}} other{sau {days} ngày nữa}}
zh: {days, plural, =0{{numeric, select, true{{days}天后} other{今天}}} =1{{numeric, select, true{{days}天后} other{明天}}} =2{{numeric, select, true{{days}天后} other{后天}}} other{{days}天后}}
zh_hant: {days, plural, =0{{numeric, select, true{{days} 天後} other{今天}}} =1{{numeric, select, true{{days} 天後} other{明天}}} =2{{numeric, select, true{{days} 天後} other{後天}}} other{{days} 天後}}
zu: {days, plural, =0{{numeric, select, true{ezinsukwini ezingu-{days} ezizayo} other{namhlanje}}} =1{{numeric, select, true{osukwini olungu-{days} oluzayo} other{kusasa}}} =2{{numeric, select, true{ezinsukwini ezingu-{days} ezizayo} other{usuku olulandela olwakusasa}}} other{ezinsukwini ezingu-{days} ezizayo}}
