Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# minutesPast
source: {count, plural, zero{{numeric, select, true{{digits} minutes ago} other{this minute}}} one{{digits} minute ago} other{{digits} minutes ago}}
af: {minutes, plural, zero{{numeric, select, true{{minutes} minute gelede} other{hierdie minuut}}} one{{minutes} minuut gelede} other{{minutes} minute gelede}}
am: {count, plural, zero{{numeric, select, true{ከ{digits} ደቂቃዎች በፊት} other{ይህ ደቂቃ}}} one{ከ{digits} ደቂቃ በፊት} other{ከ{digits} ደቂቃዎች በፊት}}
ar: {minutes, plural, =0{{numeric, select, true{قبل {minutes} دقيقة} other{هذه الدقيقة}}} =1{قبل دقيقة واحدة} =2{قبل دقيقتين} few{قبل {minutes} دقائق} other{قبل {minutes} دقيقة}}
as: {minutes, plural, zero{{numeric, select, true{{minutes} মিনিট পূৰ্বে} other{এইটো মিনিটত}}} other{{minutes} মিনিট পূৰ্বে}}
ast: {minutes, plural, =0{{numeric, select, true{hai {minutes} minutos} other{esti minutu}}} =1{hai {minutes} minutu} other{hai {minutes} minutos}}
az: {minutes, plural, zero{{numeric, select, true{{minutes} dəqiqə öncə} other{bu dəqiqə}}} other{{minutes} dəqiqə öncə}}
be: {minutes, plural, =0{{numeric, select, true{{minutes} хвіліны таму} other{у гэту хвіліну}}} =1{{minutes} хвіліну таму} many{{minutes} хвілін таму} other{{minutes} хвіліны таму}}
bg: {minutes, plural, =0{{numeric, select, true{преди {minutes} минути} other{в тази минута}}} =1{преди {minutes} минута} other{преди {minutes} минути}}
bn: {minutes, plural, zero{{numeric, select, true{{minutes} মিনিট আগে} other{এই মিনিট}}} other{{minutes} মিনিট আগে}}
br: {minutes, plural, =0{{numeric, select, true{{minutes} munut zo} other{ar munut-mañ}}} =2{{minutes} vunut zo} many{{minutes} a vunutoù zo} other{{minutes} munut zo}}
bs: {minutes, plural, =0{{numeric, select, true{prije {minutes} minuta} other{ova minuta}}} =1{prije {minutes} minutu} few{prije {minutes} minute} other{prije {minutes} minuta}}
bs_cyrl: {count, plural, zero{{numeric, select, true{прије {digits} минута} other{овог минута}}} one{прије {digits} минут} other{прије {digits} минута}}
ca: {minutes, plural, =0{{numeric, select, true{fa {minutes} minuts} other{aquest minut}}} =1{fa {minutes} minut} other{fa {minutes} minuts}}
cs: {minutes, plural, =0{{numeric, select, true{před {minutes} minutami} other{tuto minutu}}} =1{před {minutes} minutou} many{před {minutes} minuty} other{před {minutes} minutami}}
cy: {minutes, plural, =0{{numeric, select, true{{minutes} munud yn ôl} other{y funud hon}}} other{{minutes} munud yn ôl}}
da: {minutes, plural, =0{{numeric, select, true{for {minutes} minutter siden} other{dette minut}}} =1{for {minutes} minut siden} other{for {minutes} minutter siden}}
de: {minutes, plural, =0{{numeric, select, true{vor {minutes} Minuten} other{in dieser Minute}}} =1{vor {minutes} Minute} other{vor {minutes} Minuten}}
dz: སྐར་མ་ {minutes} ཧེ་མ་
el: {minutes, plural, =0{{numeric, select, true{πριν από {minutes} λεπτά} other{τρέχον λεπτό}}} =1{πριν από {minutes} λεπτό} other{πριν από {minutes} λεπτά}}
eo: {minutes, plural, =0{{numeric, select, true{antaŭ {minutes} minutoj} other{nuna minuto}}} =1{antaŭ {minutes} minuto} other{antaŭ {minutes} minutoj}}
es: {minutes, plural, zero{{numeric, select, true{hace {minutes} minutos} other{este minuto}}} one{hace {minutes} minuto} other{hace {minutes} minutos}}
et: {minutes, plural, =0{{numeric, select, true{{minutes} minuti eest} other{praegusel minutil}}} other{{minutes} minuti eest}}
eu: {minutes, plural, zero{{numeric, select, true{Duela {minutes} minutu} other{minutu honetan}}} other{Duela {minutes} minutu}}
fa: {minutes, plural, =0{{numeric, select, true{{minutes} دقیقه پیش} other{همین دقیقه}}} other{{minutes} دقیقه پیش}}
fi: {minutes, plural, zero{{numeric, select, true{{minutes} minuuttia sitten} other{tämän minuutin aikana}}} one{{minutes} minuutti sitten} other{{minutes} minuuttia sitten}}
fil: {minutes, plural, =0{{numeric, select, true{{minutes} minuto ang nakalipas} other{sa minutong ito}}} other{{minutes} minuto ang nakalipas}}
fo: {minutes, plural, zero{{numeric, select, true{{minutes} minuttir síðan} other{hendan minuttin}}} one{{minutes} minutt síðan} other{{minutes} minuttir síðan}}
fr: {minutes, plural, zero{{numeric, select, true{il y a {minutes} minutes} other{cette minute-ci}}} one{il y a {minutes} minute} other{il y a {minutes} minutes}}
fur: {count, plural, one{{digits} minût indaûr} other{{digits} minûts indaûr}}
fy: {minutes, plural, =1{{minutes} minút lyn} other{{minutes} minuten lyn}}
ga: {minutes, plural, zero{{numeric, select, true{{minutes} nóiméad ó shin} other{an nóiméad seo}}} other{{minutes} nóiméad ó shin}}
gd: {minutes, plural, =0{{numeric, select, true{{minutes} mionaid air ais} other{am broinn mionaid}}} =1{{minutes} mhionaid air ais} =2{{minutes} mhionaid air ais} few{{minutes} mionaidean air ais} other{{minutes} mionaid air ais}}
gl: {minutes, plural, =0{{numeric, select, true{hai {minutes} minutos} other{este minuto}}} =1{hai {minutes} minuto} other{hai {minutes} minutos}}
gu: {minutes, plural, zero{{numeric, select, true{{minutes} મિનિટ પહેલાં} other{આ મિનિટ}}} other{{minutes} મિનિટ પહેલાં}}
he: {minutes, plural, =0{{numeric, select, true{לפני {minutes} דקות} other{בדקה זו}}} =1{לפני דקה} =2{לפני שתי דקות} other{לפני {minutes} דקות}}
hi: {minutes, plural, zero{{numeric, select, true{{minutes} मिनट पहले} other{यह मिनट}}} other{{minutes} मिनट पहले}}
hi_latn: {minutes, plural, =0{{numeric, select, true{{minutes} minute pahle} other{yah minute}}} other{{minutes} minute pahle}}
hr: {minutes, plural, zero{{numeric, select, true{prije {minutes} minuta} other{ova minuta}}} one{prije {minutes} minutu} few{prije {minutes} minute} other{prije {minutes} minuta}}
hu: {minutes, plural, =0{{numeric, select, true{{minutes} perccel ezelőtt} other{ebben a percben}}} other{{minutes} perccel ezelőtt}}
hy: {minutes, plural, zero{{numeric, select, true{{minutes} րոպե առաջ} other{այս րոպեին}}} other{{minutes} րոպե առաջ}}
ia: {minutes, plural, =0{{numeric, select, true{{minutes} minutas retro} other{iste minuta}}} =1{{minutes} minuta retro} other{{minutes} minutas retro}}
id: {minutes, plural, zero{{numeric, select, true{{minutes} menit yang lalu} other{menit ini}}} other{{minutes} menit yang lalu}}
is: {minutes, plural, zero{{numeric, select, true{fyrir {minutes} mínútum} other{á þessari mínútu}}} one{fyrir {minutes} mínútu} other{fyrir {minutes} mínútum}}
it: {minutes, plural, zero{{numeric, select, true{{minutes} minuti fa} other{questo minuto}}} one{{minutes} minuto fa} other{{minutes} minuti fa}}
ja: {minutes, plural, =0{{numeric, select, true{{minutes} 分前} other{1 分以内}}} other{{minutes} 分前}}
ka: {minutes, plural, zero{{numeric, select, true{{minutes} წუთის წინ} other{ამ წუთში}}} other{{minutes} წუთის წინ}}
kab: {minutes, plural, zero{{numeric, select, true{{minutes} n tesdatin aya} other{tasdat-agi}}} one{{minutes} n tesdat aya} other{{minutes} n tesdatin aya}}
kk: {minutes, plural, zero{{numeric, select, true{{minutes} минут бұрын} other{осы минут}}} other{{minutes} минут бұрын}}
km: {count, plural, zero{{numeric, select, true{{digits} នាទី​មុន} other{នាទីនេះ}}} other{{digits} នាទី​មុន}}
kn: {minutes, plural, =0{{numeric, select, true{{minutes} ನಿಮಿಷಗಳ ಹಿಂದೆ} other{ಈ ನಿಮಿಷ}}} =1{{minutes} ನಿಮಿಷದ ಹಿಂದೆ} other{{minutes} ನಿಮಿಷಗಳ ಹಿಂದೆ}}
ko: {minutes, plural, zero{{numeric, select, true{{minutes}분 전} other{현재 분}}} other{{minutes}분 전}}
ky: {minutes, plural, =0{{numeric, select, true{{minutes} мүнөт мурун} other{ушул мүнөттө}}} other{{minutes} мүнөт мурун}}
lb: {minutes, plural, one{virun {minutes} Minutt} other{viru(n) {minutes} Minutten}}
lo: {minutes, plural, =0{{numeric, select, true{{minutes} ນາທີກ່ອນ} other{ນາທີນີ້}}} other{{minutes} ນາທີກ່ອນ}}
lt: {minutes, plural, =0{{numeric, select, true{prieš {minutes} minučių} other{šią minutę}}} =1{prieš {minutes} minutę} few{prieš {minutes} minutes} many{prieš {minutes} minutės} other{prieš {minutes} minučių}}
lv: {minutes, plural, =0{{numeric, select, true{pirms {minutes} minūtēm} other{šajā minūtē}}} =1{pirms {minutes} minūtes} other{pirms {minutes} minūtēm}}
mai: {minutes, plural, zero{{numeric, select, true{{minutes} मिनट पहिले} other{एहि मिनट}}} other{{minutes} मिनट पहिले}}
mi: {count, plural, zero{{numeric, select, true{-{digits} meneti i mua} other{i tēnei meneti}}} other{-{digits} meneti i mua}}
mk: {minutes, plural, =0{{numeric, select, true{пред {minutes} минути} other{оваа минута}}} =1{пред {minutes} минута} other{пред {minutes} минути}}
ml: {minutes, plural, zero{{numeric, select, true{{minutes} മിനിറ്റ് മുമ്പ്} other{ഈ മിനിറ്റിൽ}}} other{{minutes} മിനിറ്റ് മുമ്പ്}}
mn: {minutes, plural, zero{{numeric, select, true{{minutes} минутын өмнө} other{энэ минут}}} other{{minutes} минутын өмнө}}
mr: {minutes, plural, =0{{numeric, select, true{{minutes} मिनिटांपूर्वी} other{या मिनिटात}}} =1{{minutes} मिनिटापूर्वी} other{{minutes} मिनिटांपूर्वी}}
ms: {minutes, plural, zero{{numeric, select, true{{minutes} minit lalu} other{pada minit ini}}} other{{minutes} minit lalu}}
ms_arab: {digits} مينيت لالو
mt: {minutes, plural, zero{{numeric, select, true{{minutes} minuta ilu} other{din il-minuta}}} one{minuta ilu} two{{minutes} minuti ilu} few{{minutes} minuti ilu} many{{minutes}-il minuta ilu} other{{minutes} minuta ilu}}
my: {minutes, plural, =0{{numeric, select, true{ပြီးခဲ့သည့် {minutes} မိနစ်} other{ဤမိနစ်}}} other{ပြီးခဲ့သည့် {minutes} မိနစ်}}
ne: {minutes, plural, =0{{numeric, select, true{{minutes} मिनेट पहिले} other{यही मिनेटमा}}} other{{minutes} मिनेट पहिले}}
nl: {minutes, plural, zero{{numeric, select, true{{minutes} minuten geleden} other{binnen een minuut}}} one{{minutes} minuut geleden} other{{minutes} minuten geleden}}
no: {minutes, plural, zero{{numeric, select, true{for {minutes} minutter siden} other{dette minuttet}}} one{for {minutes} minutt siden} other{for {minutes} minutter siden}}
or: {minutes, plural, zero{{numeric, select, true{{minutes} ମିନିଟ୍ ପୂର୍ବେ} other{ଏହି ମିନିଟ୍}}} other{{minutes} ମିନିଟ୍ ପୂର୍ବେ}}
pa: {minutes, plural, =0{{numeric, select, true{{minutes} ਮਿੰਟ ਪਹਿਲਾਂ} other{ਇਸ ਮਿੰਟ}}} other{{minutes} ਮਿੰਟ ਪਹਿਲਾਂ}}
pl: {count, plural, zero{{numeric, select, true{{digits} minuty temu} other{ta minuta}}} one{{digits} minutę temu} many{{digits} minut temu} other{{digits} minuty temu}}
ps: {minutes, plural, =0{{numeric, select, true{{minutes} دقيقې مخکې} other{دا دقيقه}}} =1{{minutes} دقيقه مخکې} other{{minutes} دقيقې مخکې}}
pt: {minutes, plural, =0{{numeric, select, true{há {minutes} minutos} other{este minuto}}} =1{há {minutes} minuto} other{há {minutes} minutos}}
ro: {minutes, plural, =0{{numeric, select, true{acum {minutes} de minute} other{minutul acesta}}} =1{acum {minutes} minut} few{acum {minutes} minute} other{acum {minutes} de minute}}
ru: {minutes, plural, =0{{numeric, select, true{{minutes} минуты назад} other{в эту минуту}}} =1{{minutes} минуту назад} many{{minutes} минут назад} other{{minutes} минуты назад}}
sc: {minutes, plural, =0{{numeric, select, true{{minutes} minutos a como} other{custu minutu}}} =1{{minutes} minutu a como} other{{minutes} minutos a como}}
sd: {minutes, plural, =0{{numeric, select, true{{minutes} منٽ پهرين} other{هن منٽ}}} other{{minutes} منٽ پهرين}}
se: {count, plural, one{{digits} minuhta árat} other{{digits} minuhtta árat}}
se_fi: {minutes, plural, =0{{numeric, select, true{{minutes} minuhta áigi} other{dán minuhta}}} =1{{minutes} minuhtta áigi} other{{minutes} minuhta áigi}}
si: {minutes, plural, =0{{numeric, select, true{මිනිත්තු {minutes}කට පෙර} other{මෙම මිනිත්තුව}}} other{මිනිත්තු {minutes}කට පෙර}}
sk: {minutes, plural, zero{{numeric, select, true{pred {minutes} minútami} other{v tejto minúte}}} one{pred {minutes} minútou} many{pred {minutes} minúty} other{pred {minutes} minútami}}
sl: {minutes, plural, =0{{numeric, select, true{pred {minutes} minutami} other{to minuto}}} =1{pred {minutes} minuto} =2{pred {minutes} minutama} other{pred {minutes} minutami}}
sq: {minutes, plural, zero{{numeric, select, true{{minutes} minuta më parë} other{këtë minutë}}} one{{minutes} minutë më parë} other{{minutes} minuta më parë}}
sr: {minutes, plural, =0{{numeric, select, true{пре {minutes} минута} other{овог минута}}} other{пре {minutes} минута}}
sr_latn: {minutes, plural, =0{{numeric, select, true{pre {minutes} minuta} other{ovog minuta}}} other{pre {minutes} minuta}}
sv: {minutes, plural, =0{{numeric, select, true{för {minutes} minuter sedan} other{denna minut}}} =1{för {minutes} minut sedan} other{för {minutes} minuter sedan}}
sw: {minutes, plural, =0{{numeric, select, true{dakika {minutes} zilizopita} other{dakika hii}}} =1{dakika {minutes} iliyopita} other{dakika {minutes} zilizopita}}
ta: {minutes, plural, =0{{numeric, select, true{{minutes} நிமிடங்களுக்கு முன்} other{இந்த ஒரு நிமிடத்தில்}}} =1{{minutes} நிமிடத்திற்கு முன்} other{{minutes} நிமிடங்களுக்கு முன்}}
te: {minutes, plural, zero{{numeric, select, true{{minutes} నిమిషాల క్రితం} other{ఈ నిమిషం}}} one{{minutes} నిమిషం క్రితం} other{{minutes} నిమిషాల క్రితం}}
tg: {minutes, plural, =0{{numeric, select, true{{minutes} дақиқа пеш} other{дақиқаи ҷорӣ}}} other{{minutes} дақиқа пеш}}
th: {minutes, plural, zero{{numeric, select, true{{minutes} นาทีที่ผ่านมา} other{นาทีนี้}}} other{{minutes} นาทีที่ผ่านมา}}
tk: {minutes, plural, zero{{numeric, select, true{{minutes} minut öň} other{şu minut}}} other{{minutes} minut öň}}
tr: {minutes, plural, =0{{numeric, select, true{{minutes} dakika önce} other{bu dakika}}} other{{minutes} dakika önce}}
tt: {minutes, plural, zero{{numeric, select, true{{minutes} минут элек} other{бу минутта}}} other{{minutes} минут элек}}
ug: {digits} مىنۇت ئىلگىرى
uk: {count, plural, zero{{numeric, select, true{{digits} хвилини тому} other{цієї хвилини}}} one{{digits} хвилину тому} many{{digits} хвилин тому} other{{digits} хвилини тому}}
ur: {minutes, plural, =0{{numeric, select, true{{minutes} منٹ پہلے} other{اس منٹ}}} other{{minutes} منٹ پہلے}}
uz: {minutes, plural, =0{{numeric, select, true{{minutes} daqiqa oldin} other{shu daqiqada}}} other{{minutes} daqiqa oldin}}
uz_cyrl: {minutes, plural, other{{minutes} дақиқа олдин}}
vi: {minutes, plural, zero{{numeric, select, true{{minutes} phút trước} other{phút này}}} other{{minutes} phút trước}}
zh: {minutes, plural, =0{{numeric, select, true{{minutes}分钟前} other{此刻}}} other{{minutes}分钟前}}
zh_hant: {minutes, plural, =0{{numeric, select, true{{minutes} 分鐘前} other{這一分鐘}}} other{{minutes} 分鐘前}}
zu: {minutes, plural, =0{{numeric, select, true{{minutes} amaminithi edlule} other{leli minithi}}} =1{{minutes} iminithi eledlule} other{{minutes} amaminithi edlule}}
