Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# weeksPast
source: {count, plural, zero{{numeric, select, true{{digits} weeks ago} other{this week}}} one{{numeric, select, true{{digits} week ago} other{last week}}} other{{digits} weeks ago}}
af: {weeks, plural, zero{{numeric, select, true{{weeks} weke gelede} other{hierdie week}}} one{{numeric, select, true{{weeks} week gelede} other{verlede week}}} other{{weeks} weke gelede}}
am: {count, plural, zero{{numeric, select, true{ከ{digits} ሳምንታት በፊት} other{በዚህ ሳምንት}}} one{{numeric, select, true{ከ{digits} ሳምንት በፊት} other{ያለፈው ሳምንት}}} other{ከ{digits} ሳምንታት በፊት}}
ar: {weeks, plural, =0{{numeric, select, true{قبل {weeks} أسبوع} other{هذا الأسبوع}}} =1{{numeric, select, true{قبل أسبوع واحد} other{الأسبوع الماضي}}} =2{قبل أسبوعين} few{قبل {weeks} أسابيع} many{قبل {weeks} أسبوعًا} other{قبل {weeks} أسبوع}}
as: {weeks, plural, zero{{numeric, select, true{{weeks} সপ্তাহ পূৰ্বে} other{এই সপ্তাহ}}} one{{numeric, select, true{{weeks} সপ্তাহ পূৰ্বে} other{যোৱা সপ্তাহ}}} other{{weeks} সপ্তাহ পূৰ্বে}}
ast: {weeks, plural, =0{{numeric, select, true{hai {weeks} selmanes} other{esta selmana}}} =1{{numeric, select, true{hai {weeks} selmana} other{la selmana pasada}}} other{hai {weeks} selmanes}}
az: {weeks, plural, zero{{numeric, select, true{{weeks} həftə öncə} other{bu həftə}}} one{{numeric, select, true{{weeks} həftə öncə} other{keçən həftə}}} other{{weeks} həftə öncə}}
be: {weeks, plural, =0{{numeric, select, true{{weeks} тыдня таму} other{на гэтым тыдні}}} =1{{numeric, select, true{{weeks} тыдзень таму} other{на мінулым тыдні}}} few{{weeks} тыдні таму} many{{weeks} тыдняў таму} other{{weeks} тыдня таму}}
bg: {weeks, plural, =0{{numeric, select, true{преди {weeks} седмици} other{тази седмица}}} =1{{numeric, select, true{преди {weeks} седмица} other{предходната седмица}}} other{преди {weeks} седмици}}
bn: {weeks, plural, zero{{numeric, select, true{{weeks} সপ্তাহ আগে} other{এই সপ্তাহ}}} one{{numeric, select, true{{weeks} সপ্তাহ আগে} other{গত সপ্তাহ}}} other{{weeks} সপ্তাহ আগে}}
br: {weeks, plural, =0{{numeric, select, true{{weeks} sizhun zo} other{ar sizhun-mañ}}} =1{{numeric, select, true{{weeks} sizhun zo} other{ar sizhun diaraok}}} many{{weeks} a sizhunioù zo} other{{weeks} sizhun zo}}
bs: {weeks, plural, =0{{numeric, select, true{prije {weeks} sedmica} other{ove sedmice}}} =1{{numeric, select, true{prije {weeks} sedmicu} other{prošle sedmice}}} few{prije {weeks} sedmice} other{prije {weeks} sedmica}}
bs_cyrl: {count, plural, zero{{numeric, select, true{прије {digits} седмица} other{ове седмице}}} one{{numeric, select, true{прије {digits} седмицу} other{прошле седмице}}} few{прије {digits} седмице} other{прије {digits} седмица}}
ca: {weeks, plural, =0{{numeric, select, true{fa {weeks} setmanes} other{aquesta setmana}}} =1{{numeric, select, true{fa {weeks} setmana} other{la setmana passada}}} other{fa {weeks} setmanes}}
cs: {weeks, plural, =0{{numeric, select, true{před {weeks} týdny} other{tento týden}}} =1{{numeric, select, true{před {weeks} týdnem} other{minulý týden}}} many{před {weeks} týdne} other{před {weeks} týdny}}
cy: {weeks, plural, =0{{numeric, select, true{{weeks} wythnos yn ôl} other{yr wythnos hon}}} =1{{numeric, select, true{{weeks} wythnos yn ôl} other{wythnos ddiwethaf}}} other{{weeks} wythnos yn ôl}}
da: {weeks, plural, =0{{numeric, select, true{for {weeks} uger siden} other{denne uge}}} =1{{numeric, select, true{for {weeks} uge siden} other{sidste uge}}} other{for {weeks} uger siden}}
de: {weeks, plural, =0{{numeric, select, true{vor {weeks} Wochen} other{diese Woche}}} =1{{numeric, select, true{vor {weeks} Woche} other{letzte Woche}}} other{vor {weeks} Wochen}}
dz: བངུན་ཕྲག་ {weeks} ཧེ་མ་
el: {weeks, plural, =0{{numeric, select, true{πριν από {weeks} εβδομάδες} other{τρέχουσα εβδομάδα}}} =1{{numeric, select, true{πριν από {weeks} εβδομάδα} other{προηγούμενη εβδομάδα}}} other{πριν από {weeks} εβδομάδες}}
eo: {weeks, plural, =0{{numeric, select, true{antaŭ {weeks} semajnoj} other{nuna semajno}}} =1{{numeric, select, true{antaŭ {weeks} semajno} other{pasinta semajno}}} other{antaŭ {weeks} semajnoj}}
es: {weeks, plural, zero{{numeric, select, true{hace {weeks} semanas} other{esta semana}}} one{{numeric, select, true{hace {weeks} semana} other{la semana pasada}}} other{hace {weeks} semanas}}
et: {weeks, plural, =0{{numeric, select, true{{weeks} nädala eest} other{käesolev nädal}}} =1{{numeric, select, true{{weeks} nädala eest} other{eelmine nädal}}} other{{weeks} nädala eest}}
eu: {weeks, plural, zero{{numeric, select, true{Duela {weeks} aste} other{aste honetan}}} one{{numeric, select, true{Duela {weeks} aste} other{aurreko astean}}} other{Duela {weeks} aste}}
fa: {weeks, plural, =0{{numeric, select, true{{weeks} هفته پیش} other{این هفته}}} =1{{numeric, select, true{{weeks} هفته پیش} other{هفتهٔ گذشته}}} other{{weeks} هفته پیش}}
fi: {weeks, plural, zero{{numeric, select, true{{weeks} viikkoa sitten} other{tällä viikolla}}} one{{numeric, select, true{{weeks} viikko sitten} other{viime viikolla}}} other{{weeks} viikkoa sitten}}
fil: {weeks, plural, =0{{numeric, select, true{{weeks} linggo ang nakalipas} other{sa linggong ito}}} =1{{numeric, select, true{{weeks} linggo ang nakalipas} other{nakalipas na linggo}}} other{{weeks} linggo ang nakalipas}}
fo: {weeks, plural, zero{{numeric, select, true{{weeks} vikur síðan} other{hesu viku}}} one{{numeric, select, true{{weeks} vika síðan} other{seinastu viku}}} other{{weeks} vikur síðan}}
fr: {weeks, plural, zero{{numeric, select, true{il y a {weeks} semaines} other{cette semaine}}} one{{numeric, select, true{il y a {weeks} semaine} other{la semaine dernière}}} other{il y a {weeks} semaines}}
fur: {count, plural, one{{digits} setemane indaûr} other{{digits} setemanis indaûr}}
fy: {weeks, plural, =0{{numeric, select, true{{weeks} wiken lyn} other{dizze wike}}} =1{{numeric, select, true{{weeks} wike lyn} other{foarige wike}}} other{{weeks} wiken lyn}}
ga: {weeks, plural, zero{{numeric, select, true{{weeks} seachtain ó shin} other{an tseachtain seo}}} one{{numeric, select, true{{weeks} seachtain ó shin} other{an tseachtain seo caite}}} two{{weeks} sheachtain ó shin} few{{weeks} seachtaine ó shin} many{{weeks} seachtaine ó shin} other{{weeks} seachtain ó shin}}
gd: {weeks, plural, =0{{numeric, select, true{{weeks} seachdain air ais} other{an t-seachdain seo}}} =1{{numeric, select, true{{weeks} seachdain air ais} other{an t-seachdain seo chaidh}}} =2{{weeks} sheachdain air ais} few{{weeks} seachdainean air ais} other{{weeks} seachdain air ais}}
gl: {weeks, plural, =0{{numeric, select, true{hai {weeks} semanas} other{esta semana}}} =1{{numeric, select, true{hai {weeks} semana} other{a semana pasada}}} other{hai {weeks} semanas}}
gu: {weeks, plural, zero{{numeric, select, true{{weeks} અઠવાડિયા પહેલાં} other{આ અઠવાડિયે}}} one{{numeric, select, true{{weeks} અઠવાડિયા પહેલાં} other{ગયા અઠવાડિયે}}} other{{weeks} અઠવાડિયા પહેલાં}}
he: {weeks, plural, =0{{numeric, select, true{לפני {weeks} שבועות} other{השבוע}}} =1{{numeric, select, true{לפני שבוע} other{השבוע שעבר}}} =2{לפני שבועיים} other{לפני {weeks} שבועות}}
hi: {weeks, plural, zero{{numeric, select, true{{weeks} सप्ताह पहले} other{इस सप्ताह}}} one{{numeric, select, true{{weeks} सप्ताह पहले} other{पिछला सप्ताह}}} other{{weeks} सप्ताह पहले}}
hi_latn: {weeks, plural, =0{{numeric, select, true{{weeks} hafte pehle} other{is hafte}}} =1{{numeric, select, true{{weeks} hafte pehle} other{pichhla hafta}}} other{{weeks} hafte pehle}}
hr: {weeks, plural, zero{{numeric, select, true{prije {weeks} tjedana} other{ovaj tjedan}}} one{{numeric, select, true{prije {weeks} tjedan} other{prošli tjedan}}} few{prije {weeks} tjedna} other{prije {weeks} tjedana}}
hu: {weeks, plural, =0{{numeric, select, true{{weeks} héttel ezelőtt} other{ez a hét}}} =1{{numeric, select, true{{weeks} héttel ezelőtt} other{előző hét}}} other{{weeks} héttel ezelőtt}}
hy: {weeks, plural, zero{{numeric, select, true{{weeks} շաբաթ առաջ} other{այս շաբաթ}}} one{{numeric, select, true{{weeks} շաբաթ առաջ} other{նախորդ շաբաթ}}} other{{weeks} շաբաթ առաջ}}
ia: {weeks, plural, =0{{numeric, select, true{{weeks} septimanas retro} other{iste septimana}}} =1{{numeric, select, true{{weeks} septimana retro} other{le septimana passate}}} other{{weeks} septimanas retro}}
id: {weeks, plural, zero{{numeric, select, true{{weeks} minggu yang lalu} other{minggu ini}}} one{{numeric, select, true{{weeks} minggu yang lalu} other{minggu lalu}}} other{{weeks} minggu yang lalu}}
is: {weeks, plural, zero{{numeric, select, true{fyrir {weeks} vikum} other{í þessari viku}}} one{{numeric, select, true{fyrir {weeks} viku} other{í síðustu viku}}} other{fyrir {weeks} vikum}}
it: {weeks, plural, zero{{numeric, select, true{{weeks} settimane fa} other{questa settimana}}} one{{numeric, select, true{{weeks} settimana fa} other{settimana scorsa}}} other{{weeks} settimane fa}}
ja: {weeks, plural, =0{{numeric, select, true{{weeks} 週間前} other{今週}}} =1{{numeric, select, true{{weeks} 週間前} other{先週}}} other{{weeks} 週間前}}
ka: {weeks, plural, zero{{numeric, select, true{{weeks} კვირის წინ} other{ამ კვირაში}}} one{{numeric, select, true{{weeks} კვირის წინ} other{გასულ კვირაში}}} other{{weeks} კვირის წინ}}
kab: {weeks, plural, zero{{numeric, select, true{{weeks} n dduṛtat aya} other{dduṛt -a}}} one{{numeric, select, true{{weeks} n dduṛt aya} other{dduṛt izrin}}} other{{weeks} n dduṛtat aya}}
kk: {weeks, plural, zero{{numeric, select, true{{weeks} апта бұрын} other{осы апта}}} one{{numeric, select, true{{weeks} апта бұрын} other{өткен апта}}} other{{weeks} апта бұрын}}
km: {count, plural, zero{{numeric, select, true{{digits} សប្ដាហ៍​មុន} other{សប្ដាហ៍​នេះ}}} one{{numeric, select, true{{digits} សប្ដាហ៍​មុន} other{សប្ដាហ៍​មុន}}} other{{digits} សប្ដាហ៍​មុន}}
kn: {weeks, plural, =0{{numeric, select, true{{weeks} ವಾರಗಳ ಹಿಂದೆ} other{ಈ ವಾರ}}} =1{{numeric, select, true{{weeks} ವಾರದ ಹಿಂದೆ} other{ಕಳೆದ ವಾರ}}} other{{weeks} ವಾರಗಳ ಹಿಂದೆ}}
ko: {weeks, plural, zero{{numeric, select, true{{weeks}주 전} other{이번 주}}} one{{numeric, select, true{{weeks}주 전} other{지난주}}} other{{weeks}주 전}}
ky: {weeks, plural, =0{{numeric, select, true{{weeks} апта мурун} other{ушул аптада}}} =1{{numeric, select, true{{weeks} апта мурун} other{өткөн аптада}}} other{{weeks} апта мурун}}
lb: {weeks, plural, zero{{numeric, select, true{viru(n) {weeks} Wochen} other{dës Woch}}} one{{numeric, select, true{virun {weeks} Woch} other{lescht Woch}}} other{viru(n) {weeks} Wochen}}
lo: {weeks, plural, =0{{numeric, select, true{{weeks} ອາທິດກ່ອນ} other{ອາທິດນີ້}}} =1{{numeric, select, true{{weeks} ອາທິດກ່ອນ} other{ອາທິດແລ້ວ}}} other{{weeks} ອາທິດກ່ອນ}}
lt: {weeks, plural, =0{{numeric, select, true{prieš {weeks} savaičių} other{šią savaitę}}} =1{{numeric, select, true{prieš {weeks} savaitę} other{praėjusią savaitę}}} few{prieš {weeks} savaites} many{prieš {weeks} savaitės} other{prieš {weeks} savaičių}}
lv: {weeks, plural, =0{{numeric, select, true{pirms {weeks} nedēļām} other{šajā nedēļā}}} =1{{numeric, select, true{pirms {weeks} nedēļas} other{pagājušajā nedēļā}}} other{pirms {weeks} nedēļām}}
mai: {weeks, plural, zero{{numeric, select, true{{weeks} सप्ताह पहिले} other{एहि सप्ताह}}} one{{numeric, select, true{{weeks} सप्ताह पहिले} other{बीतल सप्ताह}}} other{{weeks} सप्ताह पहिले}}
mi: {count, plural, zero{{numeric, select, true{-{digits} wiki i mua} other{i tēnei wiki}}} one{{numeric, select, true{-{digits} wiki i mua} other{i tērā wiki}}} other{-{digits} wiki i mua}}
mk: {weeks, plural, =0{{numeric, select, true{пред {weeks} седмици} other{оваа седмица}}} =1{{numeric, select, true{пред {weeks} седмица} other{минатата седмица}}} other{пред {weeks} седмици}}
ml: {weeks, plural, zero{{numeric, select, true{{weeks} ആഴ്ച മുമ്പ്} other{ഈ ആഴ്ച}}} one{{numeric, select, true{{weeks} ആഴ്ച മുമ്പ്} other{കഴിഞ്ഞ ആഴ്‌ച}}} other{{weeks} ആഴ്ച മുമ്പ്}}
mn: {weeks, plural, zero{{numeric, select, true{{weeks} долоо хоногийн өмнө} other{энэ долоо хоног}}} one{{numeric, select, true{{weeks} долоо хоногийн өмнө} other{өнгөрсөн долоо хоног}}} other{{weeks} долоо хоногийн өмнө}}
mr: {weeks, plural, =0{{numeric, select, true{{weeks} आठवड्यांपूर्वी} other{हा आठवडा}}} =1{{numeric, select, true{{weeks} आठवड्यापूर्वी} other{मागील आठवडा}}} other{{weeks} आठवड्यांपूर्वी}}
ms: {weeks, plural, zero{{numeric, select, true{{weeks} minggu lalu} other{minggu ini}}} one{{numeric, select, true{{weeks} minggu lalu} other{minggu lalu}}} other{{weeks} minggu lalu}}
ms_arab: {count, plural, zero{{numeric, select, true{{digits} ميڠݢو لالو} other{ميڠݢو ني}}} one{{numeric, select, true{{digits} ميڠݢو لالو} other{ميڠݢو لڤس}}} other{{digits} ميڠݢو لالو}}
mt: {weeks, plural, zero{{numeric, select, true{{weeks} ġimgħa ilu} other{din il-ġimgħa}}} one{{numeric, select, true{ġimgħa ilu} other{il-ġimgħa li għaddiet}}} two{ġimagħtejn ilu} few{{weeks} ġimgħat ilu} many{{weeks}-il ġimgħa ilu} other{{weeks} ġimgħa ilu}}
my: {weeks, plural, =0{{numeric, select, true{ပြီးခဲ့သည့် {weeks} ပတ်} other{ယခု သီတင်းပတ်}}} =1{{numeric, select, true{ပြီးခဲ့သည့် {weeks} ပတ်} other{ပြီးခဲ့သည့် သီတင်းပတ်}}} other{ပြီးခဲ့သည့် {weeks} ပတ်}}
ne: {weeks, plural, =0{{numeric, select, true{{weeks} हप्ता पहिले} other{यो हप्ता}}} =1{{numeric, select, true{{weeks} हप्ता पहिले} other{गत हप्ता}}} other{{weeks} हप्ता पहिले}}
nl: {weeks, plural, zero{{numeric, select, true{{weeks} weken geleden} other{deze week}}} one{{numeric, select, true{{weeks} week geleden} other{vorige week}}} other{{weeks} weken geleden}}
no: {weeks, plural, zero{{numeric, select, true{for {weeks} uker siden} other{denne uken}}} one{{numeric, select, true{for {weeks} uke siden} other{forrige uke}}} other{for {weeks} uker siden}}
or: {weeks, plural, zero{{numeric, select, true{{weeks} ସପ୍ତାହ ପୂର୍ବେ} other{ଏହି ସପ୍ତାହ}}} one{{numeric, select, true{{weeks} ସପ୍ତାହ ପୂର୍ବେ} other{ଗତ ସପ୍ତାହ}}} other{{weeks} ସପ୍ତାହ ପୂର୍ବେ}}
pa: {weeks, plural, =0{{numeric, select, true{{weeks} ਹਫ਼ਤੇ ਪਹਿਲਾਂ} other{ਇਹ ਹਫ਼ਤਾ}}} =1{{numeric, select, true{{weeks} ਹਫ਼ਤਾ ਪਹਿਲਾਂ} other{ਪਿਛਲਾ ਹਫ਼ਤਾ}}} other{{weeks} ਹਫ਼ਤੇ ਪਹਿਲਾਂ}}
pl: {count, plural, zero{{numeric, select, true{{digits} tygodnia temu} other{w tym tygodniu}}} one{{numeric, select, true{{digits} tydzień temu} other{w zeszłym tygodniu}}} few{{digits} tygodnie temu} many{{digits} tygodni temu} other{{digits} tygodnia temu}}
ps: {weeks, plural, =0{{numeric, select, true{{weeks} اونۍ مخکې} other{دا اونۍ}}} =1{{numeric, select, true{{weeks} اونۍ مخکې} other{تيره اونۍ}}} other{{weeks} اونۍ مخکې}}
pt: {weeks, plural, =0{{numeric, select, true{há {weeks} semanas} other{esta semana}}} =1{{numeric, select, true{há {weeks} semana} other{semana passada}}} other{há {weeks} semanas}}
ro: {weeks, plural, =0{{numeric, select, true{acum {weeks} de săptămâni} other{săptămâna aceasta}}} =1{{numeric, select, true{acum {weeks} săptămână} other{săptămâna trecută}}} few{acum {weeks} săptămâni} other{acum {weeks} de săptămâni}}
ru: {weeks, plural, =0{{numeric, select, true{{weeks} недели назад} other{на этой неделе}}} =1{{numeric, select, true{{weeks} неделю назад} other{на прошлой неделе}}} many{{weeks} недель назад} other{{weeks} недели назад}}
sc: {weeks, plural, =0{{numeric, select, true{{weeks} chidas a como} other{custa chida}}} =1{{numeric, select, true{{weeks} chida a como} other{sa chida colada}}} other{{weeks} chidas a como}}
sd: {weeks, plural, =0{{numeric, select, true{{weeks} هفتا پهرين} other{هن هفتي}}} =1{{numeric, select, true{{weeks} هفتا پهرين} other{پوئين هفتي}}} other{{weeks} هفتا پهرين}}
se: {count, plural, one{{digits} vahku árat} other{{digits} vahkku árat}}
se_fi: {weeks, plural, =0{{numeric, select, true{{weeks} vahku dás ovdal} other{dán vahku}}} =1{{numeric, select, true{{weeks} vahkku dás ovdal} other{mannan vahku}}} other{{weeks} vahku dás ovdal}}
si: {weeks, plural, =0{{numeric, select, true{සති {weeks}කට පෙර} other{මෙම සතිය}}} =1{{numeric, select, true{සති {weeks}කට පෙර} other{පසුගිය සතිය}}} other{සති {weeks}කට පෙර}}
sk: {weeks, plural, zero{{numeric, select, true{pred {weeks} týždňami} other{tento týždeň}}} one{{numeric, select, true{pred {weeks} týždňom} other{minulý týždeň}}} many{pred {weeks} týždňa} other{pred {weeks} týždňami}}
sl: {weeks, plural, =0{{numeric, select, true{pred {weeks} tedni} other{ta teden}}} =1{{numeric, select, true{pred {weeks} tednom} other{prejšnji teden}}} =2{pred {weeks} tednoma} other{pred {weeks} tedni}}
sq: {weeks, plural, zero{{numeric, select, true{{weeks} javë më parë} other{këtë javë}}} one{{numeric, select, true{{weeks} javë më parë} other{javën e kaluar}}} other{{weeks} javë më parë}}
sr: {weeks, plural, =0{{numeric, select, true{пре {weeks} недеља} other{ове недеље}}} =1{{numeric, select, true{пре {weeks} недеље} other{прошле недеље}}} few{пре {weeks} недеље} other{пре {weeks} недеља}}
sr_latn: {weeks, plural, =0{{numeric, select, true{pre {weeks} nedelja} other{ove nedelje}}} =1{{numeric, select, true{pre {weeks} nedelje} other{prošle nedelje}}} few{pre {weeks} nedelje} other{pre {weeks} nedelja}}
sv: {weeks, plural, =0{{numeric, select, true{för {weeks} veckor sedan} other{denna vecka}}} =1{{numeric, select, true{för {weeks} vecka sedan} other{förra veckan}}} other{för {weeks} veckor sedan}}
sw: {weeks, plural, =0{{numeric, select, true{wiki {weeks} zilizopita} other{wiki hii}}} =1{{numeric, select, true{wiki {weeks} iliyopita} other{wiki iliyopita}}} other{wiki {weeks} zilizopita}}
ta: {weeks, plural, =0{{numeric, select, true{{weeks} வாரங்களுக்கு முன்} other{இந்த வாரம்}}} =1{{numeric, select, true{{weeks} வாரத்திற்கு முன்} other{கடந்த வாரம்}}} other{{weeks} வாரங்களுக்கு முன்}}
te: {weeks, plural, zero{{numeric, select, true{{weeks} వారాల క్రితం} other{ఈ వారం}}} one{{numeric, select, true{{weeks} వారం క్రితం} other{గత వారం}}} other{{weeks} వారాల క్రితం}}
tg: {weeks, plural, =0{{numeric, select, true{{weeks} ҳафта пеш} other{ҳафтаи ҷорӣ}}} =1{{numeric, select, true{{weeks} ҳафта пеш} other{ҳафтаи гузашта}}} other{{weeks} ҳафта пеш}}
th: {weeks, plural, zero{{numeric, select, true{{weeks} สัปดาห์ที่ผ่านมา} other{สัปดาห์นี้}}} one{{numeric, select, true{{weeks} สัปดาห์ที่ผ่านมา} other{สัปดาห์ที่แล้ว}}} other{{weeks} สัปดาห์ที่ผ่านมา}}
tk: {weeks, plural, zero{{numeric, select, true{{weeks} hepde öň} other{şu hepde}}} one{{numeric, select, true{{weeks} hepde öň} other{geçen hepde}}} other{{weeks} hepde öň}}
tr: {weeks, plural, =0{{numeric, select, true{{weeks} hafta önce} other{bu hafta}}} =1{{numeric, select, true{{weeks} hafta önce} other{geçen hafta}}} other{{weeks} hafta önce}}
tt: {weeks, plural, zero{{numeric, select, true{{weeks} атна элек} other{бу атнада}}} one{{numeric, select, true{{weeks} атна элек} other{узган атнада}}} other{{weeks} атна элек}}
ug: {count, plural, zero{{numeric, select, true{{digits} ھەپتە ئىلگىرى} other{بۇ ھەپتە}}} one{{numeric, select, true{{digits} ھەپتە ئىلگىرى} other{ئۆتكەن ھەپتە}}} other{{digits} ھەپتە ئىلگىرى}}
uk: {count, plural, zero{{numeric, select, true{{digits} тижня тому} other{цього тижня}}} one{{numeric, select, true{{digits} тиждень тому} other{минулого тижня}}} few{{digits} тижні тому} many{{digits} тижнів тому} other{{digits} тижня тому}}
ur: {weeks, plural, =0{{numeric, select, true{{weeks} ہفتے پہلے} other{اس ہفتہ}}} =1{{numeric, select, true{{weeks} ہفتہ پہلے} other{گزشتہ ہفتے}}} other{{weeks} ہفتے پہلے}}
uz: {weeks, plural, =0{{numeric, select, true{{weeks} hafta oldin} other{shu hafta}}} =1{{numeric, select, true{{weeks} hafta oldin} other{o‘tgan hafta}}} other{{weeks} hafta oldin}}
uz_cyrl: {weeks, plural, zero{{numeric, select, true{{weeks} ҳафта олдин} other{бу ҳафта}}} one{{numeric, select, true{{weeks} ҳафта олдин} other{ўтган ҳафта}}} other{{weeks} ҳафта олдин}}
vi: {weeks, plural, zero{{numeric, select, true{{weeks} tuần trước} other{tuần này}}} one{{numeric, select, true{{weeks} tuần trước} other{tuần trước}}} other{{weeks} tuần trước}}
zh: {weeks, plural, =0{{numeric, select, true{{weeks}周前} other{本周}}} =1{{numeric, select, true{{weeks}周前} other{上周}}} other{{weeks}周前}}
zh_hant: {weeks, plural, =0{{numeric, select, true{{weeks} 週前} other{本週}}} =1{{numeric, select, true{{weeks} 週前} other{上週}}} other{{weeks} 週前}}
zu: {weeks, plural, =0{{numeric, select, true{amaviki angu-{weeks} edlule} other{leli viki}}} =1{{numeric, select, true{evikini elingu-{weeks} eledlule} other{iviki eledlule}}} other{amaviki angu-{weeks} edlule}}
