Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# yearsFuture
source: {count, plural, zero{{numeric, select, true{in {digits} years} other{this year}}} one{{numeric, select, true{in {digits} year} other{next year}}} other{in {digits} years}}
af: {years, plural, zero{{numeric, select, true{oor {years} jaar} other{hierdie jaar}}} one{{numeric, select, true{oor {years} jaar} other{volgende jaar}}} other{oor {years} jaar}}
am: {count, plural, zero{{numeric, select, true{በ{digits} ዓመታት ውስጥ} other{በዚህ ዓመት}}} one{{numeric, select, true{በ{digits} ዓመታት ውስጥ} other{የሚቀጥለው ዓመት}}} other{በ{digits} ዓመታት ውስጥ}}
ar: {years, plural, =0{{numeric, select, true{خلال {years} سنة} other{السنة الحالية}}} =1{{numeric, select, true{خلال سنة واحدة} other{السنة القادمة}}} =2{خلال سنتين} few{خلال {years} سنوات} other{خلال {years} سنة}}
as: {years, plural, zero{{numeric, select, true{{years} বছৰত} other{এই বছৰ}}} one{{numeric, select, true{{years} বছৰত} other{অহা বছৰ}}} other{{years} বছৰত}}
ast: {years, plural, =0{{numeric, select, true{en {years} años} other{esti añu}}} =1{{numeric, select, true{en {years} añu} other{l’añu viniente}}} other{en {years} años}}
az: {years, plural, zero{{numeric, select, true{{years} il ərzində} other{bu il}}} one{{numeric, select, true{{years} il ərzində} other{gələn il}}} other{{years} il ərzində}}
be: {years, plural, =0{{numeric, select, true{праз {years} года} other{у гэтым годзе}}} =1{{numeric, select, true{праз {years} год} other{у наступным годзе}}} few{праз {years} гады} many{праз {years} гадоў} other{праз {years} года}}
bg: {years, plural, =0{{numeric, select, true{след {years} години} other{тази година}}} =1{{numeric, select, true{след {years} година} other{следващата година}}} other{след {years} години}}
bn: {years, plural, zero{{numeric, select, true{{years} বছরে} other{এই বছর}}} one{{numeric, select, true{{years} বছরে} other{পরের বছর}}} other{{years} বছরে}}
br: {years, plural, =0{{numeric, select, true{a-benn {years} vloaz} other{hevlene}}} =1{{numeric, select, true{a-benn {years} bloaz} other{ar bloaz a zeu}}} few{a-benn {years} bloaz} many{a-benn {years} a vloazioù} other{a-benn {years} vloaz}}
bs: {years, plural, =0{{numeric, select, true{za {years} godina} other{ove godine}}} =1{{numeric, select, true{za {years} godinu} other{sljedeće godine}}} few{za {years} godine} other{za {years} godina}}
bs_cyrl: {count, plural, zero{{numeric, select, true{за {digits} година} other{ове године}}} one{{numeric, select, true{за {digits} годину} other{сљедеће године}}} few{за {digits} године} other{за {digits} година}}
ca: {years, plural, =0{{numeric, select, true{d’aquí a {years} anys} other{enguany}}} =1{{numeric, select, true{d’aquí a {years} any} other{l’any que ve}}} other{d’aquí a {years} anys}}
cs: {years, plural, =0{{numeric, select, true{za {years} let} other{tento rok}}} =1{{numeric, select, true{za {years} rok} other{příští rok}}} few{za {years} roky} many{za {years} roku} other{za {years} let}}
cy: {years, plural, =0{{numeric, select, true{ymhen {years} mlynedd} other{eleni}}} =1{{numeric, select, true{ymhen blwyddyn} other{blwyddyn nesaf}}} =2{ymhen {years} flynedd} few{ymhen {years} blynedd} many{ymhen {years} blynedd} other{ymhen {years} mlynedd}}
da: {years, plural, =0{{numeric, select, true{om {years} år} other{i år}}} =1{{numeric, select, true{om {years} år} other{næste år}}} other{om {years} år}}
de: {years, plural, =0{{numeric, select, true{in {years} Jahren} other{dieses Jahr}}} =1{{numeric, select, true{in {years} Jahr} other{nächstes Jahr}}} other{in {years} Jahren}}
dz: ལོ་འཁོར་ {years} ནང་
el: {years, plural, =0{{numeric, select, true{σε {years} έτη} other{φέτος}}} =1{{numeric, select, true{σε {years} έτος} other{επόμενο έτος}}} other{σε {years} έτη}}
eo: {years, plural, =0{{numeric, select, true{post {years} jaroj} other{nuna jaro}}} =1{{numeric, select, true{post {years} jaro} other{venonta jaro}}} other{post {years} jaroj}}
es: {years, plural, zero{{numeric, select, true{dentro de {years} años} other{este año}}} one{{numeric, select, true{dentro de {years} año} other{el próximo año}}} other{dentro de {years} años}}
et: {years, plural, =0{{numeric, select, true{{years} aasta pärast} other{käesolev aasta}}} =1{{numeric, select, true{{years} aasta pärast} other{järgmine aasta}}} other{{years} aasta pärast}}
eu: {years, plural, zero{{numeric, select, true{{years} urte barru} other{aurten}}} one{{numeric, select, true{{years} urte barru} other{hurrengo urtean}}} other{{years} urte barru}}
fa: {years, plural, =0{{numeric, select, true{{years} سال بعد} other{امسال}}} =1{{numeric, select, true{{years} سال بعد} other{سال آینده}}} other{{years} سال بعد}}
fi: {years, plural, zero{{numeric, select, true{{years} vuoden päästä} other{tänä vuonna}}} one{{numeric, select, true{{years} vuoden päästä} other{ensi vuonna}}} other{{years} vuoden päästä}}
fil: {years, plural, =0{{numeric, select, true{sa {years} taon} other{ngayong taon}}} =1{{numeric, select, true{sa {years} taon} other{susunod na taon}}} other{sa {years} taon}}
fo: {years, plural, zero{{numeric, select, true{um {years} ár} other{í ár}}} one{{numeric, select, true{um {years} ár} other{næsta ár}}} other{um {years} ár}}
fr: {years, plural, zero{{numeric, select, true{dans {years} ans} other{cette année}}} one{{numeric, select, true{dans {years} an} other{l’année prochaine}}} other{dans {years} ans}}
fur: {count, plural, one{ca di {digits} an} other{ca di {digits} agns}}
fy: {years, plural, =0{{numeric, select, true{Oer {years} jier} other{dit jier}}} =1{{numeric, select, true{Oer {years} jier} other{folgjend jier}}} other{Oer {years} jier}}
ga: {years, plural, zero{{numeric, select, true{i gceann {years} bliain} other{i mbliana}}} one{{numeric, select, true{i gceann {years} bliana} other{an bhliain seo chugainn}}} two{i gceann {years} bhliain} few{i gceann {years} bliana} many{i gceann {years} mbliana} other{i gceann {years} bliain}}
gd: {years, plural, =0{{numeric, select, true{an ceann {years} bliadhna} other{am bliadhna}}} =1{{numeric, select, true{an ceann {years} bhliadhna} other{an ath-bhliadhna}}} =2{an ceann {years} bhliadhna} few{an ceann {years} bliadhnaichean} other{an ceann {years} bliadhna}}
gl: {years, plural, =0{{numeric, select, true{en {years} anos} other{este ano}}} =1{{numeric, select, true{en {years} ano} other{o próximo ano}}} other{en {years} anos}}
gu: {years, plural, zero{{numeric, select, true{{years} વર્ષમાં} other{આ વર્ષે}}} one{{numeric, select, true{{years} વર્ષમાં} other{આવતા વર્ષે}}} other{{years} વર્ષમાં}}
he: {years, plural, =0{{numeric, select, true{בעוד {years} שנים} other{השנה}}} =1{{numeric, select, true{בעוד שנה} other{השנה הבאה}}} =2{בעוד שנתיים} many{בעוד {years} שנה} other{בעוד {years} שנים}}
hi: {years, plural, zero{{numeric, select, true{{years} वर्ष में} other{इस वर्ष}}} one{{numeric, select, true{{years} वर्ष में} other{अगला वर्ष}}} other{{years} वर्ष में}}
hi_latn: {years, plural, =0{{numeric, select, true{{years} saal mein} other{is saal}}} =1{{numeric, select, true{{years} saal mein} other{agla saal}}} other{{years} saal mein}}
hr: {years, plural, zero{{numeric, select, true{za {years} godina} other{ove godine}}} one{{numeric, select, true{za {years} godinu} other{sljedeće godine}}} few{za {years} godine} other{za {years} godina}}
hu: {years, plural, =0{{numeric, select, true{{years} év múlva} other{ez az év}}} =1{{numeric, select, true{{years} év múlva} other{következő év}}} other{{years} év múlva}}
hy: {years, plural, zero{{numeric, select, true{{years} տարուց} other{այս տարի}}} one{{numeric, select, true{{years} տարուց} other{հաջորդ տարի}}} other{{years} տարուց}}
ia: {years, plural, =0{{numeric, select, true{in {years} annos} other{iste anno}}} =1{{numeric, select, true{in {years} anno} other{le anno proxime}}} other{in {years} annos}}
id: {years, plural, zero{{numeric, select, true{dalam {years} tahun} other{tahun ini}}} one{{numeric, select, true{dalam {years} tahun} other{tahun depan}}} other{dalam {years} tahun}}
is: {years, plural, zero{{numeric, select, true{eftir {years} ár} other{á þessu ári}}} one{{numeric, select, true{eftir {years} ár} other{á næsta ári}}} other{eftir {years} ár}}
it: {years, plural, zero{{numeric, select, true{tra {years} anni} other{quest’anno}}} one{{numeric, select, true{tra {years} anno} other{anno prossimo}}} other{tra {years} anni}}
ja: {years, plural, =0{{numeric, select, true{{years} 年後} other{今年}}} =1{{numeric, select, true{{years} 年後} other{来年}}} other{{years} 年後}}
ka: {years, plural, zero{{numeric, select, true{{years} წელიწადში} other{ამ წელს}}} one{{numeric, select, true{{years} წელიწადში} other{მომავალ წელს}}} other{{years} წელიწადში}}
kab: {years, plural, zero{{numeric, select, true{deg {years} n yiseggasen} other{aseggas-a}}} one{{numeric, select, true{deg {years} n useggas} other{qabel}}} other{deg {years} n yiseggasen}}
kk: {years, plural, zero{{numeric, select, true{{years} жылдан кейін} other{биылғы жыл}}} one{{numeric, select, true{{years} жылдан кейін} other{келесі жыл}}} other{{years} жылдан кейін}}
km: {count, plural, zero{{numeric, select, true{{digits} ឆ្នាំទៀត} other{ឆ្នាំ​នេះ}}} one{{numeric, select, true{{digits} ឆ្នាំទៀត} other{ឆ្នាំ​ក្រោយ}}} other{{digits} ឆ្នាំទៀត}}
kn: {years, plural, =0{{numeric, select, true{{years} ವರ್ಷಗಳಲ್ಲಿ} other{ಈ ವರ್ಷ}}} =1{{numeric, select, true{{years} ವರ್ಷದಲ್ಲಿ} other{ಮುಂದಿನ ವರ್ಷ}}} other{{years} ವರ್ಷಗಳಲ್ಲಿ}}
ko: {years, plural, zero{{numeric, select, true{{years}년 후} other{올해}}} one{{numeric, select, true{{years}년 후} other{내년}}} other{{years}년 후}}
ky: {years, plural, =0{{numeric, select, true{{years} жылдан кийин} other{быйыл}}} =1{{numeric, select, true{{years} жылдан кийин} other{эмдиги жылы}}} other{{years} жылдан кийин}}
lb: {years, plural, zero{{numeric, select, true{a(n) {years} Joer} other{dëst Joer}}} one{{numeric, select, true{an {years} Joer} other{nächst Joer}}} other{a(n) {years} Joer}}
lo: {years, plural, =0{{numeric, select, true{ໃນອີກ {years} ປີ} other{ປີນີ້}}} =1{{numeric, select, true{ໃນອີກ {years} ປີ} other{ປີໜ້າ}}} other{ໃນອີກ {years} ປີ}}
lt: {years, plural, =0{{numeric, select, true{po {years} metų} other{šiais metais}}} =1{{numeric, select, true{po {years} metų} other{kitais metais}}} other{po {years} metų}}
lv: {years, plural, =0{{numeric, select, true{pēc {years} gadiem} other{šajā gadā}}} =1{{numeric, select, true{pēc {years} gada} other{nākamajā gadā}}} other{pēc {years} gadiem}}
mai: {years, plural, zero{{numeric, select, true{{years} बरख मे} other{एहि बरख}}} one{{numeric, select, true{{years} बरख मे} other{अगिला बरख}}} other{{years} बरख मे}}
mi: {count, plural, zero{{numeric, select, true{ā te {digits} tau} other{i tēnei tau}}} one{{numeric, select, true{ā te {digits} tau} other{ā tērā tau}}} other{ā te {digits} tau}}
mk: {years, plural, =0{{numeric, select, true{за {years} години} other{оваа година}}} =1{{numeric, select, true{за {years} година} other{догодина}}} other{за {years} години}}
ml: {years, plural, zero{{numeric, select, true{{years} വർഷത്തിൽ} other{ഈ വർ‌ഷം}}} one{{numeric, select, true{{years} വർഷത്തിൽ} other{അടുത്തവർഷം}}} other{{years} വർഷത്തിൽ}}
mn: {years, plural, zero{{numeric, select, true{{years} жилийн дараа} other{энэ жил}}} one{{numeric, select, true{{years} жилийн дараа} other{ирэх жил}}} other{{years} жилийн дараа}}
mr: {years, plural, =0{{numeric, select, true{येत्या {years} वर्षांमध्ये} other{हे वर्ष}}} =1{{numeric, select, true{येत्या {years} वर्षामध्ये} other{पुढील वर्ष}}} other{येत्या {years} वर्षांमध्ये}}
ms: {years, plural, zero{{numeric, select, true{dalam {years} tahun} other{tahun ini}}} one{{numeric, select, true{dalam {years} tahun} other{tahun depan}}} other{dalam {years} tahun}}
ms_arab: {count, plural, zero{{numeric, select, true{دالم {digits} تاهون} other{تاهون ني}}} one{{numeric, select, true{دالم {digits} تاهون} other{تاهون هدڤن}}} other{دالم {digits} تاهون}}
mt: {years, plural, zero{{numeric, select, true{fi żmien {years} sena oħra} other{din is-sena}}} one{{numeric, select, true{fi żmien sena} other{is-sena d-dieħla}}} two{fi żmien sentejn oħra} few{fi żmien {years} snin oħra} many{fi żmien {years}-il sena oħra} other{fi żmien {years} sena oħra}}
my: {years, plural, =0{{numeric, select, true{{years} နှစ်အတွင်း} other{ယခုနှစ်}}} =1{{numeric, select, true{{years} နှစ်အတွင်း} other{လာမည့်နှစ်}}} other{{years} နှစ်အတွင်း}}
ne: {years, plural, =0{{numeric, select, true{{years} वर्षमा} other{यो वर्ष}}} =1{{numeric, select, true{{years} वर्षमा} other{आगामी वर्ष}}} other{{years} वर्षमा}}
nl: {years, plural, zero{{numeric, select, true{over {years} jaar} other{dit jaar}}} one{{numeric, select, true{over {years} jaar} other{volgend jaar}}} other{over {years} jaar}}
no: {years, plural, zero{{numeric, select, true{om {years} år} other{i år}}} one{{numeric, select, true{om {years} år} other{neste år}}} other{om {years} år}}
or: {years, plural, zero{{numeric, select, true{{years} ବର୍ଷରେ} other{ଏହି ବର୍ଷ}}} one{{numeric, select, true{{years} ବର୍ଷରେ} other{ଆଗାମୀ ବର୍ଷ}}} other{{years} ବର୍ଷରେ}}
pa: {years, plural, =0{{numeric, select, true{{years} ਸਾਲਾਂ ਵਿੱਚ} other{ਇਹ ਸਾਲ}}} =1{{numeric, select, true{{years} ਸਾਲ ਵਿੱਚ} other{ਅਗਲਾ ਸਾਲ}}} other{{years} ਸਾਲਾਂ ਵਿੱਚ}}
pl: {count, plural, zero{{numeric, select, true{za {digits} roku} other{w tym roku}}} one{{numeric, select, true{za {digits} rok} other{w przyszłym roku}}} few{za {digits} lata} many{za {digits} lat} other{za {digits} roku}}
ps: {years, plural, =0{{numeric, select, true{په {years} کالونو کې} other{سږکال}}} =1{{numeric, select, true{په {years} کال کې} other{راتلونکی کال}}} other{په {years} کالونو کې}}
pt: {years, plural, =0{{numeric, select, true{em {years} anos} other{este ano}}} =1{{numeric, select, true{em {years} ano} other{próximo ano}}} other{em {years} anos}}
ro: {years, plural, =0{{numeric, select, true{peste {years} de ani} other{anul acesta}}} =1{{numeric, select, true{peste {years} an} other{anul viitor}}} few{peste {years} ani} other{peste {years} de ani}}
ru: {years, plural, =0{{numeric, select, true{через {years} года} other{в этом году}}} =1{{numeric, select, true{через {years} год} other{в следующем году}}} many{через {years} лет} other{через {years} года}}
sc: {years, plural, =0{{numeric, select, true{intro de {years} annos} other{ocannu}}} =1{{numeric, select, true{intro de {years} annu} other{ocannu chi benit}}} other{intro de {years} annos}}
sd: {years, plural, =0{{numeric, select, true{{years} سالن ۾} other{پويون سال}}} =1{{numeric, select, true{{years} سالن ۾} other{پويون سال}}} other{{years} سالن ۾}}
se: {count, plural, one{{digits} jahki maŋŋilit} other{{digits} jahkki maŋŋilit}}
se_fi: {years, plural, =0{{numeric, select, true{{years} jagi siste} other{dán jagi}}} =1{{numeric, select, true{{years} jagi siste} other{boahtte jagi}}} other{{years} jagi siste}}
si: {years, plural, =0{{numeric, select, true{වසර {years}කින්} other{මෙම වසර}}} =1{{numeric, select, true{වසර {years}කින්} other{ඊළඟ වසර}}} other{වසර {years}කින්}}
sk: {years, plural, zero{{numeric, select, true{o {years} rokov} other{tento rok}}} one{{numeric, select, true{o {years} rok} other{budúci rok}}} few{o {years} roky} many{o {years} roka} other{o {years} rokov}}
sl: {years, plural, =0{{numeric, select, true{čez {years} let} other{letos}}} =1{{numeric, select, true{čez {years} leto} other{naslednje leto}}} =2{čez {years} leti} few{čez {years} leta} other{čez {years} let}}
sq: {years, plural, zero{{numeric, select, true{pas {years} vjetësh} other{sivjet}}} one{{numeric, select, true{pas {years} viti} other{mot}}} other{pas {years} vjetësh}}
sr: {years, plural, =0{{numeric, select, true{за {years} година} other{ове године}}} =1{{numeric, select, true{за {years} годину} other{следеће године}}} few{за {years} године} other{за {years} година}}
sr_latn: {years, plural, =0{{numeric, select, true{za {years} godina} other{ove godine}}} =1{{numeric, select, true{za {years} godinu} other{sledeće godine}}} few{za {years} godine} other{za {years} godina}}
sv: {years, plural, =0{{numeric, select, true{om {years} år} other{i år}}} =1{{numeric, select, true{om {years} år} other{nästa år}}} other{om {years} år}}
sw: {years, plural, =0{{numeric, select, true{baada ya miaka {years}} other{mwaka huu}}} =1{{numeric, select, true{baada ya mwaka {years}} other{mwaka ujao}}} other{baada ya miaka {years}}}
ta: {years, plural, =0{{numeric, select, true{{years} ஆண்டுகளில்} other{இந்த ஆண்டு}}} =1{{numeric, select, true{{years} ஆண்டில்} other{அடுத்த ஆண்டு}}} other{{years} ஆண்டுகளில்}}
te: {years, plural, zero{{numeric, select, true{{years} సంవత్సరాల్లో} other{ఈ సంవత్సరం}}} one{{numeric, select, true{{years} సంవత్సరంలో} other{తదుపరి సంవత్సరం}}} other{{years} సంవత్సరాల్లో}}
tg: {years, plural, =0{{numeric, select, true{пас аз {years} сол} other{соли ҷорӣ}}} =1{{numeric, select, true{пас аз {years} сол} other{соли оянда}}} other{пас аз {years} сол}}
th: {years, plural, zero{{numeric, select, true{ในอีก {years} ปี} other{ปีนี้}}} one{{numeric, select, true{ในอีก {years} ปี} other{ปีหน้า}}} other{ในอีก {years} ปี}}
tk: {years, plural, zero{{numeric, select, true{{years} ýyldan} other{şu ýyl}}} one{{numeric, select, true{{years} ýyldan} other{indiki ýyl}}} other{{years} ýyldan}}
tr: {years, plural, =0{{numeric, select, true{{years} yıl sonra} other{bu yıl}}} =1{{numeric, select, true{{years} yıl sonra} other{gelecek yıl}}} other{{years} yıl sonra}}
tt: {years, plural, zero{{numeric, select, true{{years} елдан} other{быел}}} one{{numeric, select, true{{years} елдан} other{киләсе елда}}} other{{years} елдан}}
ug: {count, plural, zero{{numeric, select, true{{digits} يىلدىن كېيىن} other{بۇ يىل}}} one{{numeric, select, true{{digits} يىلدىن كېيىن} other{كېلەر يىل}}} other{{digits} يىلدىن كېيىن}}
uk: {count, plural, zero{{numeric, select, true{через {digits} року} other{цього року}}} one{{numeric, select, true{через {digits} рік} other{наступного року}}} few{через {digits} роки} many{через {digits} років} other{через {digits} року}}
ur: {years, plural, =0{{numeric, select, true{{years} سال میں} other{اس سال}}} =1{{numeric, select, true{{years} سال میں} other{اگلے سال}}} other{{years} سال میں}}
uz: {years, plural, =0{{numeric, select, true{{years} yildan keyin} other{shu yil}}} =1{{numeric, select, true{{years} yildan keyin} other{keyingi yil}}} other{{years} yildan keyin}}
uz_cyrl: {years, plural, zero{{numeric, select, true{{years} йилдан сўнг} other{бу йил}}} one{{numeric, select, true{{years} йилдан сўнг} other{кейинги йил}}} other{{years} йилдан сўнг}}
vi: {years, plural, zero{{numeric, select, true{sau {years} năm nữa} other{năm nay}}} one{{numeric, select, true{sau {years} năm nữa} other{năm sau}}} other{sau {years} năm nữa}}
zh: {years, plural, =0{{numeric, select, true{{years}年后} other{今年}}} =1{{numeric, select, true{{years}年后} other{明年}}} other{{years}年后}}
zh_hant: {years, plural, =0{{numeric, select, true{{years} 年後} other{今年}}} =1{{numeric, select, true{{years} 年後} other{明年}}} other{{years} 年後}}
zu: {years, plural, =0{{numeric, select, true{eminyakeni engu-{years} ezayo} other{kulo nyaka}}} =1{{numeric, select, true{onyakeni ongu-{years} ozayo} other{unyaka ozayo}}} other{eminyakeni engu-{years} ezayo}}
