Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# hoursFuture
source: {count, plural, zero{{numeric, select, true{in {digits} hours} other{this hour}}} one{in {digits} hour} other{in {digits} hours}}
af: {hours, plural, zero{{numeric, select, true{oor {hours} uur} other{hierdie uur}}} other{oor {hours} uur}}
am: {count, plural, zero{{numeric, select, true{በ{digits} ሰዓቶች ውስጥ} other{ይህ ሰዓት}}} one{በ{digits} ሰዓት ውስጥ} other{በ{digits} ሰዓቶች ውስጥ}}
ar: {hours, plural, =0{{numeric, select, true{خلال {hours} ساعة} other{الساعة الحالية}}} =1{خلال ساعة واحدة} =2{خلال ساعتين} few{خلال {hours} ساعات} other{خلال {hours} ساعة}}
as: {hours, plural, zero{{numeric, select, true{{hours} ঘণ্টাত} other{এইটো ঘণ্টাত}}} other{{hours} ঘণ্টাত}}
ast: {hours, plural, =0{{numeric, select, true{en {hours} hores} other{esta hora}}} =1{en {hours} hora} other{en {hours} hores}}
az: {hours, plural, zero{{numeric, select, true{{hours} saat ərzində} other{bu saat}}} other{{hours} saat ərzində}}
be: {hours, plural, =0{{numeric, select, true{праз {hours} гадзіны} other{у гэту гадзіну}}} =1{праз {hours} гадзіну} many{праз {hours} гадзін} other{праз {hours} гадзіны}}
bg: {hours, plural, =0{{numeric, select, true{след {hours} часа} other{в този час}}} =1{след {hours} час} other{след {hours} часа}}
bn: {hours, plural, zero{{numeric, select, true{{hours} ঘন্টায়} other{এই ঘণ্টায়}}} other{{hours} ঘন্টায়}}
br: {hours, plural, =0{{numeric, select, true{a-benn {hours} eur} other{dʼan eur-mañ}}} many{a-benn {hours} a eurioù} other{a-benn {hours} eur}}
bs: {hours, plural, =0{{numeric, select, true{za {hours} sati} other{ovaj sat}}} =1{za {hours} sat} few{za {hours} sata} other{za {hours} sati}}
bs_cyrl: {count, plural, zero{{numeric, select, true{за {digits} сати} other{овог сата}}} one{за {digits} сат} few{за {digits} сата} other{за {digits} сати}}
ca: {hours, plural, =0{{numeric, select, true{d’aquí a {hours} hores} other{aquesta hora}}} =1{d’aquí a {hours} hora} other{d’aquí a {hours} hores}}
cs: {hours, plural, =0{{numeric, select, true{za {hours} hodin} other{tuto hodinu}}} =1{za {hours} hodinu} few{za {hours} hodiny} many{za {hours} hodiny} other{za {hours} hodin}}
cy: {hours, plural, =0{{numeric, select, true{ymhen {hours} awr} other{yr awr hon}}} =1{ymhen awr} other{ymhen {hours} awr}}
da: {hours, plural, =0{{numeric, select, true{om {hours} timer} other{denne time}}} =1{om {hours} time} other{om {hours} timer}}
de: {hours, plural, =0{{numeric, select, true{in {hours} Stunden} other{in dieser Stunde}}} =1{in {hours} Stunde} other{in {hours} Stunden}}
dz: ཆུ་ཚོད་ {hours} ནང་
el: {hours, plural, =0{{numeric, select, true{σε {hours} ώρες} other{τρέχουσα ώρα}}} =1{σε {hours} ώρα} other{σε {hours} ώρες}}
eo: {hours, plural, =0{{numeric, select, true{post {hours} horoj} other{nuna horo}}} =1{post {hours} horo} other{post {hours} horoj}}
es: {hours, plural, zero{{numeric, select, true{dentro de {hours} horas} other{esta hora}}} one{dentro de {hours} hora} other{dentro de {hours} horas}}
et: {hours, plural, =0{{numeric, select, true{{hours} tunni pärast} other{praegusel tunnil}}} other{{hours} tunni pärast}}
eu: {hours, plural, zero{{numeric, select, true{{hours} ordu barru} other{ordu honetan}}} other{{hours} ordu barru}}
fa: {hours, plural, =0{{numeric, select, true{{hours} ساعت بعد} other{همین ساعت}}} other{{hours} ساعت بعد}}
fi: {hours, plural, zero{{numeric, select, true{{hours} tunnin päästä} other{tämän tunnin aikana}}} other{{hours} tunnin päästä}}
fil: {hours, plural, =0{{numeric, select, true{sa {hours} oras} other{ngayong oras}}} other{sa {hours} oras}}
fo: {hours, plural, zero{{numeric, select, true{um {hours} tímar} other{hendan tíman}}} one{um {hours} tíma} other{um {hours} tímar}}
fr: {hours, plural, zero{{numeric, select, true{dans {hours} heures} other{cette heure-ci}}} one{dans {hours} heure} other{dans {hours} heures}}
fur: {count, plural, one{ca di {digits} ore} other{ca di {digits} oris}}
fy: {hours, plural, other{Oer {hours} oere}}
ga: {hours, plural, zero{{numeric, select, true{i gceann {hours} uair an chloig} other{an uair seo}}} many{i gceann {hours} n-uair an chloig} other{i gceann {hours} uair an chloig}}
gd: {hours, plural, =0{{numeric, select, true{an ceann {hours} uair a thìde} other{am broinn uair a thìde}}} few{an ceann {hours} uairean a thìde} other{an ceann {hours} uair a thìde}}
gl: {hours, plural, =0{{numeric, select, true{en {hours} horas} other{esta hora}}} =1{en {hours} hora} other{en {hours} horas}}
gu: {hours, plural, zero{{numeric, select, true{{hours} કલાકમાં} other{આ કલાક}}} other{{hours} કલાકમાં}}
he: {hours, plural, =0{{numeric, select, true{בעוד {hours} שעות} other{בשעה זו}}} =1{בעוד שעה} =2{בעוד שעתיים} other{בעוד {hours} שעות}}
hi: {hours, plural, zero{{numeric, select, true{{hours} घंटे में} other{यह घंटा}}} other{{hours} घंटे में}}
hi_latn: {hours, plural, =0{{numeric, select, true{{hours} ghante mein} other{yah ghanta}}} other{{hours} ghante mein}}
hr: {hours, plural, zero{{numeric, select, true{za {hours} sati} other{ovaj sat}}} one{za {hours} sat} few{za {hours} sata} other{za {hours} sati}}
hu: {hours, plural, =0{{numeric, select, true{{hours} óra múlva} other{ebben az órában}}} other{{hours} óra múlva}}
hy: {hours, plural, zero{{numeric, select, true{{hours} ժամից} other{այս ժամին}}} other{{hours} ժամից}}
ia: {hours, plural, =0{{numeric, select, true{in {hours} horas} other{iste hora}}} =1{in {hours} hora} other{in {hours} horas}}
id: {hours, plural, zero{{numeric, select, true{dalam {hours} jam} other{jam ini}}} other{dalam {hours} jam}}
is: {hours, plural, zero{{numeric, select, true{eftir {hours} klukkustundir} other{þessa stundina}}} one{eftir {hours} klukkustund} other{eftir {hours} klukkustundir}}
it: {hours, plural, zero{{numeric, select, true{tra {hours} ore} other{quest’ora}}} one{tra {hours} ora} other{tra {hours} ore}}
ja: {hours, plural, =0{{numeric, select, true{{hours} 時間後} other{1 時間以内}}} other{{hours} 時間後}}
ka: {hours, plural, zero{{numeric, select, true{{hours} საათში} other{ამ საათში}}} other{{hours} საათში}}
kab: {hours, plural, zero{{numeric, select, true{deg {hours} n isragen} other{asrag-agi}}} one{deg {hours} n usrag} other{deg {hours} n isragen}}
kk: {hours, plural, zero{{numeric, select, true{{hours} сағаттан кейін} other{осы сағат}}} other{{hours} сағаттан кейін}}
km: {count, plural, zero{{numeric, select, true{ក្នុង​រយៈ​ពេល {digits} ម៉ោង} other{ម៉ោងនេះ}}} other{ក្នុង​រយៈ​ពេល {digits} ម៉ោង}}
kn: {hours, plural, =0{{numeric, select, true{{hours} ಗಂಟೆಗಳಲ್ಲಿ} other{ಈ ಗಂಟೆ}}} =1{{hours} ಗಂಟೆಯಲ್ಲಿ} other{{hours} ಗಂಟೆಗಳಲ್ಲಿ}}
ko: {hours, plural, zero{{numeric, select, true{{hours}시간 후} other{현재 시간}}} other{{hours}시간 후}}
ky: {hours, plural, =0{{numeric, select, true{{hours} сааттан кийин} other{ушул саатта}}} other{{hours} сааттан кийин}}
lb: {hours, plural, one{an {hours} Stonn} other{a(n) {hours} Stonnen}}
lo: {hours, plural, =0{{numeric, select, true{ໃນອີກ {hours} ຊົ່ວໂມງ} other{ຊົ່ວໂມງນີ້}}} other{ໃນອີກ {hours} ຊົ່ວໂມງ}}
lt: {hours, plural, =0{{numeric, select, true{po {hours} valandų} other{šią valandą}}} =1{po {hours} valandos} many{po {hours} valandos} other{po {hours} valandų}}
lv: {hours, plural, =0{{numeric, select, true{pēc {hours} stundām} other{šajā stundā}}} =1{pēc {hours} stundas} other{pēc {hours} stundām}}
mai: {hours, plural, zero{{numeric, select, true{{hours} घंटा मे} other{एहि घंटा}}} other{{hours} घंटा मे}}
mi: {count, plural, zero{{numeric, select, true{+{digits} haora} other{i tēnei haora}}} other{+{digits} haora}}
mk: {hours, plural, =0{{numeric, select, true{за {hours} часа} other{часов}}} =1{за {hours} час} other{за {hours} часа}}
ml: {hours, plural, zero{{numeric, select, true{{hours} മണിക്കൂറിൽ} other{ഈ മണിക്കൂറിൽ}}} other{{hours} മണിക്കൂറിൽ}}
mn: {hours, plural, zero{{numeric, select, true{{hours} цагийн дараа} other{энэ цаг}}} other{{hours} цагийн дараа}}
mr: {hours, plural, =0{{numeric, select, true{{hours} तासांमध्ये} other{तासात}}} =1{{hours} तासामध्ये} other{{hours} तासांमध्ये}}
ms: {hours, plural, zero{{numeric, select, true{dalam {hours} jam} other{jam ini}}} other{dalam {hours} jam}}
ms_arab: دالم {digits} جم
mt: {hours, plural, zero{{numeric, select, true{fi żmien {hours} siegħa} other{din is-siegħa}}} one{fi żmien siegħa oħra} two{fi żmien sagħtejn} few{fi żmien {hours} sigħat} many{fi żmien {hours}-il siegħa} other{fi żmien {hours} siegħa}}
my: {hours, plural, =0{{numeric, select, true{{hours} နာရီအတွင်း} other{ဤအချိန်}}} other{{hours} နာရီအတွင်း}}
ne: {hours, plural, =0{{numeric, select, true{{hours} घण्टामा} other{यस घडीमा}}} other{{hours} घण्टामा}}
nl: {hours, plural, zero{{numeric, select, true{over {hours} uur} other{binnen een uur}}} other{over {hours} uur}}
no: {hours, plural, zero{{numeric, select, true{om {hours} timer} other{denne timen}}} one{om {hours} time} other{om {hours} timer}}
or: {hours, plural, zero{{numeric, select, true{{hours} ଘଣ୍ଟାରେ} other{ଏହି ଘଣ୍ଟା}}} other{{hours} ଘଣ୍ଟାରେ}}
pa: {hours, plural, =0{{numeric, select, true{{hours} ਘੰਟਿਆਂ ਵਿੱਚ} other{ਇਸ ਘੰਟੇ}}} =1{{hours} ਘੰਟੇ ਵਿੱਚ} other{{hours} ਘੰਟਿਆਂ ਵਿੱਚ}}
pl: {count, plural, zero{{numeric, select, true{za {digits} godziny} other{ta godzina}}} one{za {digits} godzinę} many{za {digits} godzin} other{za {digits} godziny}}
ps: {hours, plural, =0{{numeric, select, true{په {hours} ساعتو کې} other{دا ساعت}}} =1{په {hours} ساعت کې} other{په {hours} ساعتو کې}}
pt: {hours, plural, =0{{numeric, select, true{em {hours} horas} other{esta hora}}} =1{em {hours} hora} other{em {hours} horas}}
ro: {hours, plural, =0{{numeric, select, true{peste {hours} de ore} other{ora aceasta}}} =1{peste {hours} oră} few{peste {hours} ore} other{peste {hours} de ore}}
ru: {hours, plural, =0{{numeric, select, true{через {hours} часа} other{в этот час}}} =1{через {hours} час} many{через {hours} часов} other{через {hours} часа}}
sc: {hours, plural, =0{{numeric, select, true{intro de {hours} oras} other{cust’ora}}} =1{intro de {hours} ora} other{intro de {hours} oras}}
sd: {hours, plural, =0{{numeric, select, true{{hours} ڪلاڪ ۾} other{هن ڪلڪ}}} other{{hours} ڪلاڪ ۾}}
se: {count, plural, one{{digits} diibmu maŋŋilit} other{{digits} diibmur maŋŋilit}}
se_fi: {hours, plural, =0{{numeric, select, true{{hours} diimmu siste} other{dán diimmu}}} other{{hours} diimmu siste}}
si: {hours, plural, =0{{numeric, select, true{පැය {hours}කින්} other{මෙම පැය}}} other{පැය {hours}කින්}}
sk: {hours, plural, zero{{numeric, select, true{o {hours} hodín} other{v tejto hodine}}} one{o {hours} hodinu} few{o {hours} hodiny} many{o {hours} hodiny} other{o {hours} hodín}}
sl: {hours, plural, =0{{numeric, select, true{čez {hours} ur} other{v tej uri}}} =1{čez {hours} uro} =2{čez {hours} uri} few{čez {hours} ure} other{čez {hours} ur}}
sq: {hours, plural, zero{{numeric, select, true{pas {hours} orësh} other{këtë orë}}} one{pas {hours} ore} other{pas {hours} orësh}}
sr: {hours, plural, =0{{numeric, select, true{за {hours} сати} other{овог сата}}} =1{за {hours} сат} few{за {hours} сата} other{за {hours} сати}}
sr_latn: {hours, plural, =0{{numeric, select, true{za {hours} sati} other{ovog sata}}} =1{za {hours} sat} few{za {hours} sata} other{za {hours} sati}}
sv: {hours, plural, =0{{numeric, select, true{om {hours} timmar} other{denna timme}}} =1{om {hours} timme} other{om {hours} timmar}}
sw: {hours, plural, =0{{numeric, select, true{baada ya saa {hours}} other{saa hii}}} other{baada ya saa {hours}}}
ta: {hours, plural, =0{{numeric, select, true{{hours} மணிநேரத்தில்} other{இந்த ஒரு மணிநேரத்தில்}}} other{{hours} மணிநேரத்தில்}}
te: {hours, plural, zero{{numeric, select, true{{hours} గంటల్లో} other{ఈ గంట}}} one{{hours} గంటలో} other{{hours} గంటల్లో}}
tg: {hours, plural, =0{{numeric, select, true{пас аз {hours} соат} other{соати ҷорӣ}}} other{пас аз {hours} соат}}
th: {hours, plural, zero{{numeric, select, true{ในอีก {hours} ชั่วโมง} other{ชั่วโมงนี้}}} other{ในอีก {hours} ชั่วโมง}}
tk: {hours, plural, zero{{numeric, select, true{{hours} sagatdan} other{şu sagat}}} other{{hours} sagatdan}}
tr: {hours, plural, =0{{numeric, select, true{{hours} saat sonra} other{bu saat}}} other{{hours} saat sonra}}
tt: {hours, plural, zero{{numeric, select, true{{hours} сәгатьтән} other{бу сәгатьтә}}} other{{hours} сәгатьтән}}
ug: {digits} سائەتتىن كېيىن
uk: {count, plural, zero{{numeric, select, true{через {digits} години} other{цієї години}}} one{через {digits} годину} many{через {digits} годин} other{через {digits} години}}
ur: {hours, plural, =0{{numeric, select, true{{hours} گھنٹے میں} other{اس گھنٹے}}} other{{hours} گھنٹے میں}}
uz: {hours, plural, =0{{numeric, select, true{{hours} soatdan keyin} other{shu soatda}}} other{{hours} soatdan keyin}}
uz_cyrl: {hours, plural, other{{hours} соатдан сўнг}}
vi: {hours, plural, zero{{numeric, select, true{sau {hours} giờ nữa} other{giờ này}}} other{sau {hours} giờ nữa}}
zh: {hours, plural, =0{{numeric, select, true{{hours}小时后} other{这一时间 / 此时}}} other{{hours}小时后}}
zh_hant: {hours, plural, =0{{numeric, select, true{{hours} 小時後} other{這一小時}}} other{{hours} 小時後}}
zu: {hours, plural, =0{{numeric, select, true{emahoreni angu-{hours} ezayo} other{leli hora}}} =1{ehoreni elingu-{hours} elizayo} other{emahoreni angu-{hours} ezayo}}
