Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# yearsPast
source: {count, plural, zero{{numeric, select, true{{digits} years ago} other{this year}}} one{{numeric, select, true{{digits} year ago} other{last year}}} other{{digits} years ago}}
af: {years, plural, zero{{numeric, select, true{{years} jaar gelede} other{hierdie jaar}}} one{{numeric, select, true{{years} jaar gelede} other{verlede jaar}}} other{{years} jaar gelede}}
am: {count, plural, zero{{numeric, select, true{ከ{digits} ዓመታት በፊት} other{በዚህ ዓመት}}} one{{numeric, select, true{ከ{digits} ዓመት በፊት} other{ያለፈው ዓመት}}} other{ከ{digits} ዓመታት በፊት}}
ar: {years, plural, =0{{numeric, select, true{قبل {years} سنة} other{السنة الحالية}}} =1{{numeric, select, true{قبل سنة واحدة} other{السنة الماضية}}} =2{قبل سنتين} few{قبل {years} سنوات} other{قبل {years} سنة}}
as: {years, plural, zero{{numeric, select, true{{years} বছৰৰ পূৰ্বে} other{এই বছৰ}}} one{{numeric, select, true{{years} বছৰৰ পূৰ্বে} other{যোৱা বছৰ}}} other{{years} বছৰৰ পূৰ্বে}}
ast: {years, plural, =0{{numeric, select, true{hai {years} años} other{esti añu}}} =1{{numeric, select, true{hai {years} añu} other{l’añu pasáu}}} other{hai {years} años}}
az: {years, plural, zero{{numeric, select, true{{years} il öncə} other{bu il}}} one{{numeric, select, true{{years} il öncə} other{keçən il}}} other{{years} il öncə}}
be: {years, plural, =0{{numeric, select, true{{years} года таму} other{у гэтым годзе}}} =1{{numeric, select, true{{years} год таму} other{у мінулым годзе}}} few{{years} гады таму} many{{years} гадоў таму} other{{years} года таму}}
bg: {years, plural, =0{{numeric, select, true{преди {years} години} other{тази година}}} =1{{numeric, select, true{преди {years} година} other{миналата година}}} other{преди {years} години}}
bn: {years, plural, zero{{numeric, select, true{{years} বছর পূর্বে} other{এই বছর}}} one{{numeric, select, true{{years} বছর পূর্বে} other{গত বছর}}} other{{years} বছর পূর্বে}}
br: {years, plural, =0{{numeric, select, true{{years} vloaz zo} other{hevlene}}} =1{{numeric, select, true{{years} bloaz zo} other{warlene}}} few{{years} bloaz zo} many{{years} a vloazioù zo} other{{years} vloaz zo}}
bs: {years, plural, =0{{numeric, select, true{prije {years} godina} other{ove godine}}} =1{{numeric, select, true{prije {years} godinu} other{prošle godine}}} few{prije {years} godine} other{prije {years} godina}}
bs_cyrl: {count, plural, zero{{numeric, select, true{прије {digits} година} other{ове године}}} one{{numeric, select, true{прије {digits} годину} other{прошле године}}} few{прије {digits} године} other{прије {digits} година}}
ca: {years, plural, =0{{numeric, select, true{fa {years} anys} other{enguany}}} =1{{numeric, select, true{fa {years} any} other{l’any passat}}} other{fa {years} anys}}
cs: {years, plural, =0{{numeric, select, true{před {years} lety} other{tento rok}}} =1{{numeric, select, true{před {years} rokem} other{minulý rok}}} many{před {years} roku} other{před {years} lety}}
cy: {years, plural, =0{{numeric, select, true{{years} o flynyddoedd yn ôl} other{eleni}}} =1{{numeric, select, true{blwyddyn yn ôl} other{llynedd}}} =2{{years} flynedd yn ôl} few{{years} blynedd yn ôl} many{{years} blynedd yn ôl} other{{years} o flynyddoedd yn ôl}}
da: {years, plural, =0{{numeric, select, true{for {years} år siden} other{i år}}} =1{{numeric, select, true{for {years} år siden} other{sidste år}}} other{for {years} år siden}}
de: {years, plural, =0{{numeric, select, true{vor {years} Jahren} other{dieses Jahr}}} =1{{numeric, select, true{vor {years} Jahr} other{letztes Jahr}}} other{vor {years} Jahren}}
dz: ལོ་འཁོར་ {years} ཧེ་མ་
el: {years, plural, =0{{numeric, select, true{πριν από {years} έτη} other{φέτος}}} =1{{numeric, select, true{πριν από {years} έτος} other{πέρσι}}} other{πριν από {years} έτη}}
eo: {years, plural, =0{{numeric, select, true{antaŭ {years} jaroj} other{nuna jaro}}} =1{{numeric, select, true{antaŭ {years} jaro} other{pasinta jaro}}} other{antaŭ {years} jaroj}}
es: {years, plural, zero{{numeric, select, true{hace {years} años} other{este año}}} one{{numeric, select, true{hace {years} año} other{el año pasado}}} other{hace {years} años}}
et: {years, plural, =0{{numeric, select, true{{years} aasta eest} other{käesolev aasta}}} =1{{numeric, select, true{{years} aasta eest} other{eelmine aasta}}} other{{years} aasta eest}}
eu: {years, plural, zero{{numeric, select, true{Duela {years} urte} other{aurten}}} one{{numeric, select, true{Duela {years} urte} other{iaz}}} other{Duela {years} urte}}
fa: {years, plural, =0{{numeric, select, true{{years} سال پیش} other{امسال}}} =1{{numeric, select, true{{years} سال پیش} other{سال گذشته}}} other{{years} سال پیش}}
fi: {years, plural, zero{{numeric, select, true{{years} vuotta sitten} other{tänä vuonna}}} one{{numeric, select, true{{years} vuosi sitten} other{viime vuonna}}} other{{years} vuotta sitten}}
fil: {years, plural, =0{{numeric, select, true{{years} taon ang nakalipas} other{ngayong taon}}} =1{{numeric, select, true{{years} taon ang nakalipas} other{nakaraang taon}}} other{{years} taon ang nakalipas}}
fo: {years, plural, zero{{numeric, select, true{{years} ár síðan} other{í ár}}} one{{numeric, select, true{{years} ár síðan} other{í fjør}}} other{{years} ár síðan}}
fr: {years, plural, zero{{numeric, select, true{il y a {years} ans} other{cette année}}} one{{numeric, select, true{il y a {years} an} other{l’année dernière}}} other{il y a {years} ans}}
fur: {count, plural, one{{digits} an indaûr} other{{digits} agns indaûr}}
fy: {years, plural, =0{{numeric, select, true{{years} jier lyn} other{dit jier}}} =1{{numeric, select, true{{years} jier lyn} other{foarich jier}}} other{{years} jier lyn}}
ga: {years, plural, zero{{numeric, select, true{{years} bliain ó shin} other{i mbliana}}} one{{numeric, select, true{{years} bhliain ó shin} other{anuraidh}}} two{{years} bhliain ó shin} few{{years} bliana ó shin} many{{years} mbliana ó shin} other{{years} bliain ó shin}}
gd: {years, plural, =0{{numeric, select, true{{years} bliadhna air ais} other{am bliadhna}}} =1{{numeric, select, true{{years} bhliadhna air ais} other{an-uiridh}}} =2{{numeric, select, true{{years} bhliadhna air ais} other{a-bhòn-uiridh}}} few{{years} bhliadhnaichean air ais} other{{years} bliadhna air ais}}
gl: {years, plural, =0{{numeric, select, true{hai {years} anos} other{este ano}}} =1{{numeric, select, true{hai {years} ano} other{o ano pasado}}} other{hai {years} anos}}
gu: {years, plural, zero{{numeric, select, true{{years} વર્ષ પહેલાં} other{આ વર્ષે}}} one{{numeric, select, true{{years} વર્ષ પહેલાં} other{ગયા વર્ષે}}} other{{years} વર્ષ પહેલાં}}
he: {years, plural, =0{{numeric, select, true{לפני {years} שנים} other{השנה}}} =1{{numeric, select, true{לפני שנה} other{השנה שעברה}}} =2{לפני שנתיים} many{לפני {years} שנה} other{לפני {years} שנים}}
hi: {years, plural, zero{{numeric, select, true{{years} वर्ष पहले} other{इस वर्ष}}} one{{numeric, select, true{{years} वर्ष पहले} other{पिछला वर्ष}}} other{{years} वर्ष पहले}}
hi_latn: {years, plural, =0{{numeric, select, true{{years} saal pahle} other{is saal}}} =1{{numeric, select, true{{years} saal pahle} other{pichhla saal}}} other{{years} saal pahle}}
hr: {years, plural, zero{{numeric, select, true{prije {years} godina} other{ove godine}}} one{{numeric, select, true{prije {years} godinu} other{prošle godine}}} few{prije {years} godine} other{prije {years} godina}}
hu: {years, plural, =0{{numeric, select, true{{years} évvel ezelőtt} other{ez az év}}} =1{{numeric, select, true{{years} évvel ezelőtt} other{előző év}}} other{{years} évvel ezelőtt}}
hy: {years, plural, zero{{numeric, select, true{{years} տարի առաջ} other{այս տարի}}} one{{numeric, select, true{{years} տարի առաջ} other{նախորդ տարի}}} other{{years} տարի առաջ}}
ia: {years, plural, =0{{numeric, select, true{{years} annos retro} other{iste anno}}} =1{{numeric, select, true{{years} anno retro} other{le anno passate}}} other{{years} annos retro}}
id: {years, plural, zero{{numeric, select, true{{years} tahun yang lalu} other{tahun ini}}} one{{numeric, select, true{{years} tahun yang lalu} other{tahun lalu}}} other{{years} tahun yang lalu}}
is: {years, plural, zero{{numeric, select, true{fyrir {years} árum} other{á þessu ári}}} one{{numeric, select, true{fyrir {years} ári} other{á síðasta ári}}} other{fyrir {years} árum}}
it: {years, plural, zero{{numeric, select, true{{years} anni fa} other{quest’anno}}} one{{numeric, select, true{{years} anno fa} other{anno scorso}}} other{{years} anni fa}}
ja: {years, plural, =0{{numeric, select, true{{years} 年前} other{今年}}} =1{{numeric, select, true{{years} 年前} other{昨年}}} other{{years} 年前}}
ka: {years, plural, zero{{numeric, select, true{{years} წლის წინ} other{ამ წელს}}} one{{numeric, select, true{{years} წლის წინ} other{გასულ წელს}}} other{{years} წლის წინ}}
kab: {years, plural, zero{{numeric, select, true{{years} n yiseggasen aya} other{aseggas-a}}} one{{numeric, select, true{{years} n useggas aya} other{ilindi}}} other{{years} n yiseggasen aya}}
kk: {years, plural, zero{{numeric, select, true{{years} жыл бұрын} other{биылғы жыл}}} one{{numeric, select, true{{years} жыл бұрын} other{былтырғы жыл}}} other{{years} жыл бұрын}}
km: {count, plural, zero{{numeric, select, true{{digits} ឆ្នាំ​មុន} other{ឆ្នាំ​នេះ}}} one{{numeric, select, true{{digits} ឆ្នាំ​មុន} other{ឆ្នាំ​មុន}}} other{{digits} ឆ្នាំ​មុន}}
kn: {years, plural, =0{{numeric, select, true{{years} ವರ್ಷಗಳ ಹಿಂದೆ} other{ಈ ವರ್ಷ}}} =1{{numeric, select, true{{years} ವರ್ಷದ ಹಿಂದೆ} other{ಹಿಂದಿನ ವರ್ಷ}}} other{{years} ವರ್ಷಗಳ ಹಿಂದೆ}}
ko: {years, plural, zero{{numeric, select, true{{years}년 전} other{올해}}} one{{numeric, select, true{{years}년 전} other{작년}}} other{{years}년 전}}
ky: {years, plural, =0{{numeric, select, true{{years} жыл мурун} other{быйыл}}} =1{{numeric, select, true{{years} жыл мурун} other{былтыр}}} other{{years} жыл мурун}}
lb: {years, plural, zero{{numeric, select, true{viru(n) {years} Joer} other{dëst Joer}}} one{{numeric, select, true{virun {years} Joer} other{lescht Joer}}} other{viru(n) {years} Joer}}
lo: {years, plural, =0{{numeric, select, true{{years} ປີກ່ອນ} other{ປີນີ້}}} =1{{numeric, select, true{{years} ປີກ່ອນ} other{ປີກາຍ}}} other{{years} ປີກ່ອນ}}
lt: {years, plural, =0{{numeric, select, true{prieš {years} metų} other{šiais metais}}} =1{{numeric, select, true{prieš {years} metus} other{praėjusiais metais}}} few{prieš {years} metus} other{prieš {years} metų}}
lv: {years, plural, =0{{numeric, select, true{pirms {years} gadiem} other{šajā gadā}}} =1{{numeric, select, true{pirms {years} gada} other{pagājušajā gadā}}} other{pirms {years} gadiem}}
mai: {years, plural, zero{{numeric, select, true{{years} बरख पहिले} other{एहि बरख}}} one{{numeric, select, true{{years} बरख पहिले} other{बीतल बरख}}} other{{years} बरख पहिले}}
mi: {count, plural, zero{{numeric, select, true{i te {digits} tau i mua} other{i tēnei tau}}} one{{numeric, select, true{i te {digits} tau i mua} other{i tērā tau}}} other{i te {digits} tau i mua}}
mk: {years, plural, =0{{numeric, select, true{пред {years} години} other{оваа година}}} =1{{numeric, select, true{пред {years} година} other{лани}}} other{пред {years} години}}
ml: {years, plural, zero{{numeric, select, true{{years} വർഷം മുമ്പ്} other{ഈ വർ‌ഷം}}} one{{numeric, select, true{{years} വർഷം മുമ്പ്} other{കഴിഞ്ഞ വർഷം}}} other{{years} വർഷം മുമ്പ്}}
mn: {years, plural, zero{{numeric, select, true{{years} жилийн өмнө} other{энэ жил}}} one{{numeric, select, true{{years} жилийн өмнө} other{өнгөрсөн жил}}} other{{years} жилийн өмнө}}
mr: {years, plural, =0{{numeric, select, true{{years} वर्षांपूर्वी} other{हे वर्ष}}} =1{{numeric, select, true{{years} वर्षापूर्वी} other{मागील वर्ष}}} other{{years} वर्षांपूर्वी}}
ms: {years, plural, zero{{numeric, select, true{{years} tahun lalu} other{tahun ini}}} one{{numeric, select, true{{years} tahun lalu} other{tahun lalu}}} other{{years} tahun lalu}}
ms_arab: {count, plural, zero{{numeric, select, true{{digits} تاهون لالو} other{تاهون ني}}} one{{numeric, select, true{{digits} تاهون لالو} other{تاهون لڤس}}} other{{digits} تاهون لالو}}
mt: {years, plural, zero{{numeric, select, true{{years} sena ilu} other{din is-sena}}} one{{numeric, select, true{sena ilu} other{is-sena l-oħra}}} two{sentejn ilu} few{{years} snin ilu} many{{years}-il sena ilu} other{{years} sena ilu}}
my: {years, plural, =0{{numeric, select, true{ပြီးခဲ့သည့် {years} နှစ်} other{ယခုနှစ်}}} =1{{numeric, select, true{ပြီးခဲ့သည့် {years} နှစ်} other{ယမန်နှစ်}}} other{ပြီးခဲ့သည့် {years} နှစ်}}
ne: {years, plural, =0{{numeric, select, true{{years} वर्ष अघि} other{यो वर्ष}}} =1{{numeric, select, true{{years} वर्ष अघि} other{गत वर्ष}}} other{{years} वर्ष अघि}}
nl: {years, plural, zero{{numeric, select, true{{years} jaar geleden} other{dit jaar}}} one{{numeric, select, true{{years} jaar geleden} other{vorig jaar}}} other{{years} jaar geleden}}
no: {years, plural, zero{{numeric, select, true{for {years} år siden} other{i år}}} one{{numeric, select, true{for {years} år siden} other{i fjor}}} other{for {years} år siden}}
or: {years, plural, zero{{numeric, select, true{{years} ବର୍ଷ ପୂର୍ବେ} other{ଏହି ବର୍ଷ}}} one{{numeric, select, true{{years} ବର୍ଷ ପୂର୍ବେ} other{ଗତ ବର୍ଷ}}} other{{years} ବର୍ଷ ପୂର୍ବେ}}
pa: {years, plural, =0{{numeric, select, true{{years} ਸਾਲ ਪਹਿਲਾਂ} other{ਇਹ ਸਾਲ}}} =1{{numeric, select, true{{years} ਸਾਲ ਪਹਿਲਾਂ} other{ਪਿਛਲਾ ਸਾਲ}}} other{{years} ਸਾਲ ਪਹਿਲਾਂ}}
pl: {count, plural, zero{{numeric, select, true{{digits} roku temu} other{w tym roku}}} one{{numeric, select, true{{digits} rok temu} other{w zeszłym roku}}} few{{digits} lata temu} many{{digits} lat temu} other{{digits} roku temu}}
ps: {years, plural, =0{{numeric, select, true{{years} کاله مخکې} other{سږکال}}} =1{{numeric, select, true{{years} کال مخکې} other{پروسږکال}}} other{{years} کاله مخکې}}
pt: {years, plural, =0{{numeric, select, true{há {years} anos} other{este ano}}} =1{{numeric, select, true{há {years} ano} other{ano passado}}} other{há {years} anos}}
ro: {years, plural, =0{{numeric, select, true{acum {years} de ani} other{anul acesta}}} =1{{numeric, select, true{acum {years} an} other{anul trecut}}} few{acum {years} ani} other{acum {years} de ani}}
ru: {years, plural, =0{{numeric, select, true{{years} года назад} other{в этом году}}} =1{{numeric, select, true{{years} год назад} other{в прошлом году}}} many{{years} лет назад} other{{years} года назад}}
sc: {years, plural, =0{{numeric, select, true{{years} annos a como} other{ocannu}}} =1{{numeric, select, true{{years} annu a como} other{ocannu coladu}}} other{{years} annos a como}}
sd: {years, plural, =0{{numeric, select, true{{years} سال پهرين} other{پويون سال}}} =1{{numeric, select, true{{years} سال پهرين} other{پويون سال}}} other{{years} سال پهرين}}
se: {count, plural, one{{digits} jahki árat} other{{digits} jahkki árat}}
se_fi: {years, plural, =0{{numeric, select, true{{years} jagi dás ovdal} other{dán jagi}}} =1{{numeric, select, true{diibmá} other{diibmá}}} =2{ovddet jagi} other{{years} jagi dás ovdal}}
si: {years, plural, =0{{numeric, select, true{වසර {years}කට පෙර} other{මෙම වසර}}} =1{{numeric, select, true{වසර {years}කට පෙර} other{පසුගිය වසර}}} other{වසර {years}කට පෙර}}
sk: {years, plural, zero{{numeric, select, true{pred {years} rokmi} other{tento rok}}} one{{numeric, select, true{pred {years} rokom} other{minulý rok}}} many{pred {years} roka} other{pred {years} rokmi}}
sl: {years, plural, =0{{numeric, select, true{pred {years} leti} other{letos}}} =1{{numeric, select, true{pred {years} letom} other{lani}}} =2{pred {years} letoma} other{pred {years} leti}}
sq: {years, plural, zero{{numeric, select, true{{years} vjet më parë} other{sivjet}}} one{{numeric, select, true{{years} vit më parë} other{vjet}}} other{{years} vjet më parë}}
sr: {years, plural, =0{{numeric, select, true{пре {years} година} other{ове године}}} =1{{numeric, select, true{пре {years} године} other{прошле године}}} few{пре {years} године} other{пре {years} година}}
sr_latn: {years, plural, =0{{numeric, select, true{pre {years} godina} other{ove godine}}} =1{{numeric, select, true{pre {years} godine} other{prošle godine}}} few{pre {years} godine} other{pre {years} godina}}
sv: {years, plural, =0{{numeric, select, true{för {years} år sedan} other{i år}}} =1{{numeric, select, true{för {years} år sedan} other{i fjol}}} other{för {years} år sedan}}
sw: {years, plural, =0{{numeric, select, true{miaka {years} iliyopita} other{mwaka huu}}} =1{{numeric, select, true{mwaka {years} uliopita} other{mwaka uliopita}}} other{miaka {years} iliyopita}}
ta: {years, plural, =0{{numeric, select, true{{years} ஆண்டுகளுக்கு முன்} other{இந்த ஆண்டு}}} =1{{numeric, select, true{{years} ஆண்டிற்கு முன்} other{கடந்த ஆண்டு}}} other{{years} ஆண்டுகளுக்கு முன்}}
te: {years, plural, zero{{numeric, select, true{{years} సంవత్సరాల క్రితం} other{ఈ సంవత్సరం}}} one{{numeric, select, true{{years} సంవత్సరం క్రితం} other{గత సంవత్సరం}}} other{{years} సంవత్సరాల క్రితం}}
tg: {years, plural, =0{{numeric, select, true{{years} сол пеш} other{соли ҷорӣ}}} =1{{numeric, select, true{{years} сол пеш} other{соли гузашта}}} other{{years} сол пеш}}
th: {years, plural, zero{{numeric, select, true{{years} ปีที่แล้ว} other{ปีนี้}}} one{{numeric, select, true{{years} ปีที่แล้ว} other{ปีที่แล้ว}}} other{{years} ปีที่แล้ว}}
tk: {years, plural, zero{{numeric, select, true{{years} ýyl öň} other{şu ýyl}}} one{{numeric, select, true{{years} ýyl öň} other{geçen ýyl}}} other{{years} ýyl öň}}
tr: {years, plural, =0{{numeric, select, true{{years} yıl önce} other{bu yıl}}} =1{{numeric, select, true{{years} yıl önce} other{geçen yıl}}} other{{years} yıl önce}}
tt: {years, plural, zero{{numeric, select, true{{years} ел элек} other{быел}}} one{{numeric, select, true{{years} ел элек} other{узган ел}}} other{{years} ел элек}}
ug: {count, plural, zero{{numeric, select, true{{digits} يىل ئىلگىرى} other{بۇ يىل}}} one{{numeric, select, true{{digits} يىل ئىلگىرى} other{ئۆتكەن يىل}}} other{{digits} يىل ئىلگىرى}}
uk: {count, plural, zero{{numeric, select, true{{digits} року тому} other{цього року}}} one{{numeric, select, true{{digits} рік тому} other{минулого року}}} few{{digits} роки тому} many{{digits} років тому} other{{digits} року тому}}
ur: {years, plural, =0{{numeric, select, true{{years} سال پہلے} other{اس سال}}} =1{{numeric, select, true{{years} سال پہلے} other{گزشتہ سال}}} other{{years} سال پہلے}}
uz: {years, plural, =0{{numeric, select, true{{years} yil oldin} other{shu yil}}} =1{{numeric, select, true{{years} yil oldin} other{o‘tgan yil}}} other{{years} yil oldin}}
uz_cyrl: {years, plural, zero{{numeric, select, true{{years} йил аввал} other{бу йил}}} one{{numeric, select, true{{years} йил аввал} other{ўтган йил}}} other{{years} йил аввал}}
vi: {years, plural, zero{{numeric, select, true{{years} năm trước} other{năm nay}}} one{{numeric, select, true{{years} năm trước} other{năm ngoái}}} other{{years} năm trước}}
zh: {years, plural, =0{{numeric, select, true{{years}年前} other{今年}}} =1{{numeric, select, true{{years}年前} other{去年}}} other{{years}年前}}
zh_hant: {years, plural, =0{{numeric, select, true{{years} 年前} other{今年}}} =1{{numeric, select, true{{years} 年前} other{去年}}} other{{years} 年前}}
zu: {years, plural, =0{{numeric, select, true{{years} iminyaka edlule} other{kulo nyaka}}} =1{{numeric, select, true{{years} unyaka odlule} other{onyakeni odlule}}} other{{years} iminyaka edlule}}
