Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# daysPast
source: {count, plural, zero{{numeric, select, true{{digits} days ago} other{today}}} one{{numeric, select, true{{digits} day ago} other{yesterday}}} other{{digits} days ago}}
af: {days, plural, zero{{numeric, select, true{{days} dae gelede} other{vandag}}} one{{numeric, select, true{{days} dag gelede} other{gister}}} two{{numeric, select, true{{days} dae gelede} other{eergister}}} other{{days} dae gelede}}
am: {count, plural, zero{{numeric, select, true{ከ{digits} ቀናት በፊት} other{ዛሬ}}} one{{numeric, select, true{ከ{digits} ቀን በፊት} other{ትናንት}}} two{{numeric, select, true{ከ{digits} ቀናት በፊት} other{ከትናንት ወዲያ}}} other{ከ{digits} ቀናት በፊት}}
ar: {days, plural, =0{{numeric, select, true{قبل {days} يوم} other{اليوم}}} =1{{numeric, select, true{قبل يوم واحد} other{أمس}}} =2{{numeric, select, true{قبل يومين} other{أول أمس}}} few{قبل {days} أيام} many{قبل {days} يومًا} other{قبل {days} يوم}}
as: {days, plural, zero{{numeric, select, true{{days} দিন পূৰ্বে} other{আজি}}} one{{numeric, select, true{{days} দিন পূৰ্বে} other{কালি}}} two{{numeric, select, true{{days} দিন পূৰ্বে} other{পৰহি}}} other{{days} দিন পূৰ্বে}}
ast: {days, plural, =0{{numeric, select, true{hai {days} díes} other{güei}}} =1{{numeric, select, true{hai {days} día} other{ayeri}}} =2{{numeric, select, true{hai {days} díes} other{antayeri}}} other{hai {days} díes}}
az: {days, plural, zero{{numeric, select, true{{days} gün öncə} other{bu gün}}} one{{numeric, select, true{{days} gün öncə} other{dünən}}} other{{days} gün öncə}}
be: {days, plural, =0{{numeric, select, true{{days} дня таму} other{сёння}}} =1{{numeric, select, true{{days} дзень таму} other{учора}}} =2{{numeric, select, true{{days} дня таму} other{пазаўчора}}} few{{days} дні таму} many{{days} дзён таму} other{{days} дня таму}}
bg: {days, plural, =0{{numeric, select, true{преди {days} дни} other{днес}}} =1{{numeric, select, true{преди {days} ден} other{вчера}}} =2{{numeric, select, true{преди {days} дни} other{онзи ден}}} other{преди {days} дни}}
bn: {days, plural, zero{{numeric, select, true{{days} দিন আগে} other{আজ}}} one{{numeric, select, true{{days} দিন আগে} other{গতকাল}}} two{{numeric, select, true{{days} দিন আগে} other{গত পরশু}}} other{{days} দিন আগে}}
br: {days, plural, =0{{numeric, select, true{{days} deiz zo} other{hiziv}}} =1{{numeric, select, true{{days} deiz zo} other{decʼh}}} =2{{numeric, select, true{{days} zeiz zo} other{dercʼhent-decʼh}}} many{{days} a zeizioù zo} other{{days} deiz zo}}
bs: {days, plural, =0{{numeric, select, true{prije {days} dana} other{danas}}} =1{{numeric, select, true{prije {days} dan} other{jučer}}} =2{{numeric, select, true{prije {days} dana} other{prekjučer}}} other{prije {days} dana}}
bs_cyrl: {count, plural, zero{{numeric, select, true{прије {digits} дана} other{данас}}} one{{numeric, select, true{прије {digits} дан} other{јуче}}} two{{numeric, select, true{прије {digits} дана} other{прекјуче}}} other{прије {digits} дана}}
ca: {days, plural, =0{{numeric, select, true{fa {days} dies} other{avui}}} =1{{numeric, select, true{fa {days} dia} other{ahir}}} =2{{numeric, select, true{fa {days} dies} other{abans-d’ahir}}} other{fa {days} dies}}
cs: {days, plural, =0{{numeric, select, true{před {days} dny} other{dnes}}} =1{{numeric, select, true{před {days} dnem} other{včera}}} =2{{numeric, select, true{před {days} dny} other{předevčírem}}} many{před {days} dne} other{před {days} dny}}
cy: {days, plural, =0{{numeric, select, true{{days} diwrnod yn ôl} other{heddiw}}} =1{{numeric, select, true{{days} diwrnod yn ôl} other{ddoe}}} =2{{numeric, select, true{{days} ddiwrnod yn ôl} other{echdoe}}} other{{days} diwrnod yn ôl}}
da: {days, plural, =0{{numeric, select, true{for {days} dage siden} other{i dag}}} =1{{numeric, select, true{for {days} dag siden} other{i går}}} =2{{numeric, select, true{for {days} dage siden} other{i forgårs}}} other{for {days} dage siden}}
de: {days, plural, =0{{numeric, select, true{vor {days} Tagen} other{heute}}} =1{{numeric, select, true{vor {days} Tag} other{gestern}}} =2{{numeric, select, true{vor {days} Tagen} other{vorgestern}}} other{vor {days} Tagen}}
dz: {days, plural, zero{{numeric, select, true{ཉིནམ་ {days} ཧེ་མ་} other{ད་རིས་}}} one{{numeric, select, true{ཉིནམ་ {days} ཧེ་མ་} other{ཁ་ཙ་}}} two{{numeric, select, true{ཉིནམ་ {days} ཧེ་མ་} other{ཁ་ཉིམ}}} other{ཉིནམ་ {days} ཧེ་མ་}}
el: {days, plural, =0{{numeric, select, true{πριν από {days} ημέρες} other{σήμερα}}} =1{{numeric, select, true{πριν από {days} ημέρα} other{χθες}}} =2{{numeric, select, true{πριν από {days} ημέρες} other{προχθές}}} other{πριν από {days} ημέρες}}
eo: {days, plural, =0{{numeric, select, true{antaŭ {days} tagoj} other{hodiaŭ}}} =1{{numeric, select, true{antaŭ {days} tago} other{hieraŭ}}} other{antaŭ {days} tagoj}}
es: {days, plural, zero{{numeric, select, true{hace {days} días} other{hoy}}} one{{numeric, select, true{hace {days} día} other{ayer}}} two{{numeric, select, true{hace {days} días} other{anteayer}}} other{hace {days} días}}
et: {days, plural, =0{{numeric, select, true{{days} päeva eest} other{täna}}} =1{{numeric, select, true{{days} päeva eest} other{eile}}} =2{{numeric, select, true{{days} päeva eest} other{üleeile}}} other{{days} päeva eest}}
eu: {days, plural, zero{{numeric, select, true{Duela {days} egun} other{gaur}}} one{{numeric, select, true{Duela {days} egun} other{atzo}}} two{{numeric, select, true{Duela {days} egun} other{herenegun}}} other{Duela {days} egun}}
fa: {days, plural, =0{{numeric, select, true{{days} روز پیش} other{امروز}}} =1{{numeric, select, true{{days} روز پیش} other{دیروز}}} =2{{numeric, select, true{{days} روز پیش} other{پریروز}}} other{{days} روز پیش}}
fi: {days, plural, zero{{numeric, select, true{{days} päivää sitten} other{tänään}}} one{{numeric, select, true{{days} päivä sitten} other{eilen}}} two{{numeric, select, true{{days} päivää sitten} other{toissa päivänä}}} other{{days} päivää sitten}}
fil: {days, plural, =0{{numeric, select, true{{days} araw ang nakalipas} other{ngayong araw}}} =1{{numeric, select, true{{days} araw ang nakalipas} other{kahapon}}} =2{{numeric, select, true{{days} araw ang nakalipas} other{Araw bago ang kahapon}}} other{{days} araw ang nakalipas}}
fo: {days, plural, zero{{numeric, select, true{{days} dagar síðan} other{í dag}}} one{{numeric, select, true{{days} dagur síðan} other{í gjár}}} two{{numeric, select, true{{days} dagar síðan} other{fyrradagin}}} other{{days} dagar síðan}}
fr: {days, plural, zero{{numeric, select, true{il y a {days} jours} other{aujourd’hui}}} one{{numeric, select, true{il y a {days} jour} other{hier}}} two{{numeric, select, true{il y a {days} jours} other{avant-hier}}} other{il y a {days} jours}}
fur: {count, plural, zero{{numeric, select, true{{digits} zornadis indaûr} other{vuê}}} one{{numeric, select, true{{digits} zornade indaûr} other{îr}}} two{{numeric, select, true{{digits} zornadis indaûr} other{îr l’altri}}} other{{digits} zornadis indaûr}}
fy: {days, plural, =0{{numeric, select, true{{days} deien lyn} other{vandaag}}} =1{{numeric, select, true{{days} dei lyn} other{gisteren}}} =2{{numeric, select, true{{days} deien lyn} other{eergisteren}}} other{{days} deien lyn}}
ga: {days, plural, zero{{numeric, select, true{{days} lá ó shin} other{inniu}}} one{{numeric, select, true{{days} lá ó shin} other{inné}}} two{{numeric, select, true{{days} lá ó shin} other{arú inné}}} other{{days} lá ó shin}}
gd: {days, plural, =0{{numeric, select, true{{days} latha air ais} other{an-diugh}}} =1{{numeric, select, true{{days} latha air ais} other{an-dè}}} =2{{numeric, select, true{{days} latha air ais} other{a-bhòin-dè}}} few{{days} làithean air ais} other{{days} latha air ais}}
gl: {days, plural, =0{{numeric, select, true{hai {days} días} other{hoxe}}} =1{{numeric, select, true{hai {days} día} other{onte}}} =2{{numeric, select, true{hai {days} días} other{antonte}}} other{hai {days} días}}
gu: {days, plural, zero{{numeric, select, true{{days} દિવસ પહેલાં} other{આજે}}} one{{numeric, select, true{{days} દિવસ પહેલાં} other{ગઈકાલે}}} two{{numeric, select, true{{days} દિવસ પહેલાં} other{ગયા પરમદિવસે}}} other{{days} દિવસ પહેલાં}}
he: {days, plural, =0{{numeric, select, true{לפני {days} ימים} other{היום}}} =1{{numeric, select, true{לפני יום {days}} other{אתמול}}} =2{{numeric, select, true{לפני יומיים} other{שלשום}}} other{לפני {days} ימים}}
hi: {days, plural, zero{{numeric, select, true{{days} दिन पहले} other{आज}}} one{{numeric, select, true{{days} दिन पहले} other{कल}}} two{{numeric, select, true{{days} दिन पहले} other{परसों}}} other{{days} दिन पहले}}
hi_latn: {days, plural, =0{{numeric, select, true{{days} din pehle} other{aaj}}} =1{{numeric, select, true{{days} din pehle} other{kal}}} =2{{numeric, select, true{{days} din pehle} other{parson}}} other{{days} din pehle}}
hr: {days, plural, zero{{numeric, select, true{prije {days} dana} other{danas}}} one{{numeric, select, true{prije {days} dan} other{jučer}}} two{{numeric, select, true{prije {days} dana} other{prekjučer}}} other{prije {days} dana}}
hu: {days, plural, =0{{numeric, select, true{{days} nappal ezelőtt} other{ma}}} =1{{numeric, select, true{{days} nappal ezelőtt} other{tegnap}}} =2{{numeric, select, true{{days} nappal ezelőtt} other{tegnapelőtt}}} other{{days} nappal ezelőtt}}
hy: {days, plural, zero{{numeric, select, true{{days} օր առաջ} other{այսօր}}} one{{numeric, select, true{{days} օր առաջ} other{երեկ}}} two{{numeric, select, true{{days} օր առաջ} other{նախանցյալ օրը}}} other{{days} օր առաջ}}
ia: {days, plural, =0{{numeric, select, true{{days} dies retro} other{hodie}}} =1{{numeric, select, true{{days} die retro} other{heri}}} other{{days} dies retro}}
id: {days, plural, zero{{numeric, select, true{{days} hari yang lalu} other{hari ini}}} one{{numeric, select, true{{days} hari yang lalu} other{kemarin}}} two{{numeric, select, true{{days} hari yang lalu} other{kemarin dulu}}} other{{days} hari yang lalu}}
is: {days, plural, zero{{numeric, select, true{fyrir {days} dögum} other{í dag}}} one{{numeric, select, true{fyrir {days} degi} other{í gær}}} two{{numeric, select, true{fyrir {days} dögum} other{í fyrradag}}} other{fyrir {days} dögum}}
it: {days, plural, zero{{numeric, select, true{{days} giorni fa} other{oggi}}} one{{numeric, select, true{{days} giorno fa} other{ieri}}} two{{numeric, select, true{{days} giorni fa} other{l’altro ieri}}} other{{days} giorni fa}}
ja: {days, plural, =0{{numeric, select, true{{days} 日前} other{今日}}} =1{{numeric, select, true{{days} 日前} other{昨日}}} =2{{numeric, select, true{{days} 日前} other{一昨日}}} other{{days} 日前}}
ka: {days, plural, zero{{numeric, select, true{{days} დღის წინ} other{დღეს}}} one{{numeric, select, true{{days} დღის წინ} other{გუშინ}}} two{{numeric, select, true{{days} დღის წინ} other{გუშინწინ}}} other{{days} დღის წინ}}
kab: {days, plural, zero{{numeric, select, true{{days} n wussan aya} other{Ass-a}}} one{{numeric, select, true{{days} n wass aya} other{Iḍelli}}} other{{days} n wussan aya}}
kk: {days, plural, zero{{numeric, select, true{{days} күн бұрын} other{бүгін}}} one{{numeric, select, true{{days} күн бұрын} other{кеше}}} two{{numeric, select, true{{days} күн бұрын} other{алдыңгүні}}} other{{days} күн бұрын}}
km: {count, plural, zero{{numeric, select, true{{digits} ថ្ងៃ​មុន} other{ថ្ងៃ​នេះ}}} one{{numeric, select, true{{digits} ថ្ងៃ​មុន} other{ម្សិលមិញ}}} two{{numeric, select, true{{digits} ថ្ងៃ​មុន} other{ម្សិល​ម៉្ងៃ}}} other{{digits} ថ្ងៃ​មុន}}
kn: {days, plural, =0{{numeric, select, true{{days} ದಿನಗಳ ಹಿಂದೆ} other{ಇಂದು}}} =1{{numeric, select, true{{days} ದಿನದ ಹಿಂದೆ} other{ನಿನ್ನೆ}}} =2{{numeric, select, true{{days} ದಿನಗಳ ಹಿಂದೆ} other{ಮೊನ್ನೆ}}} other{{days} ದಿನಗಳ ಹಿಂದೆ}}
ko: {days, plural, zero{{numeric, select, true{{days}일 전} other{오늘}}} one{{numeric, select, true{{days}일 전} other{어제}}} two{{numeric, select, true{{days}일 전} other{그저께}}} other{{days}일 전}}
ky: {days, plural, =0{{numeric, select, true{{days} күн мурун} other{бүгүн}}} =1{{numeric, select, true{{days} күн мурун} other{кечээ}}} =2{{numeric, select, true{{days} күн мурун} other{мурдагы күнү}}} other{{days} күн мурун}}
lb: {days, plural, zero{{numeric, select, true{viru(n) {days} Deeg} other{haut}}} one{{numeric, select, true{virun {days} Dag} other{gëschter}}} other{viru(n) {days} Deeg}}
lo: {days, plural, =0{{numeric, select, true{{days} ມື້ກ່ອນ} other{ມື້ນີ້}}} =1{{numeric, select, true{{days} ມື້ກ່ອນ} other{ມື້ວານ}}} =2{{numeric, select, true{{days} ມື້ກ່ອນ} other{ມື້ກ່ອນ}}} other{{days} ມື້ກ່ອນ}}
lt: {days, plural, =0{{numeric, select, true{prieš {days} dienų} other{šiandien}}} =1{{numeric, select, true{prieš {days} dieną} other{vakar}}} =2{{numeric, select, true{prieš {days} dienų} other{užvakar}}} few{prieš {days} dienas} many{prieš {days} dienos} other{prieš {days} dienų}}
lv: {days, plural, =0{{numeric, select, true{pirms {days} dienām} other{šodien}}} =1{{numeric, select, true{pirms {days} dienas} other{vakar}}} =2{{numeric, select, true{pirms {days} dienām} other{aizvakar}}} other{pirms {days} dienām}}
mai: {days, plural, zero{{numeric, select, true{{days} दिन मे} other{आजुक दिन}}} one{{numeric, select, true{{days} दिन मे} other{काल्हिक दिन}}} other{{days} दिन मे}}
mi: {count, plural, zero{{numeric, select, true{-{digits} rā i mua} other{i tēnei rā}}} one{{numeric, select, true{-{digits} rā i mua} other{inanahi}}} other{-{digits} rā i mua}}
mk: {days, plural, =0{{numeric, select, true{пред {days} дена} other{денес}}} =1{{numeric, select, true{пред {days} ден} other{вчера}}} =2{{numeric, select, true{пред {days} дена} other{завчера}}} other{пред {days} дена}}
ml: {days, plural, zero{{numeric, select, true{{days} ദിവസം മുമ്പ്} other{ഇന്ന്}}} one{{numeric, select, true{{days} ദിവസം മുമ്പ്} other{ഇന്നലെ}}} two{{numeric, select, true{{days} ദിവസം മുമ്പ്} other{മിനിഞ്ഞാന്ന്}}} other{{days} ദിവസം മുമ്പ്}}
mn: {days, plural, zero{{numeric, select, true{{days} өдрийн өмнө} other{өнөөдөр}}} one{{numeric, select, true{{days} өдрийн өмнө} other{өчигдөр}}} two{{numeric, select, true{{days} өдрийн өмнө} other{уржигдар}}} other{{days} өдрийн өмнө}}
mr: {days, plural, =0{{numeric, select, true{{days} दिवसांपूर्वी} other{आज}}} =1{{numeric, select, true{{days} दिवसापूर्वी} other{काल}}} other{{days} दिवसांपूर्वी}}
ms: {days, plural, zero{{numeric, select, true{{days} hari lalu} other{hari ini}}} one{{numeric, select, true{{days} hari lalu} other{semalam}}} two{{numeric, select, true{{days} hari lalu} other{kelmarin}}} other{{days} hari lalu}}
ms_arab: {count, plural, zero{{numeric, select, true{{digits} هاري لالو} other{هاري ني}}} one{{numeric, select, true{{digits} هاري لالو} other{سمالم}}} two{{numeric, select, true{{digits} هاري لالو} other{هاري سبلوم سمالم}}} other{{digits} هاري لالو}}
mt: {days, plural, zero{{numeric, select, true{{days} ġurnata ilu} other{illum}}} one{{numeric, select, true{ġurnata ilu} other{lbieraħ}}} two{jumejn ilu} few{{days} ġranet ilu} many{{days}-il ġurnata ilu} other{{days} ġurnata ilu}}
my: {days, plural, =0{{numeric, select, true{ပြီးခဲ့သည့် {days} ရက်} other{ယနေ့}}} =1{{numeric, select, true{ပြီးခဲ့သည့် {days} ရက်} other{မနေ့က}}} =2{{numeric, select, true{ပြီးခဲ့သည့် {days} ရက်} other{တစ်နေ့က}}} other{ပြီးခဲ့သည့် {days} ရက်}}
ne: {days, plural, =0{{numeric, select, true{{days} दिन पहिले} other{आज}}} =1{{numeric, select, true{{days} दिन पहिले} other{हिजो}}} =2{{numeric, select, true{{days} दिन पहिले} other{अस्ति}}} other{{days} दिन पहिले}}
nl: {days, plural, zero{{numeric, select, true{{days} dagen geleden} other{vandaag}}} one{{numeric, select, true{{days} dag geleden} other{gisteren}}} two{{numeric, select, true{{days} dagen geleden} other{eergisteren}}} other{{days} dagen geleden}}
no: {days, plural, zero{{numeric, select, true{for {days} døgn siden} other{i dag}}} one{{numeric, select, true{for {days} døgn siden} other{i går}}} two{{numeric, select, true{for {days} døgn siden} other{i forgårs}}} other{for {days} døgn siden}}
or: {days, plural, zero{{numeric, select, true{{days} ଦିନ ପୂର୍ବେ} other{ଆଜି}}} one{{numeric, select, true{{days} ଦିନ ପୂର୍ବେ} other{ଗତକାଲି}}} other{{days} ଦିନ ପୂର୍ବେ}}
pa: {days, plural, =0{{numeric, select, true{{days} ਦਿਨ ਪਹਿਲਾਂ} other{ਅੱਜ}}} =1{{numeric, select, true{{days} ਦਿਨ ਪਹਿਲਾਂ} other{ਬੀਤਿਆ ਕੱਲ੍ਹ}}} other{{days} ਦਿਨ ਪਹਿਲਾਂ}}
pl: {count, plural, zero{{numeric, select, true{{digits} dnia temu} other{dzisiaj}}} one{{numeric, select, true{{digits} dzień temu} other{wczoraj}}} two{{numeric, select, true{{digits} dnia temu} other{przedwczoraj}}} few{{digits} dni temu} many{{digits} dni temu} other{{digits} dnia temu}}
ps: {days, plural, =0{{numeric, select, true{{days} ورځې مخکې} other{نن}}} =1{{numeric, select, true{{days} ورځ مخکې} other{پرون}}} other{{days} ورځې مخکې}}
pt: {days, plural, =0{{numeric, select, true{há {days} dias} other{hoje}}} =1{{numeric, select, true{há {days} dia} other{ontem}}} =2{{numeric, select, true{há {days} dias} other{anteontem}}} other{há {days} dias}}
ro: {days, plural, =0{{numeric, select, true{acum {days} de zile} other{azi}}} =1{{numeric, select, true{acum {days} zi} other{ieri}}} =2{{numeric, select, true{acum {days} de zile} other{alaltăieri}}} few{acum {days} zile} other{acum {days} de zile}}
ru: {days, plural, =0{{numeric, select, true{{days} дня назад} other{сегодня}}} =1{{numeric, select, true{{days} день назад} other{вчера}}} =2{{numeric, select, true{{days} дня назад} other{позавчера}}} many{{days} дней назад} other{{days} дня назад}}
sc: {days, plural, =0{{numeric, select, true{{days} dies a como} other{oe}}} =1{{numeric, select, true{{days} die a como} other{eris}}} other{{days} dies a como}}
sd: {days, plural, =0{{numeric, select, true{{days} ڏينهن پهرين} other{اڄ}}} =1{{numeric, select, true{{days} ڏينهن پهرين} other{ڪل}}} other{{days} ڏينهن پهرين}}
se: {count, plural, zero{{numeric, select, true{{digits} jándora árat} other{odne}}} one{{numeric, select, true{{digits} jándor árat} other{ikte}}} two{{numeric, select, true{{digits} jándora árat} other{oovdebpeivvi}}} other{{digits} jándora árat}}
se_fi: {days, plural, =2{{numeric, select, true{ovddet beaivve} other{ovddet beaivvi}}} =1{ikte} other{{days} beaivve dás ovdal}}
si: {days, plural, =0{{numeric, select, true{දින {days}කට පෙර} other{අද}}} =1{{numeric, select, true{දින {days}කට පෙර} other{ඊයේ}}} =2{{numeric, select, true{දින {days}කට පෙර} other{පෙරේදා}}} other{දින {days}කට පෙර}}
sk: {days, plural, zero{{numeric, select, true{pred {days} dňami} other{dnes}}} one{{numeric, select, true{pred {days} dňom} other{včera}}} two{{numeric, select, true{pred {days} dňami} other{predvčerom}}} many{pred {days} dňa} other{pred {days} dňami}}
sl: {days, plural, =0{{numeric, select, true{pred {days} dnevi} other{danes}}} =1{{numeric, select, true{pred {days} dnevom} other{včeraj}}} =2{{numeric, select, true{pred {days} dnevoma} other{predvčerajšnjim}}} other{pred {days} dnevi}}
sq: {days, plural, zero{{numeric, select, true{{days} ditë më parë} other{sot}}} one{{numeric, select, true{{days} ditë më parë} other{dje}}} other{{days} ditë më parë}}
sr: {days, plural, =0{{numeric, select, true{пре {days} дана} other{данас}}} =1{{numeric, select, true{пре {days} дана} other{јуче}}} =2{{numeric, select, true{пре {days} дана} other{прекјуче}}} other{пре {days} дана}}
sr_latn: {days, plural, =0{{numeric, select, true{pre {days} dana} other{danas}}} =1{{numeric, select, true{pre {days} dana} other{juče}}} =2{{numeric, select, true{pre {days} dana} other{prekjuče}}} other{pre {days} dana}}
sv: {days, plural, =0{{numeric, select, true{för {days} dagar sedan} other{i dag}}} =1{{numeric, select, true{för {days} dag sedan} other{i går}}} =2{{numeric, select, true{för {days} dagar sedan} other{i förrgår}}} other{för {days} dagar sedan}}
sw: {days, plural, =0{{numeric, select, true{siku {days} zilizopita} other{leo}}} =1{{numeric, select, true{siku {days} iliyopita} other{jana}}} =2{{numeric, select, true{siku {days} zilizopita} other{juzi}}} other{siku {days} zilizopita}}
ta: {days, plural, =0{{numeric, select, true{{days} நாட்களுக்கு முன்} other{இன்று}}} =1{{numeric, select, true{{days} நாளுக்கு முன்} other{நேற்று}}} =2{{numeric, select, true{{days} நாட்களுக்கு முன்} other{நேற்று முன் தினம்}}} other{{days} நாட்களுக்கு முன்}}
te: {days, plural, zero{{numeric, select, true{{days} రోజుల క్రితం} other{ఈ రోజు}}} one{{numeric, select, true{{days} రోజు క్రితం} other{నిన్న}}} two{{numeric, select, true{{days} రోజుల క్రితం} other{మొన్న}}} other{{days} రోజుల క్రితం}}
tg: {days, plural, =0{{numeric, select, true{{days} рӯз пеш} other{имрӯз}}} =1{{numeric, select, true{{days} рӯз пеш} other{дирӯз}}} other{{days} рӯз пеш}}
th: {days, plural, zero{{numeric, select, true{{days} วันที่ผ่านมา} other{วันนี้}}} one{{numeric, select, true{{days} วันที่ผ่านมา} other{เมื่อวาน}}} two{{numeric, select, true{{days} วันที่ผ่านมา} other{เมื่อวานซืน}}} other{{days} วันที่ผ่านมา}}
tk: {days, plural, zero{{numeric, select, true{{days} gün öň} other{şu gün}}} one{{numeric, select, true{{days} gün öň} other{düýn}}} other{{days} gün öň}}
tr: {days, plural, =0{{numeric, select, true{{days} gün önce} other{bugün}}} =1{{numeric, select, true{{days} gün önce} other{dün}}} =2{{numeric, select, true{{days} gün önce} other{evvelsi gün}}} other{{days} gün önce}}
tt: {days, plural, zero{{numeric, select, true{{days} көн элек} other{бүген}}} one{{numeric, select, true{{days} көн элек} other{кичә}}} other{{days} көн элек}}
ug: {count, plural, zero{{numeric, select, true{{digits} كۈن ئىلگىرى} other{بۈگۈن}}} one{{numeric, select, true{{digits} كۈن ئىلگىرى} other{تۈنۈگۈن}}} other{{digits} كۈن ئىلگىرى}}
uk: {count, plural, zero{{numeric, select, true{{digits} дня тому} other{сьогодні}}} one{{numeric, select, true{{digits} день тому} other{учора}}} two{{numeric, select, true{{digits} дня тому} other{позавчора}}} few{{digits} дні тому} many{{digits} днів тому} other{{digits} дня тому}}
ur: {days, plural, =0{{numeric, select, true{{days} دنوں پہلے} other{آج}}} =1{{numeric, select, true{{days} دن پہلے} other{گزشتہ کل}}} =2{{numeric, select, true{{days} دنوں پہلے} other{گزشتہ پرسوں}}} other{{days} دنوں پہلے}}
uz: {days, plural, =0{{numeric, select, true{{days} kun oldin} other{bugun}}} =1{{numeric, select, true{{days} kun oldin} other{kecha}}} other{{days} kun oldin}}
uz_cyrl: {days, plural, zero{{numeric, select, true{{days} кун олдин} other{бугун}}} one{{numeric, select, true{{days} кун олдин} other{кеча}}} other{{days} кун олдин}}
vi: {days, plural, zero{{numeric, select, true{{days} ngày trước} other{Hôm nay}}} one{{numeric, select, true{{days} ngày trước} other{Hôm qua}}} two{{numeric, select, true{{days} ngày trước} other{Hôm kia}}} other{{days} ngày trước}}
zh: {days, plural, =0{{numeric, select, true{{days}天前} other{今天}}} =1{{numeric, select, true{{days}天前} other{昨天}}} =2{{numeric, select, true{{days}天前} other{前天}}} other{{days}天前}}
zh_hant: {days, plural, =0{{numeric, select, true{{days} 天前} other{今天}}} =1{{numeric, select, true{{days} 天前} other{昨天}}} =2{{numeric, select, true{{days} 天前} other{前天}}} other{{days} 天前}}
zu: {days, plural, =0{{numeric, select, true{ezinsukwini ezingu-{days} ezedlule.} other{namhlanje}}} =1{{numeric, select, true{osukwini olungu-{days} olwedlule} other{izolo}}} =2{{numeric, select, true{ezinsukwini ezingu-{days} ezedlule.} other{usuku olwandulela olwayizolo}}} other{ezinsukwini ezingu-{days} ezedlule.}}
