Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# secondsPast
source: {count, plural, zero{{numeric, select, true{{digits} seconds ago} other{now}}} one{{digits} second ago} other{{digits} seconds ago}}
af: {seconds, plural, zero{{numeric, select, true{{seconds} sekondes gelede} other{nou}}} one{{seconds} sekonde gelede} other{{seconds} sekondes gelede}}
am: {count, plural, zero{{numeric, select, true{ከ{digits} ሰከንዶች በፊት} other{አሁን}}} one{ከ{digits} ሰከንድ በፊት} other{ከ{digits} ሰከንዶች በፊት}}
ar: {seconds, plural, =0{{numeric, select, true{قبل {seconds} ثانية} other{الآن}}} =1{قبل ثانية واحدة} =2{قبل ثانيتين} few{قبل {seconds} ثوانِ} other{قبل {seconds} ثانية}}
as: {seconds, plural, zero{{numeric, select, true{{seconds} ছেকেণ্ড পূৰ্বে} other{এতিয়া}}} other{{seconds} ছেকেণ্ড পূৰ্বে}}
ast: {seconds, plural, =0{{numeric, select, true{hai {seconds} segundos} other{agora}}} =1{hai {seconds} segundu} other{hai {seconds} segundos}}
az: {seconds, plural, zero{{numeric, select, true{{seconds} saniyə öncə} other{indi}}} other{{seconds} saniyə öncə}}
be: {seconds, plural, =0{{numeric, select, true{{seconds} секунды таму} other{цяпер}}} =1{{seconds} секунду таму} many{{seconds} секунд таму} other{{seconds} секунды таму}}
bg: {seconds, plural, =0{{numeric, select, true{преди {seconds} секунди} other{сега}}} =1{преди {seconds} секунда} other{преди {seconds} секунди}}
bn: {seconds, plural, zero{{numeric, select, true{{seconds} সেকেন্ড পূর্বে} other{এখন}}} other{{seconds} সেকেন্ড পূর্বে}}
br: {seconds, plural, =0{{numeric, select, true{{seconds} eilenn zo} other{bremañ}}} other{{seconds} eilenn zo}}
bs: {seconds, plural, =0{{numeric, select, true{prije {seconds} sekundi} other{sada}}} =1{prije {seconds} sekundu} few{prije {seconds} sekunde} other{prije {seconds} sekundi}}
bs_cyrl: {count, plural, zero{{numeric, select, true{прије {digits} секунди} other{сада}}} one{прије {digits} секунд} few{прије {digits} секунде} other{прије {digits} секунди}}
ca: {seconds, plural, =0{{numeric, select, true{fa {seconds} segons} other{ara}}} =1{fa {seconds} segon} other{fa {seconds} segons}}
cs: {seconds, plural, =0{{numeric, select, true{před {seconds} sekundami} other{nyní}}} =1{před {seconds} sekundou} many{před {seconds} sekundy} other{před {seconds} sekundami}}
cy: {seconds, plural, =0{{numeric, select, true{{seconds} eiliad yn ôl} other{nawr}}} other{{seconds} eiliad yn ôl}}
da: {seconds, plural, =0{{numeric, select, true{for {seconds} sekunder siden} other{nu}}} =1{for {seconds} sekund siden} other{for {seconds} sekunder siden}}
de: {seconds, plural, =0{{numeric, select, true{vor {seconds} Sekunden} other{jetzt}}} =1{vor {seconds} Sekunde} other{vor {seconds} Sekunden}}
dz: སྐར་ཆ་ {seconds} ཧེ་མ་
el: {seconds, plural, =0{{numeric, select, true{πριν από {seconds} δευτερόλεπτα} other{τώρα}}} =1{πριν από {seconds} δευτερόλεπτο} other{πριν από {seconds} δευτερόλεπτα}}
eo: {seconds, plural, =0{{numeric, select, true{antaŭ {seconds} sekundoj} other{nun}}} =1{antaŭ {seconds} sekundo} other{antaŭ {seconds} sekundoj}}
es: {seconds, plural, zero{{numeric, select, true{hace {seconds} segundos} other{ahora}}} one{hace {seconds} segundo} other{hace {seconds} segundos}}
et: {seconds, plural, =0{{numeric, select, true{{seconds} sekundi eest} other{nüüd}}} other{{seconds} sekundi eest}}
eu: {seconds, plural, zero{{numeric, select, true{Duela {seconds} segundo} other{orain}}} other{Duela {seconds} segundo}}
fa: {seconds, plural, =0{{numeric, select, true{{seconds} ثانیه پیش} other{اکنون}}} other{{seconds} ثانیه پیش}}
fi: {seconds, plural, zero{{numeric, select, true{{seconds} sekuntia sitten} other{nyt}}} one{{seconds} sekunti sitten} other{{seconds} sekuntia sitten}}
fil: {seconds, plural, =0{{numeric, select, true{{seconds} segundo ang nakalipas} other{ngayon}}} other{{seconds} segundo ang nakalipas}}
fo: {seconds, plural, zero{{numeric, select, true{{seconds} sekund síðan} other{nú}}} other{{seconds} sekund síðan}}
fr: {seconds, plural, zero{{numeric, select, true{il y a {seconds} secondes} other{maintenant}}} one{il y a {seconds} seconde} other{il y a {seconds} secondes}}
fur: {count, plural, one{{digits} secont indaûr} other{{digits} seconts indaûr}}
fy: {seconds, plural, =0{{numeric, select, true{{seconds} sekonden lyn} other{nu}}} =1{{seconds} sekonde lyn} other{{seconds} sekonden lyn}}
ga: {seconds, plural, zero{{numeric, select, true{{seconds} soicind ó shin} other{anois}}} two{{seconds} shoicind ó shin} few{{seconds} shoicind ó shin} other{{seconds} soicind ó shin}}
gd: {seconds, plural, =0{{numeric, select, true{{seconds} diog air ais} other{an-dràsta}}} =2{{seconds} dhiog air ais} few{{seconds} diogan air ais} other{{seconds} diog air ais}}
gl: {seconds, plural, =0{{numeric, select, true{hai {seconds} segundos} other{agora}}} =1{hai {seconds} segundo} other{hai {seconds} segundos}}
gu: {seconds, plural, zero{{numeric, select, true{{seconds} સેકંડ પહેલાં} other{હમણાં}}} other{{seconds} સેકંડ પહેલાં}}
he: {seconds, plural, =0{{numeric, select, true{לפני {seconds} שניות} other{עכשיו}}} =1{לפני שנייה} =2{לפני שתי שניות} other{לפני {seconds} שניות}}
hi: {seconds, plural, zero{{numeric, select, true{{seconds} सेकंड पहले} other{अब}}} other{{seconds} सेकंड पहले}}
hi_latn: {seconds, plural, =0{{numeric, select, true{{seconds} second pahle} other{abhi}}} other{{seconds} second pahle}}
hr: {seconds, plural, zero{{numeric, select, true{prije {seconds} sekundi} other{sad}}} one{prije {seconds} sekundu} few{prije {seconds} sekunde} other{prije {seconds} sekundi}}
hu: {seconds, plural, =0{{numeric, select, true{{seconds} másodperccel ezelőtt} other{most}}} other{{seconds} másodperccel ezelőtt}}
hy: {seconds, plural, zero{{numeric, select, true{{seconds} վայրկյան առաջ} other{հիմա}}} other{{seconds} վայրկյան առաջ}}
ia: {seconds, plural, =0{{numeric, select, true{{seconds} secundas retro} other{ora}}} =1{{seconds} secunda retro} other{{seconds} secundas retro}}
id: {seconds, plural, zero{{numeric, select, true{{seconds} detik yang lalu} other{sekarang}}} other{{seconds} detik yang lalu}}
is: {seconds, plural, zero{{numeric, select, true{fyrir {seconds} sekúndum} other{núna}}} one{fyrir {seconds} sekúndu} other{fyrir {seconds} sekúndum}}
it: {seconds, plural, zero{{numeric, select, true{{seconds} secondi fa} other{ora}}} one{{seconds} secondo fa} other{{seconds} secondi fa}}
ja: {seconds, plural, =0{{numeric, select, true{{seconds} 秒前} other{今}}} other{{seconds} 秒前}}
ka: {seconds, plural, zero{{numeric, select, true{{seconds} წამის წინ} other{ახლა}}} other{{seconds} წამის წინ}}
kab: {seconds, plural, zero{{numeric, select, true{{seconds} n tasinin aya} other{tura}}} one{{seconds} n tasint aya} other{{seconds} n tasinin aya}}
kk: {seconds, plural, zero{{numeric, select, true{{seconds} секунд бұрын} other{қазір}}} other{{seconds} секунд бұрын}}
km: {count, plural, zero{{numeric, select, true{{digits} វិនាទី​មុន} other{ឥឡូវ}}} other{{digits} វិនាទី​មុន}}
kn: {seconds, plural, =0{{numeric, select, true{{seconds} ಸೆಕೆಂಡುಗಳ ಹಿಂದೆ} other{ಈಗ}}} =1{{seconds} ಸೆಕೆಂಡ್ ಹಿಂದೆ} other{{seconds} ಸೆಕೆಂಡುಗಳ ಹಿಂದೆ}}
ko: {seconds, plural, zero{{numeric, select, true{{seconds}초 전} other{지금}}} other{{seconds}초 전}}
ky: {seconds, plural, =0{{numeric, select, true{{seconds} секунд мурун} other{азыр}}} other{{seconds} секунд мурун}}
lb: {seconds, plural, one{virun {seconds} Sekonn} other{viru(n) {seconds} Sekonnen}}
lo: {seconds, plural, =0{{numeric, select, true{{seconds} ວິນາທີກ່ອນ} other{ຕອນນີ້}}} other{{seconds} ວິນາທີກ່ອນ}}
lt: {seconds, plural, =0{{numeric, select, true{prieš {seconds} sekundžių} other{dabar}}} =1{prieš {seconds} sekundę} few{prieš {seconds} sekundes} many{prieš {seconds} sekundės} other{prieš {seconds} sekundžių}}
lv: {seconds, plural, =0{{numeric, select, true{pirms {seconds} sekundēm} other{tagad}}} =1{pirms {seconds} sekundes} other{pirms {seconds} sekundēm}}
mai: {seconds, plural, zero{{numeric, select, true{{seconds} सेकेंड पहिले} other{एहि समय}}} other{{seconds} सेकेंड पहिले}}
mi: {count, plural, zero{{numeric, select, true{-{digits} hēkona i mua} other{ināianei}}} other{-{digits} hēkona i mua}}
mk: {seconds, plural, =0{{numeric, select, true{пред {seconds} секунди} other{сега}}} =1{пред {seconds} секунда} other{пред {seconds} секунди}}
ml: {seconds, plural, zero{{numeric, select, true{{seconds} സെക്കൻഡ് മുമ്പ്} other{ഇപ്പോൾ}}} other{{seconds} സെക്കൻഡ് മുമ്പ്}}
mn: {seconds, plural, zero{{numeric, select, true{{seconds} секундын өмнө} other{одоо}}} other{{seconds} секундын өмнө}}
mr: {seconds, plural, =0{{numeric, select, true{{seconds} सेकंदांपूर्वी} other{आत्ता}}} =1{{seconds} सेकंदापूर्वी} other{{seconds} सेकंदांपूर्वी}}
ms: {seconds, plural, zero{{numeric, select, true{{seconds} saat lalu} other{sekarang}}} other{{seconds} saat lalu}}
ms_arab: {digits} ساعت لالو
mt: {seconds, plural, zero{{numeric, select, true{{seconds} sekonda ilu} other{issa}}} one{sekonda ilu} two{{seconds} sekondi ilu} few{{seconds} sekondi ilu} many{{seconds}-il sekonda ilu} other{{seconds} sekonda ilu}}
my: {seconds, plural, =0{{numeric, select, true{ပြီးခဲ့သည့် {seconds} စက္ကန့်} other{ယခု}}} other{ပြီးခဲ့သည့် {seconds} စက္ကန့်}}
ne: {seconds, plural, =0{{numeric, select, true{{seconds} सेकेन्ड पहिले} other{अहिले}}} other{{seconds} सेकेन्ड पहिले}}
nl: {seconds, plural, zero{{numeric, select, true{{seconds} seconden geleden} other{nu}}} one{{seconds} seconde geleden} other{{seconds} seconden geleden}}
no: {seconds, plural, zero{{numeric, select, true{for {seconds} sekunder siden} other{nå}}} one{for {seconds} sekund siden} other{for {seconds} sekunder siden}}
or: {seconds, plural, zero{{numeric, select, true{{seconds} ସେକେଣ୍ଡ ପୂର୍ବେ} other{ବର୍ତ୍ତମାନ}}} other{{seconds} ସେକେଣ୍ଡ ପୂର୍ବେ}}
pa: {seconds, plural, =0{{numeric, select, true{{seconds} ਸਕਿੰਟ ਪਹਿਲਾਂ} other{ਹੁਣ}}} other{{seconds} ਸਕਿੰਟ ਪਹਿਲਾਂ}}
pl: {count, plural, zero{{numeric, select, true{{digits} sekundy temu} other{teraz}}} one{{digits} sekundę temu} many{{digits} sekund temu} other{{digits} sekundy temu}}
ps: {seconds, plural, =0{{numeric, select, true{{seconds} ثانيې مخکې} other{اوس}}} =1{{seconds} ثانيه مخکې} other{{seconds} ثانيې مخکې}}
pt: {seconds, plural, =0{{numeric, select, true{há {seconds} segundos} other{agora}}} =1{há {seconds} segundo} other{há {seconds} segundos}}
ro: {seconds, plural, =0{{numeric, select, true{acum {seconds} de secunde} other{acum}}} =1{acum {seconds} secundă} few{acum {seconds} secunde} other{acum {seconds} de secunde}}
ru: {seconds, plural, =0{{numeric, select, true{{seconds} секунды назад} other{сейчас}}} =1{{seconds} секунду назад} many{{seconds} секунд назад} other{{seconds} секунды назад}}
sc: {seconds, plural, =0{{numeric, select, true{{seconds} segundos a como} other{como}}} =1{{seconds} segundu a como} other{{seconds} segundos a como}}
sd: {seconds, plural, =0{{numeric, select, true{{seconds} سيڪنڊ پهرين} other{هاڻي}}} other{{seconds} سيڪنڊ پهرين}}
se: {count, plural, zero{{numeric, select, true{{digits} sekundda árat} other{na}}} one{{digits} sekunda árat} other{{digits} sekundda árat}}
se_fi: {seconds, plural, =0{{numeric, select, true{{seconds} sekundda áigi} other{dál}}} =1{{seconds} sekunda áigi} other{{seconds} sekundda áigi}}
si: {seconds, plural, =0{{numeric, select, true{තත්පර {seconds}කට පෙර} other{දැන්}}} other{තත්පර {seconds}කට පෙර}}
sk: {seconds, plural, zero{{numeric, select, true{pred {seconds} sekundami} other{teraz}}} one{pred {seconds} sekundou} many{pred {seconds} sekundy} other{pred {seconds} sekundami}}
sl: {seconds, plural, =0{{numeric, select, true{pred {seconds} sekundami} other{zdaj}}} =1{pred {seconds} sekundo} =2{pred {seconds} sekundama} other{pred {seconds} sekundami}}
sq: {seconds, plural, zero{{numeric, select, true{{seconds} sekonda më parë} other{tani}}} one{{seconds} sekondë më parë} other{{seconds} sekonda më parë}}
sr: {seconds, plural, =0{{numeric, select, true{пре {seconds} секунди} other{сада}}} =1{пре {seconds} секунде} few{пре {seconds} секунде} other{пре {seconds} секунди}}
sr_latn: {seconds, plural, =0{{numeric, select, true{pre {seconds} sekundi} other{sada}}} =1{pre {seconds} sekunde} few{pre {seconds} sekunde} other{pre {seconds} sekundi}}
sv: {seconds, plural, =0{{numeric, select, true{för {seconds} sekunder sedan} other{nu}}} =1{för {seconds} sekund sedan} other{för {seconds} sekunder sedan}}
sw: {seconds, plural, =0{{numeric, select, true{Sekunde {seconds} zilizopita} other{sasa hivi}}} =1{Sekunde {seconds} iliyopita} other{Sekunde {seconds} zilizopita}}
ta: {seconds, plural, =0{{numeric, select, true{{seconds} விநாடிகளுக்கு முன்} other{இப்போது}}} =1{{seconds} விநாடிக்கு முன்} other{{seconds} விநாடிகளுக்கு முன்}}
te: {seconds, plural, zero{{numeric, select, true{{seconds} సెకన్ల క్రితం} other{ప్రస్తుతం}}} one{{seconds} సెకను క్రితం} other{{seconds} సెకన్ల క్రితం}}
tg: {seconds, plural, =0{{numeric, select, true{{seconds} сония пеш} other{ҳозир}}} other{{seconds} сония пеш}}
th: {seconds, plural, zero{{numeric, select, true{{seconds} วินาทีที่ผ่านมา} other{ขณะนี้}}} other{{seconds} วินาทีที่ผ่านมา}}
tk: {seconds, plural, zero{{numeric, select, true{{seconds} sekunt öň} other{häzir}}} other{{seconds} sekunt öň}}
tr: {seconds, plural, =0{{numeric, select, true{{seconds} saniye önce} other{şimdi}}} other{{seconds} saniye önce}}
tt: {seconds, plural, zero{{numeric, select, true{{seconds} секунд элек} other{хәзер}}} other{{seconds} секунд элек}}
ug: {digits} سېكۇنت ئىلگىرى
uk: {count, plural, zero{{numeric, select, true{{digits} секунди тому} other{зараз}}} one{{digits} секунду тому} many{{digits} секунд тому} other{{digits} секунди тому}}
ur: {seconds, plural, =0{{numeric, select, true{{seconds} سیکنڈ پہلے} other{اب}}} other{{seconds} سیکنڈ پہلے}}
uz: {seconds, plural, =0{{numeric, select, true{{seconds} soniya oldin} other{hozir}}} other{{seconds} soniya oldin}}
uz_cyrl: {seconds, plural, zero{{numeric, select, true{{seconds} сония олдин} other{ҳозир}}} other{{seconds} сония олдин}}
vi: {seconds, plural, zero{{numeric, select, true{{seconds} giây trước} other{bây giờ}}} other{{seconds} giây trước}}
zh: {seconds, plural, =0{{numeric, select, true{{seconds}秒钟前} other{现在}}} other{{seconds}秒钟前}}
zh_hant: {seconds, plural, =0{{numeric, select, true{{seconds} 秒前} other{現在}}} other{{seconds} 秒前}}
zu: {seconds, plural, =0{{numeric, select, true{{seconds} amasekhondi edlule} other{manje}}} =1{{seconds} isekhondi eledlule} other{{seconds} amasekhondi edlule}}
