Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# weeksFuture
source: {count, plural, zero{{numeric, select, true{in {digits} weeks} other{this week}}} one{{numeric, select, true{in {digits} week} other{next week}}} other{in {digits} weeks}}
af: {weeks, plural, zero{{numeric, select, true{oor {weeks} weke} other{hierdie week}}} one{{numeric, select, true{oor {weeks} week} other{volgende week}}} other{oor {weeks} weke}}
am: {count, plural, zero{{numeric, select, true{በ{digits} ሳምንታት ውስጥ} other{በዚህ ሳምንት}}} one{{numeric, select, true{በ{digits} ሳምንት ውስጥ} other{የሚቀጥለው ሳምንት}}} other{በ{digits} ሳምንታት ውስጥ}}
ar: {weeks, plural, =0{{numeric, select, true{خلال {weeks} أسبوع} other{هذا الأسبوع}}} =1{{numeric, select, true{خلال أسبوع واحد} other{الأسبوع القادم}}} =2{خلال أسبوعين} few{خلال {weeks} أسابيع} many{خلال {weeks} أسبوعًا} other{خلال {weeks} أسبوع}}
as: {weeks, plural, zero{{numeric, select, true{{weeks} সপ্তাহত} other{এই সপ্তাহ}}} one{{numeric, select, true{{weeks} সপ্তাহত} other{অহা সপ্তাহ}}} other{{weeks} সপ্তাহত}}
ast: {weeks, plural, =0{{numeric, select, true{en {weeks} selmanes} other{esta selmana}}} =1{{numeric, select, true{en {weeks} selmana} other{la selmana viniente}}} other{en {weeks} selmanes}}
az: {weeks, plural, zero{{numeric, select, true{{weeks} həftə ərzində} other{bu həftə}}} one{{numeric, select, true{{weeks} həftə ərzində} other{gələn həftə}}} other{{weeks} həftə ərzində}}
be: {weeks, plural, =0{{numeric, select, true{праз {weeks} тыдня} other{на гэтым тыдні}}} =1{{numeric, select, true{праз {weeks} тыдзень} other{на наступным тыдні}}} few{праз {weeks} тыдні} many{праз {weeks} тыдняў} other{праз {weeks} тыдня}}
bg: {weeks, plural, =0{{numeric, select, true{след {weeks} седмици} other{тази седмица}}} =1{{numeric, select, true{след {weeks} седмица} other{следващата седмица}}} other{след {weeks} седмици}}
bn: {weeks, plural, zero{{numeric, select, true{{weeks} সপ্তাহে} other{এই সপ্তাহ}}} one{{numeric, select, true{{weeks} সপ্তাহে} other{পরের সপ্তাহ}}} other{{weeks} সপ্তাহে}}
br: {weeks, plural, =0{{numeric, select, true{a-benn {weeks} sizhun} other{ar sizhun-mañ}}} =1{{numeric, select, true{a-benn {weeks} sizhun} other{ar sizhun a zeu}}} many{a-benn {weeks} a sizhunioù} other{a-benn {weeks} sizhun}}
bs: {weeks, plural, =0{{numeric, select, true{za {weeks} sedmica} other{ove sedmice}}} =1{{numeric, select, true{za {weeks} sedmicu} other{sljedeće sedmice}}} few{za {weeks} sedmice} other{za {weeks} sedmica}}
bs_cyrl: {count, plural, zero{{numeric, select, true{за {digits} седмица} other{ове седмице}}} one{{numeric, select, true{за {digits} седмицу} other{сљедеће седмице}}} few{за {digits} седмице} other{за {digits} седмица}}
ca: {weeks, plural, =0{{numeric, select, true{d’aquí a {weeks} setmanes} other{aquesta setmana}}} =1{{numeric, select, true{d’aquí a {weeks} setmana} other{la setmana que ve}}} other{d’aquí a {weeks} setmanes}}
cs: {weeks, plural, =0{{numeric, select, true{za {weeks} týdnů} other{tento týden}}} =1{{numeric, select, true{za {weeks} týden} other{příští týden}}} few{za {weeks} týdny} many{za {weeks} týdne} other{za {weeks} týdnů}}
cy: {weeks, plural, =0{{numeric, select, true{ymhen {weeks} wythnos} other{yr wythnos hon}}} =1{{numeric, select, true{ymhen wythnos} other{wythnos nesaf}}} =2{ymhen pythefnos} other{ymhen {weeks} wythnos}}
da: {weeks, plural, =0{{numeric, select, true{om {weeks} uger} other{denne uge}}} =1{{numeric, select, true{om {weeks} uge} other{næste uge}}} other{om {weeks} uger}}
de: {weeks, plural, =0{{numeric, select, true{in {weeks} Wochen} other{diese Woche}}} =1{{numeric, select, true{in {weeks} Woche} other{nächste Woche}}} other{in {weeks} Wochen}}
dz: བངུན་ཕྲག་ {weeks} ནང་
el: {weeks, plural, =0{{numeric, select, true{σε {weeks} εβδομάδες} other{τρέχουσα εβδομάδα}}} =1{{numeric, select, true{σε {weeks} εβδομάδα} other{επόμενη εβδομάδα}}} other{σε {weeks} εβδομάδες}}
eo: {weeks, plural, =0{{numeric, select, true{post {weeks} semajnoj} other{nuna semajno}}} =1{{numeric, select, true{post {weeks} semajno} other{venonta semajno}}} other{post {weeks} semajnoj}}
es: {weeks, plural, zero{{numeric, select, true{dentro de {weeks} semanas} other{esta semana}}} one{{numeric, select, true{dentro de {weeks} semana} other{la próxima semana}}} other{dentro de {weeks} semanas}}
et: {weeks, plural, =0{{numeric, select, true{{weeks} nädala pärast} other{käesolev nädal}}} =1{{numeric, select, true{{weeks} nädala pärast} other{järgmine nädal}}} other{{weeks} nädala pärast}}
eu: {weeks, plural, zero{{numeric, select, true{{weeks} aste barru} other{aste honetan}}} one{{numeric, select, true{{weeks} aste barru} other{hurrengo astean}}} other{{weeks} aste barru}}
fa: {weeks, plural, =0{{numeric, select, true{{weeks} هفته بعد} other{این هفته}}} =1{{numeric, select, true{{weeks} هفته بعد} other{هفتهٔ آینده}}} other{{weeks} هفته بعد}}
fi: {weeks, plural, zero{{numeric, select, true{{weeks} viikon päästä} other{tällä viikolla}}} one{{numeric, select, true{{weeks} viikon päästä} other{ensi viikolla}}} other{{weeks} viikon päästä}}
fil: {weeks, plural, =0{{numeric, select, true{sa {weeks} linggo} other{sa linggong ito}}} =1{{numeric, select, true{sa {weeks} linggo} other{susunod na linggo}}} other{sa {weeks} linggo}}
fo: {weeks, plural, zero{{numeric, select, true{um {weeks} vikur} other{hesu viku}}} one{{numeric, select, true{um {weeks} viku} other{næstu viku}}} other{um {weeks} vikur}}
fr: {weeks, plural, zero{{numeric, select, true{dans {weeks} semaines} other{cette semaine}}} one{{numeric, select, true{dans {weeks} semaine} other{la semaine prochaine}}} other{dans {weeks} semaines}}
fur: {count, plural, one{ca di {digits} setemane} other{ca di {digits} setemanis}}
fy: {weeks, plural, =0{{numeric, select, true{Oer {weeks} wiken} other{dizze wike}}} =1{{numeric, select, true{Oer {weeks} wike} other{folgjende wike}}} other{Oer {weeks} wiken}}
ga: {weeks, plural, zero{{numeric, select, true{i gceann {weeks} seachtain} other{an tseachtain seo}}} one{{numeric, select, true{i gceann {weeks} seachtaine} other{an tseachtain seo chugainn}}} two{i gceann {weeks} sheachtain} few{i gceann {weeks} seachtaine} many{i gceann {weeks} seachtaine} other{i gceann {weeks} seachtain}}
gd: {weeks, plural, =0{{numeric, select, true{an ceann {weeks} seachdain} other{an t-seachdain seo}}} =1{{numeric, select, true{an ceann {weeks} seachdain} other{an ath-sheachdain}}} =2{an ceann {weeks} sheachdain} few{an ceann {weeks} seachdainean} other{an ceann {weeks} seachdain}}
gl: {weeks, plural, =0{{numeric, select, true{en {weeks} semanas} other{esta semana}}} =1{{numeric, select, true{en {weeks} semana} other{a próxima semana}}} other{en {weeks} semanas}}
gu: {weeks, plural, zero{{numeric, select, true{{weeks} અઠવાડિયામાં} other{આ અઠવાડિયે}}} one{{numeric, select, true{{weeks} અઠવાડિયામાં} other{આવતા અઠવાડિયે}}} other{{weeks} અઠવાડિયામાં}}
he: {weeks, plural, =0{{numeric, select, true{בעוד {weeks} שבועות} other{השבוע}}} =1{{numeric, select, true{בעוד שבוע} other{השבוע הבא}}} =2{בעוד שבועיים} other{בעוד {weeks} שבועות}}
hi: {weeks, plural, zero{{numeric, select, true{{weeks} सप्ताह में} other{इस सप्ताह}}} one{{numeric, select, true{{weeks} सप्ताह में} other{अगला सप्ताह}}} other{{weeks} सप्ताह में}}
hi_latn: {weeks, plural, =0{{numeric, select, true{{weeks} hafte mein} other{is hafte}}} =1{{numeric, select, true{{weeks} hafte mein} other{agla hafta}}} other{{weeks} hafte mein}}
hr: {weeks, plural, zero{{numeric, select, true{za {weeks} tjedana} other{ovaj tjedan}}} one{{numeric, select, true{za {weeks} tjedan} other{sljedeći tjedan}}} few{za {weeks} tjedna} other{za {weeks} tjedana}}
hu: {weeks, plural, =0{{numeric, select, true{{weeks} hét múlva} other{ez a hét}}} =1{{numeric, select, true{{weeks} hét múlva} other{következő hét}}} other{{weeks} hét múlva}}
hy: {weeks, plural, zero{{numeric, select, true{{weeks} շաբաթից} other{այս շաբաթ}}} one{{numeric, select, true{{weeks} շաբաթից} other{հաջորդ շաբաթ}}} other{{weeks} շաբաթից}}
ia: {weeks, plural, =0{{numeric, select, true{in {weeks} septimanas} other{iste septimana}}} =1{{numeric, select, true{in {weeks} septimana} other{le septimana proxime}}} other{in {weeks} septimanas}}
id: {weeks, plural, zero{{numeric, select, true{dalam {weeks} minggu} other{minggu ini}}} one{{numeric, select, true{dalam {weeks} minggu} other{minggu depan}}} other{dalam {weeks} minggu}}
is: {weeks, plural, zero{{numeric, select, true{eftir {weeks} vikur} other{í þessari viku}}} one{{numeric, select, true{eftir {weeks} viku} other{í næstu viku}}} other{eftir {weeks} vikur}}
it: {weeks, plural, zero{{numeric, select, true{tra {weeks} settimane} other{questa settimana}}} one{{numeric, select, true{tra {weeks} settimana} other{settimana prossima}}} other{tra {weeks} settimane}}
ja: {weeks, plural, =0{{numeric, select, true{{weeks} 週間後} other{今週}}} =1{{numeric, select, true{{weeks} 週間後} other{来週}}} other{{weeks} 週間後}}
ka: {weeks, plural, zero{{numeric, select, true{{weeks} კვირაში} other{ამ კვირაში}}} one{{numeric, select, true{{weeks} კვირაში} other{მომავალ კვირაში}}} other{{weeks} კვირაში}}
kab: {weeks, plural, zero{{numeric, select, true{deg {weeks} n dduṛtat} other{dduṛt -a}}} one{{numeric, select, true{deg {weeks} n dduṛt} other{dduṛt i d-itteddun}}} other{deg {weeks} n dduṛtat}}
kk: {weeks, plural, zero{{numeric, select, true{{weeks} аптадан кейін} other{осы апта}}} one{{numeric, select, true{{weeks} аптадан кейін} other{келесі апта}}} other{{weeks} аптадан кейін}}
km: {count, plural, zero{{numeric, select, true{{digits} សប្ដាហ៍ទៀត} other{សប្ដាហ៍​នេះ}}} one{{numeric, select, true{{digits} សប្ដាហ៍ទៀត} other{សប្ដាហ៍​ក្រោយ}}} other{{digits} សប្ដាហ៍ទៀត}}
kn: {weeks, plural, =0{{numeric, select, true{{weeks} ವಾರಗಳಲ್ಲಿ} other{ಈ ವಾರ}}} =1{{numeric, select, true{{weeks} ವಾರದಲ್ಲಿ} other{ಮುಂದಿನ ವಾರ}}} other{{weeks} ವಾರಗಳಲ್ಲಿ}}
ko: {weeks, plural, zero{{numeric, select, true{{weeks}주 후} other{이번 주}}} one{{numeric, select, true{{weeks}주 후} other{다음 주}}} other{{weeks}주 후}}
ky: {weeks, plural, =0{{numeric, select, true{{weeks} аптадан кийин} other{ушул аптада}}} =1{{numeric, select, true{{weeks} аптадан кийин} other{келерки аптада}}} other{{weeks} аптадан кийин}}
lb: {weeks, plural, zero{{numeric, select, true{a(n) {weeks} Wochen} other{dës Woch}}} one{{numeric, select, true{an {weeks} Woch} other{nächst Woch}}} other{a(n) {weeks} Wochen}}
lo: {weeks, plural, =0{{numeric, select, true{ໃນອີກ {weeks} ອາທິດ} other{ອາທິດນີ້}}} =1{{numeric, select, true{ໃນອີກ {weeks} ອາທິດ} other{ອາທິດໜ້າ}}} other{ໃນອີກ {weeks} ອາທິດ}}
lt: {weeks, plural, =0{{numeric, select, true{po {weeks} savaičių} other{šią savaitę}}} =1{{numeric, select, true{po {weeks} savaitės} other{kitą savaitę}}} many{po {weeks} savaitės} other{po {weeks} savaičių}}
lv: {weeks, plural, =0{{numeric, select, true{pēc {weeks} nedēļām} other{šajā nedēļā}}} =1{{numeric, select, true{pēc {weeks} nedēļas} other{nākamajā nedēļā}}} other{pēc {weeks} nedēļām}}
mai: {weeks, plural, zero{{numeric, select, true{{weeks} सप्ताह मे} other{एहि सप्ताह}}} one{{numeric, select, true{{weeks} सप्ताह मे} other{अगिला सप्ताह}}} other{{weeks} सप्ताह मे}}
mi: {count, plural, zero{{numeric, select, true{+{digits} wiki} other{i tēnei wiki}}} one{{numeric, select, true{+{digits} wiki} other{ā tērā wiki}}} other{+{digits} wiki}}
mk: {weeks, plural, =0{{numeric, select, true{за {weeks} седмици} other{оваа седмица}}} =1{{numeric, select, true{за {weeks} седмица} other{следната седмица}}} other{за {weeks} седмици}}
ml: {weeks, plural, zero{{numeric, select, true{{weeks} ആഴ്ചയിൽ} other{ഈ ആഴ്ച}}} one{{numeric, select, true{{weeks} ആഴ്ചയിൽ} other{അടുത്ത ആഴ്ച}}} other{{weeks} ആഴ്ചയിൽ}}
mn: {weeks, plural, zero{{numeric, select, true{{weeks} долоо хоногийн дараа} other{энэ долоо хоног}}} one{{numeric, select, true{{weeks} долоо хоногийн дараа} other{ирэх долоо хоног}}} other{{weeks} долоо хоногийн дараа}}
mr: {weeks, plural, =0{{numeric, select, true{{weeks} आठवड्यांमध्ये} other{हा आठवडा}}} =1{{numeric, select, true{{weeks} आठवड्यामध्ये} other{पुढील आठवडा}}} other{{weeks} आठवड्यांमध्ये}}
ms: {weeks, plural, zero{{numeric, select, true{dalam {weeks} minggu} other{minggu ini}}} one{{numeric, select, true{dalam {weeks} minggu} other{minggu depan}}} other{dalam {weeks} minggu}}
ms_arab: {count, plural, zero{{numeric, select, true{دالم {digits} ميڠݢو} other{ميڠݢو ني}}} one{{numeric, select, true{دالم {digits} ميڠݢو} other{ميڠݢو ستروسڽ}}} other{دالم {digits} ميڠݢو}}
mt: {weeks, plural, zero{{numeric, select, true{sa {weeks} ġimgħa oħra} other{din il-ġimgħa}}} one{{numeric, select, true{sa ġimgħa oħra} other{il-ġimgħa d-dieħla}}} two{sa ġimagħtejn oħra} few{sa {weeks} ġimgħat oħra} many{sa {weeks}-il ġimgħa oħra} other{sa {weeks} ġimgħa oħra}}
my: {weeks, plural, =0{{numeric, select, true{{weeks} ပတ်အတွင်း} other{ယခု သီတင်းပတ်}}} =1{{numeric, select, true{{weeks} ပတ်အတွင်း} other{လာမည့် သီတင်းပတ်}}} other{{weeks} ပတ်အတွင်း}}
ne: {weeks, plural, =0{{numeric, select, true{{weeks} हप्तामा} other{यो हप्ता}}} =1{{numeric, select, true{{weeks} हप्तामा} other{आउने हप्ता}}} other{{weeks} हप्तामा}}
nl: {weeks, plural, zero{{numeric, select, true{over {weeks} weken} other{deze week}}} one{{numeric, select, true{over {weeks} week} other{volgende week}}} other{over {weeks} weken}}
no: {weeks, plural, zero{{numeric, select, true{om {weeks} uker} other{denne uken}}} one{{numeric, select, true{om {weeks} uke} other{neste uke}}} other{om {weeks} uker}}
or: {weeks, plural, zero{{numeric, select, true{{weeks} ସପ୍ତାହରେ} other{ଏହି ସପ୍ତାହ}}} one{{numeric, select, true{{weeks} ସପ୍ତାହରେ} other{ଆଗାମୀ ସପ୍ତାହ}}} other{{weeks} ସପ୍ତାହରେ}}
pa: {weeks, plural, =0{{numeric, select, true{{weeks} ਹਫ਼ਤਿਆਂ ਵਿੱਚ} other{ਇਹ ਹਫ਼ਤਾ}}} =1{{numeric, select, true{{weeks} ਹਫ਼ਤੇ ਵਿੱਚ} other{ਅਗਲਾ ਹਫ਼ਤਾ}}} other{{weeks} ਹਫ਼ਤਿਆਂ ਵਿੱਚ}}
pl: {count, plural, zero{{numeric, select, true{za {digits} tygodnia} other{w tym tygodniu}}} one{{numeric, select, true{za {digits} tydzień} other{w przyszłym tygodniu}}} few{za {digits} tygodnie} many{za {digits} tygodni} other{za {digits} tygodnia}}
ps: {weeks, plural, =0{{numeric, select, true{په {weeks} اونيو کې} other{دا اونۍ}}} =1{{numeric, select, true{په {weeks} اونۍ کې} other{راتلونکې اونۍ}}} other{په {weeks} اونيو کې}}
pt: {weeks, plural, =0{{numeric, select, true{em {weeks} semanas} other{esta semana}}} =1{{numeric, select, true{em {weeks} semana} other{próxima semana}}} other{em {weeks} semanas}}
ro: {weeks, plural, =0{{numeric, select, true{peste {weeks} de săptămâni} other{săptămâna aceasta}}} =1{{numeric, select, true{peste {weeks} săptămână} other{săptămâna viitoare}}} few{peste {weeks} săptămâni} other{peste {weeks} de săptămâni}}
ru: {weeks, plural, =0{{numeric, select, true{через {weeks} недели} other{на этой неделе}}} =1{{numeric, select, true{через {weeks} неделю} other{на следующей неделе}}} many{через {weeks} недель} other{через {weeks} недели}}
sc: {weeks, plural, =0{{numeric, select, true{intro de {weeks} chidas} other{custa chida}}} =1{{numeric, select, true{intro de {weeks} chida} other{sa chida chi intrat}}} other{intro de {weeks} chidas}}
sd: {weeks, plural, =0{{numeric, select, true{{weeks} هفتن ۾} other{هن هفتي}}} =1{{numeric, select, true{{weeks} هفتن ۾} other{اڳين هفتي}}} other{{weeks} هفتن ۾}}
se: {count, plural, one{{digits} vahku maŋŋilit} other{{digits} vahkku maŋŋilit}}
se_fi: {weeks, plural, =0{{numeric, select, true{{weeks} vahku geahčen} other{dán vahku}}} =1{{numeric, select, true{{weeks} vahku geahčen} other{boahtte vahku}}} other{{weeks} vahku geahčen}}
si: {weeks, plural, =0{{numeric, select, true{සති {weeks}කින්} other{මෙම සතිය}}} =1{{numeric, select, true{සති {weeks}කින්} other{ඊළඟ සතිය}}} other{සති {weeks}කින්}}
sk: {weeks, plural, zero{{numeric, select, true{o {weeks} týždňov} other{tento týždeň}}} one{{numeric, select, true{o {weeks} týždeň} other{budúci týždeň}}} few{o {weeks} týždne} many{o {weeks} týždňa} other{o {weeks} týždňov}}
sl: {weeks, plural, =0{{numeric, select, true{čez {weeks} tednov} other{ta teden}}} =1{{numeric, select, true{čez {weeks} teden} other{naslednji teden}}} =2{čez {weeks} tedna} few{čez {weeks} tedne} other{čez {weeks} tednov}}
sq: {weeks, plural, zero{{numeric, select, true{pas {weeks} javësh} other{këtë javë}}} one{{numeric, select, true{pas {weeks} jave} other{javën e ardhshme}}} other{pas {weeks} javësh}}
sr: {weeks, plural, =0{{numeric, select, true{за {weeks} недеља} other{ове недеље}}} =1{{numeric, select, true{за {weeks} недељу} other{следеће недеље}}} few{за {weeks} недеље} other{за {weeks} недеља}}
sr_latn: {weeks, plural, =0{{numeric, select, true{za {weeks} nedelja} other{ove nedelje}}} =1{{numeric, select, true{za {weeks} nedelju} other{sledeće nedelje}}} few{za {weeks} nedelje} other{za {weeks} nedelja}}
sv: {weeks, plural, =0{{numeric, select, true{om {weeks} veckor} other{denna vecka}}} =1{{numeric, select, true{om {weeks} vecka} other{nästa vecka}}} other{om {weeks} veckor}}
sw: {weeks, plural, =0{{numeric, select, true{baada ya wiki {weeks}} other{wiki hii}}} =1{{numeric, select, true{baada ya wiki {weeks}} other{wiki ijayo}}} other{baada ya wiki {weeks}}}
ta: {weeks, plural, =0{{numeric, select, true{{weeks} வாரங்களில்} other{இந்த வாரம்}}} =1{{numeric, select, true{{weeks} வாரத்தில்} other{அடுத்த வாரம்}}} other{{weeks} வாரங்களில்}}
te: {weeks, plural, zero{{numeric, select, true{{weeks} వారాల్లో} other{ఈ వారం}}} one{{numeric, select, true{{weeks} వారంలో} other{తదుపరి వారం}}} other{{weeks} వారాల్లో}}
tg: {weeks, plural, =0{{numeric, select, true{пас аз {weeks} ҳафта} other{ҳафтаи ҷорӣ}}} =1{{numeric, select, true{пас аз {weeks} ҳафта} other{ҳафтаи оянда}}} other{пас аз {weeks} ҳафта}}
th: {weeks, plural, zero{{numeric, select, true{ในอีก {weeks} สัปดาห์} other{สัปดาห์นี้}}} one{{numeric, select, true{ในอีก {weeks} สัปดาห์} other{สัปดาห์หน้า}}} other{ในอีก {weeks} สัปดาห์}}
tk: {weeks, plural, zero{{numeric, select, true{{weeks} hepdeden} other{şu hepde}}} one{{numeric, select, true{{weeks} hepdeden} other{indiki hepde}}} other{{weeks} hepdeden}}
tr: {weeks, plural, =0{{numeric, select, true{{weeks} hafta sonra} other{bu hafta}}} =1{{numeric, select, true{{weeks} hafta sonra} other{gelecek hafta}}} other{{weeks} hafta sonra}}
tt: {weeks, plural, zero{{numeric, select, true{{weeks} атнадан} other{бу атнада}}} one{{numeric, select, true{{weeks} атнадан} other{киләсе атнада}}} other{{weeks} атнадан}}
ug: {count, plural, zero{{numeric, select, true{{digits} ھەپتىدىن كېيىن} other{بۇ ھەپتە}}} one{{numeric, select, true{{digits} ھەپتىدىن كېيىن} other{كېلەر ھەپتە}}} other{{digits} ھەپتىدىن كېيىن}}
uk: {count, plural, zero{{numeric, select, true{через {digits} тижня} other{цього тижня}}} one{{numeric, select, true{через {digits} тиждень} other{наступного тижня}}} few{через {digits} тижні} many{через {digits} тижнів} other{через {digits} тижня}}
ur: {weeks, plural, =0{{numeric, select, true{{weeks} ہفتے میں} other{اس ہفتہ}}} =1{{numeric, select, true{{weeks} ہفتہ میں} other{اگلے ہفتے}}} other{{weeks} ہفتے میں}}
uz: {weeks, plural, =0{{numeric, select, true{{weeks} haftadan keyin} other{shu hafta}}} =1{{numeric, select, true{{weeks} haftadan keyin} other{keyingi hafta}}} other{{weeks} haftadan keyin}}
uz_cyrl: {weeks, plural, zero{{numeric, select, true{{weeks} ҳафтадан сўнг} other{бу ҳафта}}} one{{numeric, select, true{{weeks} ҳафтадан сўнг} other{кейинги ҳафта}}} other{{weeks} ҳафтадан сўнг}}
vi: {weeks, plural, zero{{numeric, select, true{sau {weeks} tuần nữa} other{tuần này}}} one{{numeric, select, true{sau {weeks} tuần nữa} other{tuần sau}}} other{sau {weeks} tuần nữa}}
zh: {weeks, plural, =0{{numeric, select, true{{weeks}周后} other{本周}}} =1{{numeric, select, true{{weeks}周后} other{下周}}} other{{weeks}周后}}
zh_hant: {weeks, plural, =0{{numeric, select, true{{weeks} 週後} other{本週}}} =1{{numeric, select, true{{weeks} 週後} other{下週}}} other{{weeks} 週後}}
zu: {weeks, plural, =0{{numeric, select, true{emavikini angu-{weeks}} other{leli viki}}} =1{{numeric, select, true{evikini elingu-{weeks}} other{iviki elizayo}}} other{emavikini angu-{weeks}}}
