Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# secondsFuture
source: {count, plural, zero{{numeric, select, true{in {digits} seconds} other{now}}} one{in {digits} second} other{in {digits} seconds}}
af: {seconds, plural, zero{{numeric, select, true{oor {seconds} sekondes} other{nou}}} one{oor {seconds} sekonde} other{oor {seconds} sekondes}}
am: {count, plural, zero{{numeric, select, true{በ{digits} ሰከንዶች ውስጥ} other{አሁን}}} one{በ{digits} ሰከንድ ውስጥ} other{በ{digits} ሰከንዶች ውስጥ}}
ar: {seconds, plural, =0{{numeric, select, true{خلال {seconds} ثانية} other{الآن}}} =1{خلال ثانية واحدة} =2{خلال ثانيتين} few{خلال {seconds} ثوانٍ} other{خلال {seconds} ثانية}}
as: {seconds, plural, zero{{numeric, select, true{{seconds} ছেকেণ্ডত} other{এতিয়া}}} other{{seconds} ছেকেণ্ডত}}
ast: {seconds, plural, =0{{numeric, select, true{en {seconds} segundos} other{agora}}} =1{en {seconds} segundu} other{en {seconds} segundos}}
az: {seconds, plural, zero{{numeric, select, true{{seconds} saniyə ərzində} other{indi}}} other{{seconds} saniyə ərzində}}
be: {seconds, plural, =0{{numeric, select, true{праз {seconds} секунды} other{цяпер}}} =1{праз {seconds} секунду} many{праз {seconds} секунд} other{праз {seconds} секунды}}
bg: {seconds, plural, =0{{numeric, select, true{след {seconds} секунди} other{сега}}} =1{след {seconds} секунда} other{след {seconds} секунди}}
bn: {seconds, plural, zero{{numeric, select, true{{seconds} সেকেন্ডে} other{এখন}}} other{{seconds} সেকেন্ডে}}
br: {seconds, plural, =0{{numeric, select, true{a-benn {seconds} eilenn} other{bremañ}}} many{a-benn {seconds} a eilennoù} other{a-benn {seconds} eilenn}}
bs: {seconds, plural, =0{{numeric, select, true{za {seconds} sekundi} other{sada}}} =1{za {seconds} sekundu} few{za {seconds} sekunde} other{za {seconds} sekundi}}
bs_cyrl: {count, plural, zero{{numeric, select, true{за {digits} секунди} other{сада}}} one{за {digits} секунд} few{за {digits} секунде} other{за {digits} секунди}}
ca: {seconds, plural, =0{{numeric, select, true{d’aquí a {seconds} segons} other{ara}}} =1{d’aquí a {seconds} segon} other{d’aquí a {seconds} segons}}
cs: {seconds, plural, =0{{numeric, select, true{za {seconds} sekund} other{nyní}}} =1{za {seconds} sekundu} few{za {seconds} sekundy} many{za {seconds} sekundy} other{za {seconds} sekund}}
cy: {seconds, plural, =0{{numeric, select, true{ymhen {seconds} eiliad} other{nawr}}} other{ymhen {seconds} eiliad}}
da: {seconds, plural, =0{{numeric, select, true{om {seconds} sekunder} other{nu}}} =1{om {seconds} sekund} other{om {seconds} sekunder}}
de: {seconds, plural, =0{{numeric, select, true{in {seconds} Sekunden} other{jetzt}}} =1{in {seconds} Sekunde} other{in {seconds} Sekunden}}
dz: སྐར་ཆ་ {seconds} ནང་
el: {seconds, plural, =0{{numeric, select, true{σε {seconds} δευτερόλεπτα} other{τώρα}}} =1{σε {seconds} δευτερόλεπτο} other{σε {seconds} δευτερόλεπτα}}
eo: {seconds, plural, =0{{numeric, select, true{post {seconds} sekundoj} other{nun}}} =1{post {seconds} sekundo} other{post {seconds} sekundoj}}
es: {seconds, plural, zero{{numeric, select, true{dentro de {seconds} segundos} other{ahora}}} one{dentro de {seconds} segundo} other{dentro de {seconds} segundos}}
et: {seconds, plural, =0{{numeric, select, true{{seconds} sekundi pärast} other{nüüd}}} other{{seconds} sekundi pärast}}
eu: {seconds, plural, zero{{numeric, select, true{{seconds} segundo barru} other{orain}}} other{{seconds} segundo barru}}
fa: {seconds, plural, =0{{numeric, select, true{{seconds} ثانیه بعد} other{اکنون}}} other{{seconds} ثانیه بعد}}
fi: {seconds, plural, zero{{numeric, select, true{{seconds} sekunnin päästä} other{nyt}}} other{{seconds} sekunnin päästä}}
fil: {seconds, plural, =0{{numeric, select, true{sa {seconds} segundo} other{ngayon}}} other{sa {seconds} segundo}}
fo: {seconds, plural, zero{{numeric, select, true{um {seconds} sekund} other{nú}}} other{um {seconds} sekund}}
fr: {seconds, plural, zero{{numeric, select, true{dans {seconds} secondes} other{maintenant}}} one{dans {seconds} seconde} other{dans {seconds} secondes}}
fur: {count, plural, one{ca di {digits} secont} other{ca di {digits} seconts}}
fy: {seconds, plural, =0{{numeric, select, true{Oer {seconds} sekonden} other{nu}}} =1{Oer {seconds} sekonde} other{Oer {seconds} sekonden}}
ga: {seconds, plural, zero{{numeric, select, true{i gceann {seconds} soicind} other{anois}}} two{i gceann {seconds} shoicind} few{i gceann {seconds} shoicind} other{i gceann {seconds} soicind}}
gd: {seconds, plural, =0{{numeric, select, true{an ceann {seconds} diog} other{an-dràsta}}} =2{an ceann {seconds} dhiog} few{an ceann {seconds} diogan} other{an ceann {seconds} diog}}
gl: {seconds, plural, =0{{numeric, select, true{en {seconds} segundos} other{agora}}} =1{en {seconds} segundo} other{en {seconds} segundos}}
gu: {seconds, plural, zero{{numeric, select, true{{seconds} સેકંડમાં} other{હમણાં}}} other{{seconds} સેકંડમાં}}
he: {seconds, plural, =0{{numeric, select, true{בעוד {seconds} שניות} other{עכשיו}}} =1{בעוד שנייה} =2{בעוד שתי שניות} other{בעוד {seconds} שניות}}
hi: {seconds, plural, zero{{numeric, select, true{{seconds} सेकंड में} other{अब}}} other{{seconds} सेकंड में}}
hi_latn: {seconds, plural, =0{{numeric, select, true{{seconds} second mein} other{abhi}}} other{{seconds} second mein}}
hr: {seconds, plural, zero{{numeric, select, true{za {seconds} sekundi} other{sad}}} one{za {seconds} sekundu} few{za {seconds} sekunde} other{za {seconds} sekundi}}
hu: {seconds, plural, =0{{numeric, select, true{{seconds} másodperc múlva} other{most}}} other{{seconds} másodperc múlva}}
hy: {seconds, plural, zero{{numeric, select, true{{seconds} վայրկյանից} other{հիմա}}} other{{seconds} վայրկյանից}}
ia: {seconds, plural, =0{{numeric, select, true{in {seconds} secundas} other{ora}}} =1{in {seconds} secunda} other{in {seconds} secundas}}
id: {seconds, plural, zero{{numeric, select, true{dalam {seconds} detik} other{sekarang}}} other{dalam {seconds} detik}}
is: {seconds, plural, zero{{numeric, select, true{eftir {seconds} sekúndur} other{núna}}} one{eftir {seconds} sekúndu} other{eftir {seconds} sekúndur}}
it: {seconds, plural, zero{{numeric, select, true{tra {seconds} secondi} other{ora}}} one{tra {seconds} secondo} other{tra {seconds} secondi}}
ja: {seconds, plural, =0{{numeric, select, true{{seconds} 秒後} other{今}}} other{{seconds} 秒後}}
ka: {seconds, plural, zero{{numeric, select, true{{seconds} წამში} other{ახლა}}} other{{seconds} წამში}}
kab: {seconds, plural, zero{{numeric, select, true{deg {seconds} n tasinin} other{tura}}} one{deg {seconds} n tasint} other{deg {seconds} n tasinin}}
kk: {seconds, plural, zero{{numeric, select, true{{seconds} секундтан кейін} other{қазір}}} other{{seconds} секундтан кейін}}
km: {count, plural, zero{{numeric, select, true{{digits} វិនាទីទៀត} other{ឥឡូវ}}} other{{digits} វិនាទីទៀត}}
kn: {seconds, plural, =0{{numeric, select, true{{seconds} ಸೆಕೆಂಡ್‌ಗಳಲ್ಲಿ} other{ಈಗ}}} =1{{seconds} ಸೆಕೆಂಡ್‌ನಲ್ಲಿ} other{{seconds} ಸೆಕೆಂಡ್‌ಗಳಲ್ಲಿ}}
ko: {seconds, plural, zero{{numeric, select, true{{seconds}초 후} other{지금}}} other{{seconds}초 후}}
ky: {seconds, plural, =0{{numeric, select, true{{seconds} секунддан кийин} other{азыр}}} other{{seconds} секунддан кийин}}
lb: {seconds, plural, one{an {seconds} Sekonn} other{a(n) {seconds} Sekonnen}}
lo: {seconds, plural, =0{{numeric, select, true{ໃນອີກ {seconds} ວິນາທີ} other{ຕອນນີ້}}} other{ໃນອີກ {seconds} ວິນາທີ}}
lt: {seconds, plural, =0{{numeric, select, true{po {seconds} sekundžių} other{dabar}}} =1{po {seconds} sekundės} many{po {seconds} sekundės} other{po {seconds} sekundžių}}
lv: {seconds, plural, =0{{numeric, select, true{pēc {seconds} sekundēm} other{tagad}}} =1{pēc {seconds} sekundes} other{pēc {seconds} sekundēm}}
mai: {seconds, plural, zero{{numeric, select, true{{seconds} सेकेंड मे} other{एहि समय}}} other{{seconds} सेकेंड मे}}
mi: {count, plural, zero{{numeric, select, true{+{digits} hēkona} other{ināianei}}} other{+{digits} hēkona}}
mk: {seconds, plural, =0{{numeric, select, true{за {seconds} секунди} other{сега}}} =1{за {seconds} секунда} other{за {seconds} секунди}}
ml: {seconds, plural, zero{{numeric, select, true{{seconds} സെക്കൻഡിൽ} other{ഇപ്പോൾ}}} other{{seconds} സെക്കൻഡിൽ}}
mn: {seconds, plural, zero{{numeric, select, true{{seconds} секундын дараа} other{одоо}}} other{{seconds} секундын дараа}}
mr: {seconds, plural, =0{{numeric, select, true{{seconds} सेकंदांमध्ये} other{आत्ता}}} =1{{seconds} सेकंदामध्ये} other{{seconds} सेकंदांमध्ये}}
ms: {seconds, plural, zero{{numeric, select, true{dalam {seconds} saat} other{sekarang}}} other{dalam {seconds} saat}}
ms_arab: دالم {digits} ساعت
mt: {seconds, plural, zero{{numeric, select, true{sa {seconds} sekonda oħra} other{issa}}} one{sa sekonda oħra} two{sa {seconds} sekondi oħra} few{sa {seconds} sekondi oħra} many{sa {seconds}-il sekonda oħra} other{sa {seconds} sekonda oħra}}
my: {seconds, plural, =0{{numeric, select, true{{seconds} စက္ကန့်အတွင်း} other{ယခု}}} other{{seconds} စက္ကန့်အတွင်း}}
ne: {seconds, plural, =0{{numeric, select, true{{seconds} सेकेन्डमा} other{अहिले}}} other{{seconds} सेकेन्डमा}}
nl: {seconds, plural, zero{{numeric, select, true{over {seconds} seconden} other{nu}}} one{over {seconds} seconde} other{over {seconds} seconden}}
no: {seconds, plural, zero{{numeric, select, true{om {seconds} sekunder} other{nå}}} one{om {seconds} sekund} other{om {seconds} sekunder}}
or: {seconds, plural, zero{{numeric, select, true{{seconds} ସେକେଣ୍ଡରେ} other{ବର୍ତ୍ତମାନ}}} other{{seconds} ସେକେଣ୍ଡରେ}}
pa: {seconds, plural, =0{{numeric, select, true{{seconds} ਸਕਿੰਟਾਂ ਵਿੱਚ} other{ਹੁਣ}}} =1{{seconds} ਸਕਿੰਟ ਵਿੱਚ} other{{seconds} ਸਕਿੰਟਾਂ ਵਿੱਚ}}
pl: {count, plural, zero{{numeric, select, true{za {digits} sekundy} other{teraz}}} one{za {digits} sekundę} many{za {digits} sekund} other{za {digits} sekundy}}
ps: {seconds, plural, =0{{numeric, select, true{په {seconds} ثانيو کې} other{اوس}}} =1{په {seconds} ثانيه کې} other{په {seconds} ثانيو کې}}
pt: {seconds, plural, =0{{numeric, select, true{em {seconds} segundos} other{agora}}} =1{em {seconds} segundo} other{em {seconds} segundos}}
ro: {seconds, plural, =0{{numeric, select, true{peste {seconds} de secunde} other{acum}}} =1{peste {seconds} secundă} few{peste {seconds} secunde} other{peste {seconds} de secunde}}
ru: {seconds, plural, =0{{numeric, select, true{через {seconds} секунды} other{сейчас}}} =1{через {seconds} секунду} many{через {seconds} секунд} other{через {seconds} секунды}}
sc: {seconds, plural, =0{{numeric, select, true{intro de {seconds} segundos} other{como}}} =1{intro de {seconds} segundu} other{intro de {seconds} segundos}}
sd: {seconds, plural, =0{{numeric, select, true{{seconds} سيڪنڊن ۾} other{هاڻي}}} other{{seconds} سيڪنڊن ۾}}
se: {count, plural, zero{{numeric, select, true{{digits} sekundda maŋŋilit} other{na}}} one{{digits} sekunda maŋŋilit} other{{digits} sekundda maŋŋilit}}
se_fi: {seconds, plural, =0{{numeric, select, true{{seconds} sekundda siste} other{dál}}} other{{seconds} sekundda siste}}
si: {seconds, plural, =0{{numeric, select, true{තත්පර {seconds}කින්} other{දැන්}}} other{තත්පර {seconds}කින්}}
sk: {seconds, plural, zero{{numeric, select, true{o {seconds} sekúnd} other{teraz}}} one{o {seconds} sekundu} few{o {seconds} sekundy} many{o {seconds} sekundy} other{o {seconds} sekúnd}}
sl: {seconds, plural, =0{{numeric, select, true{čez {seconds} sekund} other{zdaj}}} =1{čez {seconds} sekundo} =2{čez {seconds} sekundi} few{čez {seconds} sekunde} other{čez {seconds} sekund}}
sq: {seconds, plural, zero{{numeric, select, true{pas {seconds} sekondash} other{tani}}} one{pas {seconds} sekonde} other{pas {seconds} sekondash}}
sr: {seconds, plural, =0{{numeric, select, true{за {seconds} секунди} other{сада}}} =1{за {seconds} секунду} few{за {seconds} секунде} other{за {seconds} секунди}}
sr_latn: {seconds, plural, =0{{numeric, select, true{za {seconds} sekundi} other{sada}}} =1{za {seconds} sekundu} few{za {seconds} sekunde} other{za {seconds} sekundi}}
sv: {seconds, plural, =0{{numeric, select, true{om {seconds} sekunder} other{nu}}} =1{om {seconds} sekund} other{om {seconds} sekunder}}
sw: {seconds, plural, =0{{numeric, select, true{baada ya sekunde {seconds}} other{sasa hivi}}} other{baada ya sekunde {seconds}}}
ta: {seconds, plural, =0{{numeric, select, true{{seconds} விநாடிகளில்} other{இப்போது}}} =1{{seconds} விநாடியில்} other{{seconds} விநாடிகளில்}}
te: {seconds, plural, zero{{numeric, select, true{{seconds} సెకన్లలో} other{ప్రస్తుతం}}} one{{seconds} సెకనులో} other{{seconds} సెకన్లలో}}
tg: {seconds, plural, =0{{numeric, select, true{пас аз {seconds} сония} other{ҳозир}}} other{пас аз {seconds} сония}}
th: {seconds, plural, zero{{numeric, select, true{ในอีก {seconds} วินาที} other{ขณะนี้}}} other{ในอีก {seconds} วินาที}}
tk: {seconds, plural, zero{{numeric, select, true{{seconds} sekuntdan} other{häzir}}} other{{seconds} sekuntdan}}
tr: {seconds, plural, =0{{numeric, select, true{{seconds} saniye sonra} other{şimdi}}} other{{seconds} saniye sonra}}
tt: {seconds, plural, zero{{numeric, select, true{{seconds} секундтан} other{хәзер}}} other{{seconds} секундтан}}
ug: {digits} سېكۇنتتىن كېيىن
uk: {count, plural, zero{{numeric, select, true{через {digits} секунди} other{зараз}}} one{через {digits} секунду} many{через {digits} секунд} other{через {digits} секунди}}
ur: {seconds, plural, =0{{numeric, select, true{{seconds} سیکنڈ میں} other{اب}}} other{{seconds} سیکنڈ میں}}
uz: {seconds, plural, =0{{numeric, select, true{{seconds} soniyadan keyin} other{hozir}}} other{{seconds} soniyadan keyin}}
uz_cyrl: {seconds, plural, zero{{numeric, select, true{{seconds} сониядан сўнг} other{ҳозир}}} other{{seconds} сониядан сўнг}}
vi: {seconds, plural, zero{{numeric, select, true{sau {seconds} giây nữa} other{bây giờ}}} other{sau {seconds} giây nữa}}
zh: {seconds, plural, =0{{numeric, select, true{{seconds}秒钟后} other{现在}}} other{{seconds}秒钟后}}
zh_hant: {seconds, plural, =0{{numeric, select, true{{seconds} 秒後} other{現在}}} other{{seconds} 秒後}}
zu: {seconds, plural, =0{{numeric, select, true{kumasekhondi angu-{seconds} ezayo} other{manje}}} =1{kusekhondi elingu-{seconds} elizayo} other{kumasekhondi angu-{seconds} ezayo}}
