Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# monthsPast
source: {count, plural, zero{{numeric, select, true{{digits} months ago} other{this month}}} one{{numeric, select, true{{digits} month ago} other{last month}}} other{{digits} months ago}}
af: {months, plural, zero{{numeric, select, true{{months} maande gelede} other{vandeesmaand}}} one{{numeric, select, true{{months} maand gelede} other{verlede maand}}} other{{months} maande gelede}}
am: {count, plural, zero{{numeric, select, true{ከ{digits} ወራት በፊት} other{በዚህ ወር}}} one{{numeric, select, true{ከ{digits} ወር በፊት} other{ያለፈው ወር}}} other{ከ{digits} ወራት በፊት}}
ar: {months, plural, =0{{numeric, select, true{قبل {months} شهر} other{هذا الشهر}}} =1{{numeric, select, true{قبل شهر واحد} other{الشهر الماضي}}} =2{قبل شهرين} few{قبل {months} أشهر} many{قبل {months} شهرًا} other{قبل {months} شهر}}
as: {months, plural, zero{{numeric, select, true{{months} মাহ পূৰ্বে} other{এই মাহ}}} one{{numeric, select, true{{months} মাহ পূৰ্বে} other{যোৱা মাহ}}} other{{months} মাহ পূৰ্বে}}
ast: {months, plural, =0{{numeric, select, true{hai {months} meses} other{esti mes}}} =1{{numeric, select, true{hai {months} mes} other{el mes pasáu}}} other{hai {months} meses}}
az: {months, plural, zero{{numeric, select, true{{months} ay öncə} other{bu ay}}} one{{numeric, select, true{{months} ay öncə} other{keçən ay}}} other{{months} ay öncə}}
be: {months, plural, =0{{numeric, select, true{{months} месяца таму} other{у гэтым месяцы}}} =1{{numeric, select, true{{months} месяц таму} other{у мінулым месяцы}}} few{{months} месяцы таму} many{{months} месяцаў таму} other{{months} месяца таму}}
bg: {months, plural, =0{{numeric, select, true{преди {months} месеца} other{този месец}}} =1{{numeric, select, true{преди {months} месец} other{предходен месец}}} other{преди {months} месеца}}
bn: {months, plural, zero{{numeric, select, true{{months} মাস আগে} other{এই মাস}}} one{{numeric, select, true{{months} মাস আগে} other{গত মাস}}} other{{months} মাস আগে}}
br: {months, plural, =0{{numeric, select, true{{months} miz zo} other{ar miz-mañ}}} =1{{numeric, select, true{{months} miz zo} other{ar miz diaraok}}} =2{{months} viz zo} many{{months} a vizioù zo} other{{months} miz zo}}
bs: {months, plural, =0{{numeric, select, true{prije {months} mjeseci} other{ovaj mjesec}}} =1{{numeric, select, true{prije {months} mjesec} other{prošli mjesec}}} few{prije {months} mjeseca} other{prije {months} mjeseci}}
bs_cyrl: {count, plural, zero{{numeric, select, true{прије {digits} мјесеци} other{овог мјесеца}}} one{{numeric, select, true{прије {digits} мјесец} other{прошлог мјесеца}}} few{прије {digits} мјесеца} other{прије {digits} мјесеци}}
ca: {months, plural, =0{{numeric, select, true{fa {months} mesos} other{aquest mes}}} =1{{numeric, select, true{fa {months} mes} other{el mes passat}}} other{fa {months} mesos}}
cs: {months, plural, =0{{numeric, select, true{před {months} měsíci} other{tento měsíc}}} =1{{numeric, select, true{před {months} měsícem} other{minulý měsíc}}} many{před {months} měsíce} other{před {months} měsíci}}
cy: {months, plural, =0{{numeric, select, true{{months} mis yn ôl} other{y mis hwn}}} =1{{numeric, select, true{{months} mis yn ôl} other{mis diwethaf}}} =2{{months} fis yn ôl} other{{months} mis yn ôl}}
da: {months, plural, =0{{numeric, select, true{for {months} måneder siden} other{denne måned}}} =1{{numeric, select, true{for {months} måned siden} other{sidste måned}}} other{for {months} måneder siden}}
de: {months, plural, =0{{numeric, select, true{vor {months} Monaten} other{diesen Monat}}} =1{{numeric, select, true{vor {months} Monat} other{letzten Monat}}} other{vor {months} Monaten}}
dz: ཟླཝ་ {months} ཧེ་མ་
el: {months, plural, =0{{numeric, select, true{πριν από {months} μήνες} other{τρέχων μήνας}}} =1{{numeric, select, true{πριν από {months} μήνα} other{προηγούμενος μήνας}}} other{πριν από {months} μήνες}}
eo: {months, plural, =0{{numeric, select, true{antaŭ {months} monatoj} other{nuna monato}}} =1{{numeric, select, true{antaŭ {months} monato} other{pasinta monato}}} other{antaŭ {months} monatoj}}
es: {months, plural, zero{{numeric, select, true{hace {months} meses} other{este mes}}} one{{numeric, select, true{hace {months} mes} other{el mes pasado}}} other{hace {months} meses}}
et: {months, plural, =0{{numeric, select, true{{months} kuu eest} other{käesolev kuu}}} =1{{numeric, select, true{{months} kuu eest} other{eelmine kuu}}} other{{months} kuu eest}}
eu: {months, plural, zero{{numeric, select, true{Duela {months} hilabete} other{hilabete honetan}}} one{{numeric, select, true{Duela {months} hilabete} other{aurreko hilabetean}}} other{Duela {months} hilabete}}
fa: {months, plural, =0{{numeric, select, true{{months} ماه پیش} other{این ماه}}} =1{{numeric, select, true{{months} ماه پیش} other{ماه گذشته}}} other{{months} ماه پیش}}
fi: {months, plural, zero{{numeric, select, true{{months} kuukautta sitten} other{tässä kuussa}}} one{{numeric, select, true{{months} kuukausi sitten} other{viime kuussa}}} other{{months} kuukautta sitten}}
fil: {months, plural, =0{{numeric, select, true{{months} buwan ang nakalipas} other{ngayong buwan}}} =1{{numeric, select, true{{months} buwan ang nakalipas} other{nakaraang buwan}}} other{{months} buwan ang nakalipas}}
fo: {months, plural, zero{{numeric, select, true{{months} mánaðir síðan} other{henda mánaðin}}} one{{numeric, select, true{{months} mánað síðan} other{seinasta mánað}}} other{{months} mánaðir síðan}}
fr: {months, plural, zero{{numeric, select, true{il y a {months} mois} other{ce mois-ci}}} one{{numeric, select, true{il y a {months} mois} other{le mois dernier}}} other{il y a {months} mois}}
fur: {digits} mês indaûr
fy: {months, plural, =0{{numeric, select, true{{months} moannen lyn} other{dizze moanne}}} =1{{numeric, select, true{{months} moanne lyn} other{foarige moanne}}} other{{months} moannen lyn}}
ga: {months, plural, zero{{numeric, select, true{{months} mí ó shin} other{an mhí seo}}} one{{numeric, select, true{{months} mhí ó shin} other{an mhí seo caite}}} two{{months} mhí ó shin} few{{months} mhí ó shin} other{{months} mí ó shin}}
gd: {months, plural, =0{{numeric, select, true{{months} mìos air ais} other{am mìos seo}}} =1{{numeric, select, true{{months} mhìos air ais} other{am mìos seo chaidh}}} =2{{months} mhìos air ais} few{{months} mìosan air ais} other{{months} mìos air ais}}
gl: {months, plural, =0{{numeric, select, true{hai {months} meses} other{este mes}}} =1{{numeric, select, true{hai {months} mes} other{o mes pasado}}} other{hai {months} meses}}
gu: {months, plural, zero{{numeric, select, true{{months} મહિના પહેલાં} other{આ મહિને}}} one{{numeric, select, true{{months} મહિના પહેલાં} other{ગયા મહિને}}} other{{months} મહિના પહેલાં}}
he: {months, plural, =0{{numeric, select, true{לפני {months} חודשים} other{החודש}}} =1{{numeric, select, true{לפני חודש} other{החודש שעבר}}} =2{לפני חודשיים} other{לפני {months} חודשים}}
hi: {months, plural, zero{{numeric, select, true{{months} माह पहले} other{इस माह}}} one{{numeric, select, true{{months} माह पहले} other{पिछला माह}}} other{{months} माह पहले}}
hi_latn: {months, plural, =0{{numeric, select, true{{months} maheene pahle} other{yah maheena}}} =1{{numeric, select, true{{months} maheene pahle} other{pichhla maheena}}} other{{months} maheene pahle}}
hr: {months, plural, zero{{numeric, select, true{prije {months} mjeseci} other{ovaj mjesec}}} one{{numeric, select, true{prije {months} mjesec} other{prošli mjesec}}} few{prije {months} mjeseca} other{prije {months} mjeseci}}
hu: {months, plural, =0{{numeric, select, true{{months} hónappal ezelőtt} other{ez a hónap}}} =1{{numeric, select, true{{months} hónappal ezelőtt} other{előző hónap}}} other{{months} hónappal ezelőtt}}
hy: {months, plural, zero{{numeric, select, true{{months} ամիս առաջ} other{այս ամիս}}} one{{numeric, select, true{{months} ամիս առաջ} other{նախորդ ամիս}}} other{{months} ամիս առաջ}}
ia: {months, plural, =0{{numeric, select, true{{months} menses retro} other{iste mense}}} =1{{numeric, select, true{{months} mense retro} other{le mense passate}}} other{{months} menses retro}}
id: {months, plural, zero{{numeric, select, true{{months} bulan yang lalu} other{bulan ini}}} one{{numeric, select, true{{months} bulan yang lalu} other{bulan lalu}}} other{{months} bulan yang lalu}}
is: {months, plural, zero{{numeric, select, true{fyrir {months} mánuðum} other{í þessum mánuði}}} one{{numeric, select, true{fyrir {months} mánuði} other{í síðasta mánuði}}} other{fyrir {months} mánuðum}}
it: {months, plural, zero{{numeric, select, true{{months} mesi fa} other{questo mese}}} one{{numeric, select, true{{months} mese fa} other{mese scorso}}} other{{months} mesi fa}}
ja: {months, plural, =0{{numeric, select, true{{months} か月前} other{今月}}} =1{{numeric, select, true{{months} か月前} other{先月}}} other{{months} か月前}}
ka: {months, plural, zero{{numeric, select, true{{months} თვის წინ} other{ამ თვეში}}} one{{numeric, select, true{{months} თვის წინ} other{გასულ თვეს}}} other{{months} თვის წინ}}
kab: {months, plural, zero{{numeric, select, true{{months} n wayyuren aya} other{ayyur-a}}} one{{numeric, select, true{{months} n wayyur aya} other{ayyur izrin}}} other{{months} n wayyuren aya}}
kk: {months, plural, zero{{numeric, select, true{{months} ай бұрын} other{осы ай}}} one{{numeric, select, true{{months} ай бұрын} other{өткен ай}}} other{{months} ай бұрын}}
km: {count, plural, zero{{numeric, select, true{{digits} ខែមុន} other{ខែ​នេះ}}} one{{numeric, select, true{{digits} ខែមុន} other{ខែ​មុន}}} other{{digits} ខែមុន}}
kn: {months, plural, =0{{numeric, select, true{{months} ತಿಂಗಳುಗಳ ಹಿಂದೆ} other{ಈ ತಿಂಗಳು}}} =1{{numeric, select, true{{months} ತಿಂಗಳ ಹಿಂದೆ} other{ಕಳೆದ ತಿಂಗಳು}}} other{{months} ತಿಂಗಳುಗಳ ಹಿಂದೆ}}
ko: {months, plural, zero{{numeric, select, true{{months}개월 전} other{이번 달}}} one{{numeric, select, true{{months}개월 전} other{지난달}}} other{{months}개월 전}}
ky: {months, plural, =0{{numeric, select, true{{months} ай мурун} other{бул айда}}} =1{{numeric, select, true{{months} ай мурун} other{өткөн айда}}} other{{months} ай мурун}}
lb: {months, plural, zero{{numeric, select, true{viru(n) {months} Méint} other{dëse Mount}}} one{{numeric, select, true{virun {months} Mount} other{leschte Mount}}} other{viru(n) {months} Méint}}
lo: {months, plural, =0{{numeric, select, true{{months} ເດືອນກ່ອນ} other{ເດືອນນີ້}}} =1{{numeric, select, true{{months} ເດືອນກ່ອນ} other{ເດືອນແລ້ວ}}} other{{months} ເດືອນກ່ອນ}}
lt: {months, plural, =0{{numeric, select, true{prieš {months} mėnesių} other{šį mėnesį}}} =1{{numeric, select, true{prieš {months} mėnesį} other{praėjusį mėnesį}}} few{prieš {months} mėnesius} many{prieš {months} mėnesio} other{prieš {months} mėnesių}}
lv: {months, plural, =0{{numeric, select, true{pirms {months} mēnešiem} other{šajā mēnesī}}} =1{{numeric, select, true{pirms {months} mēneša} other{pagājušajā mēnesī}}} other{pirms {months} mēnešiem}}
mai: {months, plural, zero{{numeric, select, true{{months} माह पहिले} other{एहि माह}}} one{{numeric, select, true{{months} माह पहिले} other{बीतल माह}}} other{{months} माह पहिले}}
mi: {count, plural, zero{{numeric, select, true{-{digits} marama i mua} other{i tēnei marama}}} one{{numeric, select, true{-{digits} marama i mua} other{i tērā marama}}} other{-{digits} marama i mua}}
mk: {months, plural, =0{{numeric, select, true{пред {months} месеци} other{овој месец}}} =1{{numeric, select, true{пред {months} месец} other{минатиот месец}}} other{пред {months} месеци}}
ml: {months, plural, zero{{numeric, select, true{{months} മാസം മുമ്പ്} other{ഈ മാസം}}} one{{numeric, select, true{{months} മാസം മുമ്പ്} other{കഴിഞ്ഞ മാസം}}} other{{months} മാസം മുമ്പ്}}
mn: {months, plural, zero{{numeric, select, true{{months} сарын өмнө} other{энэ сар}}} one{{numeric, select, true{{months} сарын өмнө} other{өнгөрсөн сар}}} other{{months} сарын өмнө}}
mr: {months, plural, =0{{numeric, select, true{{months} महिन्यांपूर्वी} other{हा महिना}}} =1{{numeric, select, true{{months} महिन्यापूर्वी} other{मागील महिना}}} other{{months} महिन्यांपूर्वी}}
ms: {months, plural, zero{{numeric, select, true{{months} bulan lalu} other{bulan ini}}} one{{numeric, select, true{{months} bulan lalu} other{bulan lalu}}} other{{months} bulan lalu}}
ms_arab: {count, plural, zero{{numeric, select, true{{digits} بولن لالو} other{بولن ني}}} one{{numeric, select, true{{digits} بولن لالو} other{بولن لالو}}} other{{digits} بولن لالو}}
mt: {months, plural, zero{{numeric, select, true{{months} xahar ilu} other{dan ix-xahar}}} one{{numeric, select, true{xahar ilu} other{ix-xahar li għadda}}} two{xahrejn ilu} few{{months} xhur ilu} many{{months}-il xahar ilu} other{{months} xahar ilu}}
my: {months, plural, =0{{numeric, select, true{ပြီးခဲ့သည့် {months} လ} other{ယခုလ}}} =1{{numeric, select, true{ပြီးခဲ့သည့် {months} လ} other{ပြီးခဲ့သည့်လ}}} other{ပြီးခဲ့သည့် {months} လ}}
ne: {months, plural, =0{{numeric, select, true{{months} महिना पहिले} other{यो महिना}}} =1{{numeric, select, true{{months} महिना पहिले} other{गत महिना}}} other{{months} महिना पहिले}}
nl: {months, plural, zero{{numeric, select, true{{months} maanden geleden} other{deze maand}}} one{{numeric, select, true{{months} maand geleden} other{vorige maand}}} other{{months} maanden geleden}}
no: {months, plural, zero{{numeric, select, true{for {months} måneder siden} other{denne måneden}}} one{{numeric, select, true{for {months} måned siden} other{forrige måned}}} other{for {months} måneder siden}}
or: {months, plural, zero{{numeric, select, true{{months} ମାସ ପୂର୍ବେ} other{ଏହି ମାସ}}} one{{numeric, select, true{{months} ମାସ ପୂର୍ବେ} other{ଗତ ମାସ}}} other{{months} ମାସ ପୂର୍ବେ}}
pa: {months, plural, =0{{numeric, select, true{{months} ਮਹੀਨੇ ਪਹਿਲਾਂ} other{ਇਹ ਮਹੀਨਾ}}} =1{{numeric, select, true{{months} ਮਹੀਨਾ ਪਹਿਲਾਂ} other{ਪਿਛਲਾ ਮਹੀਨਾ}}} other{{months} ਮਹੀਨੇ ਪਹਿਲਾਂ}}
pl: {count, plural, zero{{numeric, select, true{{digits} miesiąca temu} other{w tym miesiącu}}} one{{numeric, select, true{{digits} miesiąc temu} other{w zeszłym miesiącu}}} few{{digits} miesiące temu} many{{digits} miesięcy temu} other{{digits} miesiąca temu}}
ps: {months, plural, =0{{numeric, select, true{{months} مياشتې مخکې} other{دا مياشت}}} =1{{numeric, select, true{{months} مياشت مخکې} other{تېره مياشت}}} other{{months} مياشتې مخکې}}
pt: {months, plural, =0{{numeric, select, true{há {months} meses} other{este mês}}} =1{{numeric, select, true{há {months} mês} other{mês passado}}} other{há {months} meses}}
ro: {months, plural, =0{{numeric, select, true{acum {months} de luni} other{luna aceasta}}} =1{{numeric, select, true{acum {months} lună} other{luna trecută}}} few{acum {months} luni} other{acum {months} de luni}}
ru: {months, plural, =0{{numeric, select, true{{months} месяца назад} other{в этом месяце}}} =1{{numeric, select, true{{months} месяц назад} other{в прошлом месяце}}} many{{months} месяцев назад} other{{months} месяца назад}}
sc: {months, plural, =0{{numeric, select, true{{months} meses a como} other{custu mese}}} =1{{numeric, select, true{{months} mese a como} other{su mese coladu}}} other{{months} meses a como}}
sd: {months, plural, =0{{numeric, select, true{{months} مهينا پهرين} other{هن مهيني}}} =1{{numeric, select, true{{months} مهينا پهرين} other{پوئين مهيني}}} other{{months} مهينا پهرين}}
se: {digits} mánotbadji árat
se_fi: {months, plural, =0{{numeric, select, true{{months} mánu dás ovdal} other{dán mánu}}} =1{{numeric, select, true{{months} mánnu dás ovdal} other{mannan mánu}}} other{{months} mánu dás ovdal}}
si: {months, plural, =0{{numeric, select, true{මාස {months}කට පෙර} other{මෙම මාසය}}} =1{{numeric, select, true{මාස {months}කට පෙර} other{පසුගිය මාසය}}} other{මාස {months}කට පෙර}}
sk: {months, plural, zero{{numeric, select, true{pred {months} mesiacmi} other{tento mesiac}}} one{{numeric, select, true{pred {months} mesiacom} other{minulý mesiac}}} many{pred {months} mesiaca} other{pred {months} mesiacmi}}
sl: {months, plural, =0{{numeric, select, true{pred {months} meseci} other{ta mesec}}} =1{{numeric, select, true{pred {months} mesecem} other{prejšnji mesec}}} =2{pred {months} mesecema} other{pred {months} meseci}}
sq: {months, plural, zero{{numeric, select, true{{months} muaj më parë} other{këtë muaj}}} one{{numeric, select, true{{months} muaj më parë} other{muajin e kaluar}}} other{{months} muaj më parë}}
sr: {months, plural, =0{{numeric, select, true{пре {months} месеци} other{овог месеца}}} =1{{numeric, select, true{пре {months} месеца} other{прошлог месеца}}} few{пре {months} месеца} other{пре {months} месеци}}
sr_latn: {months, plural, =0{{numeric, select, true{pre {months} meseci} other{ovog meseca}}} =1{{numeric, select, true{pre {months} meseca} other{prošlog meseca}}} few{pre {months} meseca} other{pre {months} meseci}}
sv: {months, plural, =0{{numeric, select, true{för {months} månader sedan} other{denna månad}}} =1{{numeric, select, true{för {months} månad sedan} other{förra månaden}}} other{för {months} månader sedan}}
sw: {months, plural, =0{{numeric, select, true{miezi {months} iliyopita} other{mwezi huu}}} =1{{numeric, select, true{mwezi {months} uliopita} other{mwezi uliopita}}} other{miezi {months} iliyopita}}
ta: {months, plural, =0{{numeric, select, true{{months} மாதங்களுக்கு முன்} other{இந்த மாதம்}}} =1{{numeric, select, true{{months} மாதத்துக்கு முன்} other{கடந்த மாதம்}}} other{{months} மாதங்களுக்கு முன்}}
te: {months, plural, zero{{numeric, select, true{{months} నెలల క్రితం} other{ఈ నెల}}} one{{numeric, select, true{{months} నెల క్రితం} other{గత నెల}}} other{{months} నెలల క్రితం}}
tg: {months, plural, =0{{numeric, select, true{{months} моҳ пеш} other{моҳи ҷорӣ}}} =1{{numeric, select, true{{months} моҳ пеш} other{моҳи гузашта}}} other{{months} моҳ пеш}}
th: {months, plural, zero{{numeric, select, true{{months} เดือนที่ผ่านมา} other{เดือนนี้}}} one{{numeric, select, true{{months} เดือนที่ผ่านมา} other{เดือนที่แล้ว}}} other{{months} เดือนที่ผ่านมา}}
tk: {months, plural, zero{{numeric, select, true{{months} aý öň} other{şu aý}}} one{{numeric, select, true{{months} aý öň} other{geçen aý}}} other{{months} aý öň}}
tr: {months, plural, =0{{numeric, select, true{{months} ay önce} other{bu ay}}} =1{{numeric, select, true{{months} ay önce} other{geçen ay}}} other{{months} ay önce}}
tt: {months, plural, zero{{numeric, select, true{{months} ай элек} other{бу айда}}} one{{numeric, select, true{{months} ай элек} other{узган айда}}} other{{months} ай элек}}
ug: {count, plural, zero{{numeric, select, true{{digits} ئاي ئىلگىرى} other{بۇ ئاي}}} one{{numeric, select, true{{digits} ئاي ئىلگىرى} other{ئۆتكەن ئاي}}} other{{digits} ئاي ئىلگىرى}}
uk: {count, plural, zero{{numeric, select, true{{digits} місяця тому} other{цього місяця}}} one{{numeric, select, true{{digits} місяць тому} other{минулого місяця}}} few{{digits} місяці тому} many{{digits} місяців тому} other{{digits} місяця тому}}
ur: {months, plural, =0{{numeric, select, true{{months} مہینے پہلے} other{اس ماہ}}} =1{{numeric, select, true{{months} مہینہ پہلے} other{گزشتہ ماہ}}} other{{months} مہینے پہلے}}
uz: {months, plural, =0{{numeric, select, true{{months} oy oldin} other{shu oy}}} =1{{numeric, select, true{{months} oy oldin} other{o‘tgan oy}}} other{{months} oy oldin}}
uz_cyrl: {months, plural, zero{{numeric, select, true{{months} ой аввал} other{бу ой}}} one{{numeric, select, true{{months} ой аввал} other{ўтган ой}}} other{{months} ой аввал}}
vi: {months, plural, zero{{numeric, select, true{{months} tháng trước} other{tháng này}}} one{{numeric, select, true{{months} tháng trước} other{tháng trước}}} other{{months} tháng trước}}
zh: {months, plural, =0{{numeric, select, true{{months}个月前} other{本月}}} =1{{numeric, select, true{{months}个月前} other{上个月}}} other{{months}个月前}}
zh_hant: {months, plural, =0{{numeric, select, true{{months} 個月前} other{本月}}} =1{{numeric, select, true{{months} 個月前} other{上個月}}} other{{months} 個月前}}
zu: {months, plural, =0{{numeric, select, true{{months} izinyanga ezedlule} other{le nyanga}}} =1{{numeric, select, true{{months} inyanga edlule} other{inyanga edlule}}} other{{months} izinyanga ezedlule}}
