Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# hoursPast
source: {count, plural, zero{{numeric, select, true{{digits} hours ago} other{this hour}}} one{{digits} hour ago} other{{digits} hours ago}}
af: {hours, plural, zero{{numeric, select, true{{hours} uur gelede} other{hierdie uur}}} other{{hours} uur gelede}}
am: {count, plural, zero{{numeric, select, true{ከ{digits} ሰዓቶች በፊት} other{ይህ ሰዓት}}} one{ከ{digits} ሰዓት በፊት} other{ከ{digits} ሰዓቶች በፊት}}
ar: {hours, plural, =0{{numeric, select, true{قبل {hours} ساعة} other{الساعة الحالية}}} =1{قبل ساعة واحدة} =2{قبل ساعتين} few{قبل {hours} ساعات} other{قبل {hours} ساعة}}
as: {hours, plural, zero{{numeric, select, true{{hours} ঘণ্টা পূৰ্বে} other{এইটো ঘণ্টাত}}} other{{hours} ঘণ্টা পূৰ্বে}}
ast: {hours, plural, =0{{numeric, select, true{hai {hours} hores} other{esta hora}}} =1{hai {hours} hora} other{hai {hours} hores}}
az: {hours, plural, zero{{numeric, select, true{{hours} saat öncə} other{bu saat}}} other{{hours} saat öncə}}
be: {hours, plural, =0{{numeric, select, true{{hours} гадзіны таму} other{у гэту гадзіну}}} =1{{hours} гадзіну таму} many{{hours} гадзін таму} other{{hours} гадзіны таму}}
bg: {hours, plural, =0{{numeric, select, true{преди {hours} часа} other{в този час}}} =1{преди {hours} час} other{преди {hours} часа}}
bn: {hours, plural, zero{{numeric, select, true{{hours} ঘন্টা আগে} other{এই ঘণ্টায়}}} other{{hours} ঘন্টা আগে}}
br: {hours, plural, =0{{numeric, select, true{{hours} eur zo} other{dʼan eur-mañ}}} many{{hours} a eurioù zo} other{{hours} eur zo}}
bs: {hours, plural, =0{{numeric, select, true{prije {hours} sati} other{ovaj sat}}} =1{prije {hours} sat} few{prije {hours} sata} other{prije {hours} sati}}
bs_cyrl: {count, plural, zero{{numeric, select, true{прије {digits} сати} other{овог сата}}} one{прије {digits} сат} few{прије {digits} сата} other{прије {digits} сати}}
ca: {hours, plural, =0{{numeric, select, true{fa {hours} hores} other{aquesta hora}}} =1{fa {hours} hora} other{fa {hours} hores}}
cs: {hours, plural, =0{{numeric, select, true{před {hours} hodinami} other{tuto hodinu}}} =1{před {hours} hodinou} many{před {hours} hodiny} other{před {hours} hodinami}}
cy: {hours, plural, =0{{numeric, select, true{{hours} awr yn ôl} other{yr awr hon}}} other{{hours} awr yn ôl}}
da: {hours, plural, =0{{numeric, select, true{for {hours} timer siden} other{denne time}}} =1{for {hours} time siden} other{for {hours} timer siden}}
de: {hours, plural, =0{{numeric, select, true{vor {hours} Stunden} other{in dieser Stunde}}} =1{vor {hours} Stunde} other{vor {hours} Stunden}}
dz: ཆུ་ཚོད་ {hours} ཧེ་མ་
el: {hours, plural, =0{{numeric, select, true{πριν από {hours} ώρες} other{τρέχουσα ώρα}}} =1{πριν από {hours} ώρα} other{πριν από {hours} ώρες}}
eo: {hours, plural, =0{{numeric, select, true{antaŭ {hours} horoj} other{nuna horo}}} =1{antaŭ {hours} horo} other{antaŭ {hours} horoj}}
es: {hours, plural, zero{{numeric, select, true{hace {hours} horas} other{esta hora}}} one{hace {hours} hora} other{hace {hours} horas}}
et: {hours, plural, =0{{numeric, select, true{{hours} tunni eest} other{praegusel tunnil}}} other{{hours} tunni eest}}
eu: {hours, plural, zero{{numeric, select, true{Duela {hours} ordu} other{ordu honetan}}} other{Duela {hours} ordu}}
fa: {hours, plural, =0{{numeric, select, true{{hours} ساعت پیش} other{همین ساعت}}} other{{hours} ساعت پیش}}
fi: {hours, plural, zero{{numeric, select, true{{hours} tuntia sitten} other{tämän tunnin aikana}}} one{{hours} tunti sitten} other{{hours} tuntia sitten}}
fil: {hours, plural, =0{{numeric, select, true{{hours} oras ang nakalipas} other{ngayong oras}}} other{{hours} oras ang nakalipas}}
fo: {hours, plural, zero{{numeric, select, true{{hours} tímar síðan} other{hendan tíman}}} one{{hours} tími síðan} other{{hours} tímar síðan}}
fr: {hours, plural, zero{{numeric, select, true{il y a {hours} heures} other{cette heure-ci}}} one{il y a {hours} heure} other{il y a {hours} heures}}
fur: {count, plural, one{{digits} ore indaûr} other{{digits} oris indaûr}}
fy: {hours, plural, other{{hours} oere lyn}}
ga: {hours, plural, zero{{numeric, select, true{{hours} uair an chloig ó shin} other{an uair seo}}} many{{hours} n-uair an chloig ó shin} other{{hours} uair an chloig ó shin}}
gd: {hours, plural, =0{{numeric, select, true{{hours} uair a thìde air ais} other{am broinn uair a thìde}}} few{{hours} uairean a thìde air ais} other{{hours} uair a thìde air ais}}
gl: {hours, plural, =0{{numeric, select, true{hai {hours} horas} other{esta hora}}} =1{hai {hours} hora} other{hai {hours} horas}}
gu: {hours, plural, zero{{numeric, select, true{{hours} કલાક પહેલાં} other{આ કલાક}}} other{{hours} કલાક પહેલાં}}
he: {hours, plural, =0{{numeric, select, true{לפני {hours} שעות} other{בשעה זו}}} =1{לפני שעה} =2{לפני שעתיים} other{לפני {hours} שעות}}
hi: {hours, plural, zero{{numeric, select, true{{hours} घंटे पहले} other{यह घंटा}}} other{{hours} घंटे पहले}}
hi_latn: {hours, plural, =0{{numeric, select, true{{hours} ghante pahle} other{yah ghanta}}} other{{hours} ghante pahle}}
hr: {hours, plural, zero{{numeric, select, true{prije {hours} sati} other{ovaj sat}}} one{prije {hours} sat} few{prije {hours} sata} other{prije {hours} sati}}
hu: {hours, plural, =0{{numeric, select, true{{hours} órával ezelőtt} other{ebben az órában}}} other{{hours} órával ezelőtt}}
hy: {hours, plural, zero{{numeric, select, true{{hours} ժամ առաջ} other{այս ժամին}}} other{{hours} ժամ առաջ}}
ia: {hours, plural, =0{{numeric, select, true{{hours} horas retro} other{iste hora}}} =1{{hours} hora retro} other{{hours} horas retro}}
id: {hours, plural, zero{{numeric, select, true{{hours} jam yang lalu} other{jam ini}}} other{{hours} jam yang lalu}}
is: {hours, plural, zero{{numeric, select, true{fyrir {hours} klukkustundum} other{þessa stundina}}} one{fyrir {hours} klukkustund} other{fyrir {hours} klukkustundum}}
it: {hours, plural, zero{{numeric, select, true{{hours} ore fa} other{quest’ora}}} one{{hours} ora fa} other{{hours} ore fa}}
ja: {hours, plural, =0{{numeric, select, true{{hours} 時間前} other{1 時間以内}}} other{{hours} 時間前}}
ka: {hours, plural, zero{{numeric, select, true{{hours} საათის წინ} other{ამ საათში}}} other{{hours} საათის წინ}}
kab: {hours, plural, zero{{numeric, select, true{{hours} n isragen aya} other{asrag-agi}}} one{{hours} n usrag aya} other{{hours} n isragen aya}}
kk: {hours, plural, zero{{numeric, select, true{{hours} сағат бұрын} other{осы сағат}}} other{{hours} сағат бұрын}}
km: {count, plural, zero{{numeric, select, true{{digits} ម៉ោង​មុន} other{ម៉ោងនេះ}}} other{{digits} ម៉ោង​មុន}}
kn: {hours, plural, =0{{numeric, select, true{{hours} ಗಂಟೆಗಳ ಹಿಂದೆ} other{ಈ ಗಂಟೆ}}} =1{{hours} ಗಂಟೆ ಹಿಂದೆ} other{{hours} ಗಂಟೆಗಳ ಹಿಂದೆ}}
ko: {hours, plural, zero{{numeric, select, true{{hours}시간 전} other{현재 시간}}} other{{hours}시간 전}}
ky: {hours, plural, =0{{numeric, select, true{{hours} саат мурун} other{ушул саатта}}} other{{hours} саат мурун}}
lb: {hours, plural, one{virun {hours} Stonn} other{viru(n) {hours} Stonnen}}
lo: {hours, plural, =0{{numeric, select, true{{hours} ຊົ່ວໂມງກ່ອນ} other{ຊົ່ວໂມງນີ້}}} other{{hours} ຊົ່ວໂມງກ່ອນ}}
lt: {hours, plural, =0{{numeric, select, true{prieš {hours} valandų} other{šią valandą}}} =1{prieš {hours} valandą} few{prieš {hours} valandas} many{prieš {hours} valandos} other{prieš {hours} valandų}}
lv: {hours, plural, =0{{numeric, select, true{pirms {hours} stundām} other{šajā stundā}}} =1{pirms {hours} stundas} other{pirms {hours} stundām}}
mai: {hours, plural, zero{{numeric, select, true{{hours} घंटा पहिले} other{एहि घंटा}}} other{{hours} घंटा पहिले}}
mi: {count, plural, zero{{numeric, select, true{-{digits} haora i mua} other{i tēnei haora}}} other{-{digits} haora i mua}}
mk: {hours, plural, =0{{numeric, select, true{пред {hours} часа} other{часов}}} =1{пред {hours} час} other{пред {hours} часа}}
ml: {hours, plural, zero{{numeric, select, true{{hours} മണിക്കൂർ മുമ്പ്} other{ഈ മണിക്കൂറിൽ}}} other{{hours} മണിക്കൂർ മുമ്പ്}}
mn: {hours, plural, zero{{numeric, select, true{{hours} цагийн өмнө} other{энэ цаг}}} other{{hours} цагийн өмнө}}
mr: {hours, plural, =0{{numeric, select, true{{hours} तासांपूर्वी} other{तासात}}} =1{{hours} तासापूर्वी} other{{hours} तासांपूर्वी}}
ms: {hours, plural, zero{{numeric, select, true{{hours} jam lalu} other{jam ini}}} other{{hours} jam lalu}}
ms_arab: {digits} جم لالو
mt: {hours, plural, zero{{numeric, select, true{{hours} siegħa ilu} other{din is-siegħa}}} one{siegħa ilu} two{sagħtejn ilu} few{{hours} sigħat ilu} many{{hours}-il siegħa ilu} other{{hours} siegħa ilu}}
my: {hours, plural, =0{{numeric, select, true{ပြီးခဲ့သည့် {hours} နာရီ} other{ဤအချိန်}}} other{ပြီးခဲ့သည့် {hours} နာရီ}}
ne: {hours, plural, =0{{numeric, select, true{{hours} घण्टा पहिले} other{यस घडीमा}}} other{{hours} घण्टा पहिले}}
nl: {hours, plural, zero{{numeric, select, true{{hours} uur geleden} other{binnen een uur}}} other{{hours} uur geleden}}
no: {hours, plural, zero{{numeric, select, true{for {hours} timer siden} other{denne timen}}} one{for {hours} time siden} other{for {hours} timer siden}}
or: {hours, plural, zero{{numeric, select, true{{hours} ଘଣ୍ଟା ପୂର୍ବେ} other{ଏହି ଘଣ୍ଟା}}} other{{hours} ଘଣ୍ଟା ପୂର୍ବେ}}
pa: {hours, plural, =0{{numeric, select, true{{hours} ਘੰਟੇ ਪਹਿਲਾਂ} other{ਇਸ ਘੰਟੇ}}} =1{{hours} ਘੰਟਾ ਪਹਿਲਾਂ} other{{hours} ਘੰਟੇ ਪਹਿਲਾਂ}}
pl: {count, plural, zero{{numeric, select, true{{digits} godziny temu} other{ta godzina}}} one{{digits} godzinę temu} many{{digits} godzin temu} other{{digits} godziny temu}}
ps: {hours, plural, =0{{numeric, select, true{{hours} ساعتونه مخکې} other{دا ساعت}}} =1{{hours} ساعت مخکې} other{{hours} ساعتونه مخکې}}
pt: {hours, plural, =0{{numeric, select, true{há {hours} horas} other{esta hora}}} =1{há {hours} hora} other{há {hours} horas}}
ro: {hours, plural, =0{{numeric, select, true{acum {hours} de ore} other{ora aceasta}}} =1{acum {hours} oră} few{acum {hours} ore} other{acum {hours} de ore}}
ru: {hours, plural, =0{{numeric, select, true{{hours} часа назад} other{в этот час}}} =1{{hours} час назад} many{{hours} часов назад} other{{hours} часа назад}}
sc: {hours, plural, =0{{numeric, select, true{{hours} oras a como} other{cust’ora}}} =1{{hours} ora a como} other{{hours} oras a como}}
sd: {hours, plural, =0{{numeric, select, true{{hours} ڪلاڪ پهرين} other{هن ڪلڪ}}} other{{hours} ڪلاڪ پهرين}}
se: {count, plural, one{{digits} diibmu árat} other{{digits} diibmur árat}}
se_fi: {hours, plural, =0{{numeric, select, true{{hours} diimmu áigi} other{dán diimmu}}} =1{{hours} diibmu áigi} other{{hours} diimmu áigi}}
si: {hours, plural, =0{{numeric, select, true{පැය {hours}කට පෙර} other{මෙම පැය}}} other{පැය {hours}කට පෙර}}
sk: {hours, plural, zero{{numeric, select, true{pred {hours} hodinami} other{v tejto hodine}}} one{pred {hours} hodinou} many{pred {hours} hodinou} other{pred {hours} hodinami}}
sl: {hours, plural, =0{{numeric, select, true{pred {hours} urami} other{v tej uri}}} =1{pred {hours} uro} =2{pred {hours} urama} other{pred {hours} urami}}
sq: {hours, plural, zero{{numeric, select, true{{hours} orë më parë} other{këtë orë}}} other{{hours} orë më parë}}
sr: {hours, plural, =0{{numeric, select, true{пре {hours} сати} other{овог сата}}} =1{пре {hours} сата} few{пре {hours} сата} other{пре {hours} сати}}
sr_latn: {hours, plural, =0{{numeric, select, true{pre {hours} sati} other{ovog sata}}} =1{pre {hours} sata} few{pre {hours} sata} other{pre {hours} sati}}
sv: {hours, plural, =0{{numeric, select, true{för {hours} timmar sedan} other{denna timme}}} =1{för {hours} timme sedan} other{för {hours} timmar sedan}}
sw: {hours, plural, =0{{numeric, select, true{saa {hours} zilizopita} other{saa hii}}} =1{saa {hours} iliyopita} other{saa {hours} zilizopita}}
ta: {hours, plural, =0{{numeric, select, true{{hours} மணிநேரம் முன்} other{இந்த ஒரு மணிநேரத்தில்}}} other{{hours} மணிநேரம் முன்}}
te: {hours, plural, zero{{numeric, select, true{{hours} గంటల క్రితం} other{ఈ గంట}}} one{{hours} గంట క్రితం} other{{hours} గంటల క్రితం}}
tg: {hours, plural, =0{{numeric, select, true{{hours} соат пеш} other{соати ҷорӣ}}} other{{hours} соат пеш}}
th: {hours, plural, zero{{numeric, select, true{{hours} ชั่วโมงที่ผ่านมา} other{ชั่วโมงนี้}}} other{{hours} ชั่วโมงที่ผ่านมา}}
tk: {hours, plural, zero{{numeric, select, true{{hours} sagat öň} other{şu sagat}}} other{{hours} sagat öň}}
tr: {hours, plural, =0{{numeric, select, true{{hours} saat önce} other{bu saat}}} other{{hours} saat önce}}
tt: {hours, plural, zero{{numeric, select, true{{hours} сәгать элек} other{бу сәгатьтә}}} other{{hours} сәгать элек}}
ug: {digits} سائەت ئىلگىرى
uk: {count, plural, zero{{numeric, select, true{{digits} години тому} other{цієї години}}} one{{digits} годину тому} many{{digits} годин тому} other{{digits} години тому}}
ur: {hours, plural, =0{{numeric, select, true{{hours} گھنٹے پہلے} other{اس گھنٹے}}} =1{{hours} گھنٹہ پہلے} other{{hours} گھنٹے پہلے}}
uz: {hours, plural, =0{{numeric, select, true{{hours} soat oldin} other{shu soatda}}} other{{hours} soat oldin}}
uz_cyrl: {hours, plural, other{{hours} соат олдин}}
vi: {hours, plural, zero{{numeric, select, true{{hours} giờ trước} other{giờ này}}} other{{hours} giờ trước}}
zh: {hours, plural, =0{{numeric, select, true{{hours}小时前} other{这一时间 / 此时}}} other{{hours}小时前}}
zh_hant: {hours, plural, =0{{numeric, select, true{{hours} 小時前} other{這一小時}}} other{{hours} 小時前}}
zu: {hours, plural, =0{{numeric, select, true{emahoreni angu-{hours} edlule} other{leli hora}}} =1{{hours} ihora eledlule} other{emahoreni angu-{hours} edlule}}
