Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# monthsFuture
source: {count, plural, zero{{numeric, select, true{in {digits} months} other{this month}}} one{{numeric, select, true{in {digits} month} other{next month}}} other{in {digits} months}}
af: {months, plural, zero{{numeric, select, true{oor {months} maande} other{vandeesmaand}}} one{{numeric, select, true{oor {months} maand} other{volgende maand}}} other{oor {months} maande}}
am: {count, plural, zero{{numeric, select, true{በ{digits} ወራት ውስጥ} other{በዚህ ወር}}} one{{numeric, select, true{በ{digits} ወር ውስጥ} other{የሚቀጥለው ወር}}} other{በ{digits} ወራት ውስጥ}}
ar: {months, plural, =0{{numeric, select, true{خلال {months} شهر} other{هذا الشهر}}} =1{{numeric, select, true{خلال شهر واحد} other{الشهر القادم}}} =2{خلال شهرين} few{خلال {months} أشهر} many{خلال {months} شهرًا} other{خلال {months} شهر}}
as: {months, plural, zero{{numeric, select, true{{months} মাহত} other{এই মাহ}}} one{{numeric, select, true{{months} মাহত} other{অহা মাহ}}} other{{months} মাহত}}
ast: {months, plural, =0{{numeric, select, true{en {months} meses} other{esti mes}}} =1{{numeric, select, true{en {months} mes} other{el mes viniente}}} other{en {months} meses}}
az: {months, plural, zero{{numeric, select, true{{months} ay ərzində} other{bu ay}}} one{{numeric, select, true{{months} ay ərzində} other{gələn ay}}} other{{months} ay ərzində}}
be: {months, plural, =0{{numeric, select, true{праз {months} месяца} other{у гэтым месяцы}}} =1{{numeric, select, true{праз {months} месяц} other{у наступным месяцы}}} few{праз {months} месяцы} many{праз {months} месяцаў} other{праз {months} месяца}}
bg: {months, plural, =0{{numeric, select, true{след {months} месеца} other{този месец}}} =1{{numeric, select, true{след {months} месец} other{следващ месец}}} other{след {months} месеца}}
bn: {months, plural, zero{{numeric, select, true{{months} মাসে} other{এই মাস}}} one{{numeric, select, true{{months} মাসে} other{পরের মাস}}} other{{months} মাসে}}
br: {months, plural, =0{{numeric, select, true{a-benn {months} miz} other{ar miz-mañ}}} =1{{numeric, select, true{a-benn {months} miz} other{ar miz a zeu}}} =2{a-benn {months} viz} many{a-benn {months} a vizioù} other{a-benn {months} miz}}
bs: {months, plural, =0{{numeric, select, true{za {months} mjeseci} other{ovaj mjesec}}} =1{{numeric, select, true{za {months} mjesec} other{sljedeći mjesec}}} few{za {months} mjeseca} other{za {months} mjeseci}}
bs_cyrl: {count, plural, zero{{numeric, select, true{за {digits} мјесеци} other{овог мјесеца}}} one{{numeric, select, true{за {digits} мјесец} other{сљедећег мјесеца}}} few{за {digits} мјесеца} other{за {digits} мјесеци}}
ca: {months, plural, =0{{numeric, select, true{d’aquí a {months} mesos} other{aquest mes}}} =1{{numeric, select, true{d’aquí a {months} mes} other{el mes que ve}}} other{d’aquí a {months} mesos}}
cs: {months, plural, =0{{numeric, select, true{za {months} měsíců} other{tento měsíc}}} =1{{numeric, select, true{za {months} měsíc} other{příští měsíc}}} few{za {months} měsíce} many{za {months} měsíce} other{za {months} měsíců}}
cy: {months, plural, =0{{numeric, select, true{ymhen {months} mis} other{y mis hwn}}} =1{{numeric, select, true{ymhen mis} other{mis nesaf}}} =2{ymhen deufis} other{ymhen {months} mis}}
da: {months, plural, =0{{numeric, select, true{om {months} måneder} other{denne måned}}} =1{{numeric, select, true{om {months} måned} other{næste måned}}} other{om {months} måneder}}
de: {months, plural, =0{{numeric, select, true{in {months} Monaten} other{diesen Monat}}} =1{{numeric, select, true{in {months} Monat} other{nächsten Monat}}} other{in {months} Monaten}}
dz: ཟླཝ་ {months} ནང་
el: {months, plural, =0{{numeric, select, true{σε {months} μήνες} other{τρέχων μήνας}}} =1{{numeric, select, true{σε {months} μήνα} other{επόμενος μήνας}}} other{σε {months} μήνες}}
eo: {months, plural, =0{{numeric, select, true{post {months} monatoj} other{nuna monato}}} =1{{numeric, select, true{post {months} monato} other{venonta monato}}} other{post {months} monatoj}}
es: {months, plural, zero{{numeric, select, true{dentro de {months} meses} other{este mes}}} one{{numeric, select, true{dentro de {months} mes} other{el próximo mes}}} other{dentro de {months} meses}}
et: {months, plural, =0{{numeric, select, true{{months} kuu pärast} other{käesolev kuu}}} =1{{numeric, select, true{{months} kuu pärast} other{järgmine kuu}}} other{{months} kuu pärast}}
eu: {months, plural, zero{{numeric, select, true{{months} hilabete barru} other{hilabete honetan}}} one{{numeric, select, true{{months} hilabete barru} other{hurrengo hilabetean}}} other{{months} hilabete barru}}
fa: {months, plural, =0{{numeric, select, true{{months} ماه بعد} other{این ماه}}} =1{{numeric, select, true{{months} ماه بعد} other{ماه آینده}}} other{{months} ماه بعد}}
fi: {months, plural, zero{{numeric, select, true{{months} kuukauden päästä} other{tässä kuussa}}} one{{numeric, select, true{{months} kuukauden päästä} other{ensi kuussa}}} other{{months} kuukauden päästä}}
fil: {months, plural, =0{{numeric, select, true{sa {months} buwan} other{ngayong buwan}}} =1{{numeric, select, true{sa {months} buwan} other{susunod na buwan}}} other{sa {months} buwan}}
fo: {months, plural, zero{{numeric, select, true{um {months} mánaðir} other{henda mánaðin}}} one{{numeric, select, true{um {months} mánað} other{næsta mánað}}} other{um {months} mánaðir}}
fr: {months, plural, zero{{numeric, select, true{dans {months} mois} other{ce mois-ci}}} one{{numeric, select, true{dans {months} mois} other{le mois prochain}}} other{dans {months} mois}}
fur: ca di {digits} mês
fy: {months, plural, =0{{numeric, select, true{Oer {months} moannen} other{dizze moanne}}} =1{{numeric, select, true{Oer {months} moanne} other{folgjende moanne}}} other{Oer {months} moannen}}
ga: {months, plural, zero{{numeric, select, true{i gceann {months} mí} other{an mhí seo}}} one{{numeric, select, true{i gceann {months} mhí} other{an mhí seo chugainn}}} two{i gceann {months} mhí} few{i gceann {months} mhí} other{i gceann {months} mí}}
gd: {months, plural, =0{{numeric, select, true{an ceann {months} mìosa} other{am mìos seo}}} =1{{numeric, select, true{an ceann {months} mhìosa} other{an ath-mhìos}}} =2{an ceann {months} mhìosa} few{an ceann {months} mìosan} other{an ceann {months} mìosa}}
gl: {months, plural, =0{{numeric, select, true{en {months} meses} other{este mes}}} =1{{numeric, select, true{en {months} mes} other{o próximo mes}}} other{en {months} meses}}
gu: {months, plural, zero{{numeric, select, true{{months} મહિનામાં} other{આ મહિને}}} one{{numeric, select, true{{months} મહિનામાં} other{આવતા મહિને}}} other{{months} મહિનામાં}}
he: {months, plural, =0{{numeric, select, true{בעוד {months} חודשים} other{החודש}}} =1{{numeric, select, true{בעוד חודש} other{החודש הבא}}} =2{בעוד חודשיים} other{בעוד {months} חודשים}}
hi: {months, plural, zero{{numeric, select, true{{months} माह में} other{इस माह}}} one{{numeric, select, true{{months} माह में} other{अगला माह}}} other{{months} माह में}}
hi_latn: {months, plural, =0{{numeric, select, true{{months} maheene mein} other{yah maheena}}} =1{{numeric, select, true{{months} maheene mein} other{agla maheena}}} other{{months} maheene mein}}
hr: {months, plural, zero{{numeric, select, true{za {months} mjeseci} other{ovaj mjesec}}} one{{numeric, select, true{za {months} mjesec} other{sljedeći mjesec}}} few{za {months} mjeseca} other{za {months} mjeseci}}
hu: {months, plural, =0{{numeric, select, true{{months} hónap múlva} other{ez a hónap}}} =1{{numeric, select, true{{months} hónap múlva} other{következő hónap}}} other{{months} hónap múlva}}
hy: {months, plural, zero{{numeric, select, true{{months} ամսից} other{այս ամիս}}} one{{numeric, select, true{{months} ամսից} other{հաջորդ ամիս}}} other{{months} ամսից}}
ia: {months, plural, =0{{numeric, select, true{in {months} menses} other{iste mense}}} =1{{numeric, select, true{in {months} mense} other{le mense proxime}}} other{in {months} menses}}
id: {months, plural, zero{{numeric, select, true{dalam {months} bulan} other{bulan ini}}} one{{numeric, select, true{dalam {months} bulan} other{bulan depan}}} other{dalam {months} bulan}}
is: {months, plural, zero{{numeric, select, true{eftir {months} mánuði} other{í þessum mánuði}}} one{{numeric, select, true{eftir {months} mánuð} other{í næsta mánuði}}} other{eftir {months} mánuði}}
it: {months, plural, zero{{numeric, select, true{tra {months} mesi} other{questo mese}}} one{{numeric, select, true{tra {months} mese} other{mese prossimo}}} other{tra {months} mesi}}
ja: {months, plural, =0{{numeric, select, true{{months} か月後} other{今月}}} =1{{numeric, select, true{{months} か月後} other{来月}}} other{{months} か月後}}
ka: {months, plural, zero{{numeric, select, true{{months} თვეში} other{ამ თვეში}}} one{{numeric, select, true{{months} თვეში} other{მომავალ თვეს}}} other{{months} თვეში}}
kab: {months, plural, zero{{numeric, select, true{deg {months} n wayyuren} other{ayyur-a}}} one{{numeric, select, true{deg {months} n wayyur} other{ayyur i d-itteddun}}} other{deg {months} n wayyuren}}
kk: {months, plural, zero{{numeric, select, true{{months} айдан кейін} other{осы ай}}} one{{numeric, select, true{{months} айдан кейін} other{келесі ай}}} other{{months} айдан кейін}}
km: {count, plural, zero{{numeric, select, true{{digits} ខែទៀត} other{ខែ​នេះ}}} one{{numeric, select, true{{digits} ខែទៀត} other{ខែ​ក្រោយ}}} other{{digits} ខែទៀត}}
kn: {months, plural, =0{{numeric, select, true{{months} ತಿಂಗಳುಗಳಲ್ಲಿ} other{ಈ ತಿಂಗಳು}}} =1{{numeric, select, true{{months} ತಿಂಗಳಲ್ಲಿ} other{ಮುಂದಿನ ತಿಂಗಳು}}} other{{months} ತಿಂಗಳುಗಳಲ್ಲಿ}}
ko: {months, plural, zero{{numeric, select, true{{months}개월 후} other{이번 달}}} one{{numeric, select, true{{months}개월 후} other{다음 달}}} other{{months}개월 후}}
ky: {months, plural, =0{{numeric, select, true{{months} айдан кийин} other{бул айда}}} =1{{numeric, select, true{{months} айдан кийин} other{эмдиги айда}}} other{{months} айдан кийин}}
lb: {months, plural, zero{{numeric, select, true{a(n) {months} Méint} other{dëse Mount}}} one{{numeric, select, true{an {months} Mount} other{nächste Mount}}} other{a(n) {months} Méint}}
lo: {months, plural, =0{{numeric, select, true{ໃນອີກ {months} ເດືອນ} other{ເດືອນນີ້}}} =1{{numeric, select, true{ໃນອີກ {months} ເດືອນ} other{ເດືອນໜ້າ}}} other{ໃນອີກ {months} ເດືອນ}}
lt: {months, plural, =0{{numeric, select, true{po {months} mėnesių} other{šį mėnesį}}} =1{{numeric, select, true{po {months} mėnesio} other{kitą mėnesį}}} many{po {months} mėnesio} other{po {months} mėnesių}}
lv: {months, plural, =0{{numeric, select, true{pēc {months} mēnešiem} other{šajā mēnesī}}} =1{{numeric, select, true{pēc {months} mēneša} other{nākamajā mēnesī}}} other{pēc {months} mēnešiem}}
mai: {months, plural, zero{{numeric, select, true{{months} माह मे} other{एहि माह}}} one{{numeric, select, true{{months} माह मे} other{अगिला माह}}} other{{months} माह मे}}
mi: {count, plural, zero{{numeric, select, true{+{digits} marama} other{i tēnei marama}}} one{{numeric, select, true{+{digits} marama} other{ā tērā marama}}} other{+{digits} marama}}
mk: {months, plural, =0{{numeric, select, true{за {months} месеци} other{овој месец}}} =1{{numeric, select, true{за {months} месец} other{следниот месец}}} other{за {months} месеци}}
ml: {months, plural, zero{{numeric, select, true{{months} മാസത്തിൽ} other{ഈ മാസം}}} one{{numeric, select, true{{months} മാസത്തിൽ} other{അടുത്ത മാസം}}} other{{months} മാസത്തിൽ}}
mn: {months, plural, zero{{numeric, select, true{{months} сарын дараа} other{энэ сар}}} one{{numeric, select, true{{months} сарын дараа} other{ирэх сар}}} other{{months} сарын дараа}}
mr: {months, plural, =0{{numeric, select, true{येत्या {months} महिन्यांमध्ये} other{हा महिना}}} =1{{numeric, select, true{येत्या {months} महिन्यामध्ये} other{पुढील महिना}}} other{येत्या {months} महिन्यांमध्ये}}
ms: {months, plural, zero{{numeric, select, true{dalam {months} bulan} other{bulan ini}}} one{{numeric, select, true{dalam {months} bulan} other{bulan depan}}} other{dalam {months} bulan}}
ms_arab: {count, plural, zero{{numeric, select, true{دالم {digits} بولن} other{بولن ني}}} one{{numeric, select, true{دالم {digits} بولن} other{بولن ستروسڽ}}} other{دالم {digits} بولن}}
mt: {months, plural, zero{{numeric, select, true{fi {months} xahar oħra} other{dan ix-xahar}}} one{{numeric, select, true{sa xahar ieħor} other{ix-xahar id-dieħel}}} two{fi xahrejn oħra} few{fi {months} xhur oħra} many{fi {months}-xahar oħra} other{fi {months} xahar oħra}}
my: {months, plural, =0{{numeric, select, true{{months} လအတွင်း} other{ယခုလ}}} =1{{numeric, select, true{{months} လအတွင်း} other{လာမည့်လ}}} other{{months} လအတွင်း}}
ne: {months, plural, =0{{numeric, select, true{{months} महिनामा} other{यो महिना}}} =1{{numeric, select, true{{months} महिनामा} other{अर्को महिना}}} other{{months} महिनामा}}
nl: {months, plural, zero{{numeric, select, true{over {months} maanden} other{deze maand}}} one{{numeric, select, true{over {months} maand} other{volgende maand}}} other{over {months} maanden}}
no: {months, plural, zero{{numeric, select, true{om {months} måneder} other{denne måneden}}} one{{numeric, select, true{om {months} måned} other{neste måned}}} other{om {months} måneder}}
or: {months, plural, zero{{numeric, select, true{{months} ମାସରେ} other{ଏହି ମାସ}}} one{{numeric, select, true{{months} ମାସରେ} other{ଆଗାମୀ ମାସ}}} other{{months} ମାସରେ}}
pa: {months, plural, =0{{numeric, select, true{{months} ਮਹੀਨਿਆਂ ਵਿੱਚ} other{ਇਹ ਮਹੀਨਾ}}} =1{{numeric, select, true{{months} ਮਹੀਨੇ ਵਿੱਚ} other{ਅਗਲਾ ਮਹੀਨਾ}}} other{{months} ਮਹੀਨਿਆਂ ਵਿੱਚ}}
pl: {count, plural, zero{{numeric, select, true{za {digits} miesiąca} other{w tym miesiącu}}} one{{numeric, select, true{za {digits} miesiąc} other{w przyszłym miesiącu}}} few{za {digits} miesiące} many{za {digits} miesięcy} other{za {digits} miesiąca}}
ps: {months, plural, =0{{numeric, select, true{په {months} مياشتو کې} other{دا مياشت}}} =1{{numeric, select, true{په {months} مياشت کې} other{راتلونکې مياشت}}} other{په {months} مياشتو کې}}
pt: {months, plural, =0{{numeric, select, true{em {months} meses} other{este mês}}} =1{{numeric, select, true{em {months} mês} other{próximo mês}}} other{em {months} meses}}
ro: {months, plural, =0{{numeric, select, true{peste {months} de luni} other{luna aceasta}}} =1{{numeric, select, true{peste {months} lună} other{luna viitoare}}} few{peste {months} luni} other{peste {months} de luni}}
ru: {months, plural, =0{{numeric, select, true{через {months} месяца} other{в этом месяце}}} =1{{numeric, select, true{через {months} месяц} other{в следующем месяце}}} many{через {months} месяцев} other{через {months} месяца}}
sc: {months, plural, =0{{numeric, select, true{intro de {months} meses} other{custu mese}}} =1{{numeric, select, true{intro de {months} mese} other{su mese chi intrat}}} other{intro de {months} meses}}
sd: {months, plural, =0{{numeric, select, true{{months} مهينن ۾} other{هن مهيني}}} =1{{numeric, select, true{{months} مهينن ۾} other{اڳين مهيني}}} other{{months} مهينن ۾}}
se: {digits} mánotbadji maŋŋilit
se_fi: {months, plural, =0{{numeric, select, true{{months} mánu siste} other{dán mánu}}} =1{{numeric, select, true{{months} mánu siste} other{boahtte mánu}}} other{{months} mánu siste}}
si: {months, plural, =0{{numeric, select, true{මාස {months}කින්} other{මෙම මාසය}}} =1{{numeric, select, true{මාස {months}කින්} other{ඊළඟ මාසය}}} other{මාස {months}කින්}}
sk: {months, plural, zero{{numeric, select, true{o {months} mesiacov} other{tento mesiac}}} one{{numeric, select, true{o {months} mesiac} other{budúci mesiac}}} few{o {months} mesiace} many{o {months} mesiaca} other{o {months} mesiacov}}
sl: {months, plural, =0{{numeric, select, true{čez {months} mesecev} other{ta mesec}}} =1{{numeric, select, true{čez {months} mesec} other{naslednji mesec}}} =2{čez {months} meseca} few{čez {months} mesece} other{čez {months} mesecev}}
sq: {months, plural, zero{{numeric, select, true{pas {months} muajsh} other{këtë muaj}}} one{{numeric, select, true{pas {months} muaji} other{muajin e ardhshëm}}} other{pas {months} muajsh}}
sr: {months, plural, =0{{numeric, select, true{за {months} месеци} other{овог месеца}}} =1{{numeric, select, true{за {months} месец} other{следећег месеца}}} few{за {months} месеца} other{за {months} месеци}}
sr_latn: {months, plural, =0{{numeric, select, true{za {months} meseci} other{ovog meseca}}} =1{{numeric, select, true{za {months} mesec} other{sledećeg meseca}}} few{za {months} meseca} other{za {months} meseci}}
sv: {months, plural, =0{{numeric, select, true{om {months} månader} other{denna månad}}} =1{{numeric, select, true{om {months} månad} other{nästa månad}}} other{om {months} månader}}
sw: {months, plural, =0{{numeric, select, true{baada ya miezi {months}} other{mwezi huu}}} =1{{numeric, select, true{baada ya mwezi {months}} other{mwezi ujao}}} other{baada ya miezi {months}}}
ta: {months, plural, =0{{numeric, select, true{{months} மாதங்களில்} other{இந்த மாதம்}}} =1{{numeric, select, true{{months} மாதத்தில்} other{அடுத்த மாதம்}}} other{{months} மாதங்களில்}}
te: {months, plural, zero{{numeric, select, true{{months} నెలల్లో} other{ఈ నెల}}} one{{numeric, select, true{{months} నెలలో} other{తదుపరి నెల}}} other{{months} నెలల్లో}}
tg: {months, plural, =0{{numeric, select, true{пас аз {months} моҳ} other{моҳи ҷорӣ}}} =1{{numeric, select, true{пас аз {months} моҳ} other{моҳи оянда}}} other{пас аз {months} моҳ}}
th: {months, plural, zero{{numeric, select, true{ในอีก {months} เดือน} other{เดือนนี้}}} one{{numeric, select, true{ในอีก {months} เดือน} other{เดือนหน้า}}} other{ในอีก {months} เดือน}}
tk: {months, plural, zero{{numeric, select, true{{months} aýdan} other{şu aý}}} one{{numeric, select, true{{months} aýdan} other{indiki aý}}} other{{months} aýdan}}
tr: {months, plural, =0{{numeric, select, true{{months} ay sonra} other{bu ay}}} =1{{numeric, select, true{{months} ay sonra} other{gelecek ay}}} other{{months} ay sonra}}
tt: {months, plural, zero{{numeric, select, true{{months} айдан} other{бу айда}}} one{{numeric, select, true{{months} айдан} other{киләсе айда}}} other{{months} айдан}}
ug: {count, plural, zero{{numeric, select, true{{digits} ئايدىن كېيىن} other{بۇ ئاي}}} one{{numeric, select, true{{digits} ئايدىن كېيىن} other{كېلەر ئاي}}} other{{digits} ئايدىن كېيىن}}
uk: {count, plural, zero{{numeric, select, true{через {digits} місяця} other{цього місяця}}} one{{numeric, select, true{через {digits} місяць} other{наступного місяця}}} few{через {digits} місяці} many{через {digits} місяців} other{через {digits} місяця}}
ur: {months, plural, =0{{numeric, select, true{{months} مہینے میں} other{اس ماہ}}} =1{{numeric, select, true{{months} مہینہ میں} other{اگلا مہینہ}}} other{{months} مہینے میں}}
uz: {months, plural, =0{{numeric, select, true{{months} oydan keyin} other{shu oy}}} =1{{numeric, select, true{{months} oydan keyin} other{keyingi oy}}} other{{months} oydan keyin}}
uz_cyrl: {months, plural, zero{{numeric, select, true{{months} ойдан сўнг} other{бу ой}}} one{{numeric, select, true{{months} ойдан сўнг} other{кейинги ой}}} other{{months} ойдан сўнг}}
vi: {months, plural, zero{{numeric, select, true{sau {months} tháng nữa} other{tháng này}}} one{{numeric, select, true{sau {months} tháng nữa} other{tháng sau}}} other{sau {months} tháng nữa}}
zh: {months, plural, =0{{numeric, select, true{{months}个月后} other{本月}}} =1{{numeric, select, true{{months}个月后} other{下个月}}} other{{months}个月后}}
zh_hant: {months, plural, =0{{numeric, select, true{{months} 個月後} other{本月}}} =1{{numeric, select, true{{months} 個月後} other{下個月}}} other{{months} 個月後}}
zu: {months, plural, =0{{numeric, select, true{ezinyangeni ezingu-{months} ezizayo} other{le nyanga}}} =1{{numeric, select, true{enyangeni engu-{months}} other{inyanga ezayo}}} other{ezinyangeni ezingu-{months} ezizayo}}
