Repository: Mosc/relative_time
Catalog: lib/src/l10n/arb/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, be, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, dz, el, eo, es, et, eu, fa, fi, fil, fo, fr, fur, fy, ga, gd, gl, gu, he, hi, hi_latn, hr, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mai, mi, mk, ml, mn, mr, ms, ms_arab, mt, my, ne, nl, no, or, pa, pl, ps, pt, ro, ru, sc, sd, se, se_fi, si, sk, sl, sq, sr, sr_latn, sv, sw, ta, te, tg, th, tk, tr, tt, ug, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# minutesFuture
source: {count, plural, zero{{numeric, select, true{in {digits} minutes} other{this minute}}} one{in {digits} minute} other{in {digits} minutes}}
af: {minutes, plural, zero{{numeric, select, true{oor {minutes} minute} other{hierdie minuut}}} one{oor {minutes} minuut} other{oor {minutes} minute}}
am: {count, plural, zero{{numeric, select, true{በ{digits} ደቂቃዎች ውስጥ} other{ይህ ደቂቃ}}} one{በ{digits} ደቂቃ ውስጥ} other{በ{digits} ደቂቃዎች ውስጥ}}
ar: {minutes, plural, =0{{numeric, select, true{خلال {minutes} دقيقة} other{هذه الدقيقة}}} =1{خلال دقيقة واحدة} =2{خلال دقيقتين} few{خلال {minutes} دقائق} other{خلال {minutes} دقيقة}}
as: {minutes, plural, zero{{numeric, select, true{{minutes} মিনিটত} other{এইটো মিনিটত}}} other{{minutes} মিনিটত}}
ast: {minutes, plural, =0{{numeric, select, true{en {minutes} minutos} other{esti minutu}}} =1{en {minutes} minutu} other{en {minutes} minutos}}
az: {minutes, plural, zero{{numeric, select, true{{minutes} dəqiqə ərzində} other{bu dəqiqə}}} other{{minutes} dəqiqə ərzində}}
be: {minutes, plural, =0{{numeric, select, true{праз {minutes} хвіліны} other{у гэту хвіліну}}} =1{праз {minutes} хвіліну} many{праз {minutes} хвілін} other{праз {minutes} хвіліны}}
bg: {minutes, plural, =0{{numeric, select, true{след {minutes} минути} other{в тази минута}}} =1{след {minutes} минута} other{след {minutes} минути}}
bn: {minutes, plural, zero{{numeric, select, true{{minutes} মিনিটে} other{এই মিনিট}}} other{{minutes} মিনিটে}}
br: {minutes, plural, =0{{numeric, select, true{a-benn {minutes} munut} other{ar munut-mañ}}} =2{a-benn {minutes} vunut} many{a-benn {minutes} a vunutoù} other{a-benn {minutes} munut}}
bs: {minutes, plural, =0{{numeric, select, true{za {minutes} minuta} other{ova minuta}}} =1{za {minutes} minutu} few{za {minutes} minute} other{za {minutes} minuta}}
bs_cyrl: {count, plural, zero{{numeric, select, true{за {digits} минута} other{овог минута}}} one{за {digits} минут} other{за {digits} минута}}
ca: {minutes, plural, =0{{numeric, select, true{d’aquí a {minutes} minuts} other{aquest minut}}} =1{d’aquí a {minutes} minut} other{d’aquí a {minutes} minuts}}
cs: {minutes, plural, =0{{numeric, select, true{za {minutes} minut} other{tuto minutu}}} =1{za {minutes} minutu} few{za {minutes} minuty} many{za {minutes} minuty} other{za {minutes} minut}}
cy: {minutes, plural, =0{{numeric, select, true{ymhen {minutes} munud} other{y funud hon}}} other{ymhen {minutes} munud}}
da: {minutes, plural, =0{{numeric, select, true{om {minutes} minutter} other{dette minut}}} =1{om {minutes} minut} other{om {minutes} minutter}}
de: {minutes, plural, =0{{numeric, select, true{in {minutes} Minuten} other{in dieser Minute}}} =1{in {minutes} Minute} other{in {minutes} Minuten}}
dz: སྐར་མ་ {minutes} ནང་
el: {minutes, plural, =0{{numeric, select, true{σε {minutes} λεπτά} other{τρέχον λεπτό}}} =1{σε {minutes} λεπτό} other{σε {minutes} λεπτά}}
eo: {minutes, plural, =0{{numeric, select, true{post {minutes} minutoj} other{nuna minuto}}} =1{post {minutes} minuto} other{post {minutes} minutoj}}
es: {minutes, plural, zero{{numeric, select, true{dentro de {minutes} minutos} other{este minuto}}} one{dentro de {minutes} minuto} other{dentro de {minutes} minutos}}
et: {minutes, plural, =0{{numeric, select, true{{minutes} minuti pärast} other{praegusel minutil}}} other{{minutes} minuti pärast}}
eu: {minutes, plural, zero{{numeric, select, true{{minutes} minutu barru} other{minutu honetan}}} other{{minutes} minutu barru}}
fa: {minutes, plural, =0{{numeric, select, true{{minutes} دقیقه بعد} other{همین دقیقه}}} other{{minutes} دقیقه بعد}}
fi: {minutes, plural, zero{{numeric, select, true{{minutes} minuutin päästä} other{tämän minuutin aikana}}} other{{minutes} minuutin päästä}}
fil: {minutes, plural, =0{{numeric, select, true{sa {minutes} minuto} other{sa minutong ito}}} other{sa {minutes} minuto}}
fo: {minutes, plural, zero{{numeric, select, true{um {minutes} minuttir} other{hendan minuttin}}} one{um {minutes} minutt} other{um {minutes} minuttir}}
fr: {minutes, plural, zero{{numeric, select, true{dans {minutes} minutes} other{cette minute-ci}}} one{dans {minutes} minute} other{dans {minutes} minutes}}
fur: {count, plural, one{ca di {digits} minût} other{ca di {digits} minûts}}
fy: {minutes, plural, =1{Oer {minutes} minút} other{Oer {minutes} minuten}}
ga: {minutes, plural, zero{{numeric, select, true{i gceann {minutes} nóiméad} other{an nóiméad seo}}} other{i gceann {minutes} nóiméad}}
gd: {minutes, plural, =0{{numeric, select, true{an ceann {minutes} mionaid} other{am broinn mionaid}}} =1{an ceann {minutes} mhionaid} =2{an ceann {minutes} mhionaid} few{an ceann {minutes} mionaidean} other{an ceann {minutes} mionaid}}
gl: {minutes, plural, =0{{numeric, select, true{en {minutes} minutos} other{este minuto}}} =1{en {minutes} minuto} other{en {minutes} minutos}}
gu: {minutes, plural, zero{{numeric, select, true{{minutes} મિનિટમાં} other{આ મિનિટ}}} other{{minutes} મિનિટમાં}}
he: {minutes, plural, =0{{numeric, select, true{בעוד {minutes} דקות} other{בדקה זו}}} =1{בעוד דקה} =2{בעוד שתי דקות} other{בעוד {minutes} דקות}}
hi: {minutes, plural, zero{{numeric, select, true{{minutes} मिनट में} other{यह मिनट}}} other{{minutes} मिनट में}}
hi_latn: {minutes, plural, =0{{numeric, select, true{{minutes} minute mein} other{yah minute}}} other{{minutes} minute mein}}
hr: {minutes, plural, zero{{numeric, select, true{za {minutes} minuta} other{ova minuta}}} one{za {minutes} minutu} few{za {minutes} minute} other{za {minutes} minuta}}
hu: {minutes, plural, =0{{numeric, select, true{{minutes} perc múlva} other{ebben a percben}}} other{{minutes} perc múlva}}
hy: {minutes, plural, zero{{numeric, select, true{{minutes} րոպեից} other{այս րոպեին}}} other{{minutes} րոպեից}}
ia: {minutes, plural, =0{{numeric, select, true{in {minutes} minutas} other{iste minuta}}} =1{in {minutes} minuta} other{in {minutes} minutas}}
id: {minutes, plural, zero{{numeric, select, true{dalam {minutes} menit} other{menit ini}}} other{dalam {minutes} menit}}
is: {minutes, plural, zero{{numeric, select, true{eftir {minutes} mínútur} other{á þessari mínútu}}} one{eftir {minutes} mínútu} other{eftir {minutes} mínútur}}
it: {minutes, plural, zero{{numeric, select, true{tra {minutes} minuti} other{questo minuto}}} one{tra {minutes} minuto} other{tra {minutes} minuti}}
ja: {minutes, plural, =0{{numeric, select, true{{minutes} 分後} other{1 分以内}}} other{{minutes} 分後}}
ka: {minutes, plural, zero{{numeric, select, true{{minutes} წუთში} other{ამ წუთში}}} other{{minutes} წუთში}}
kab: {minutes, plural, zero{{numeric, select, true{deg {minutes} n tesdatin} other{tasdat-agi}}} one{deg {minutes} n tesdat} other{deg {minutes} n tesdatin}}
kk: {minutes, plural, zero{{numeric, select, true{{minutes} минуттан кейін} other{осы минут}}} other{{minutes} минуттан кейін}}
km: {count, plural, zero{{numeric, select, true{{digits} នាទីទៀត} other{នាទីនេះ}}} other{{digits} នាទីទៀត}}
kn: {minutes, plural, =0{{numeric, select, true{{minutes} ನಿಮಿಷಗಳಲ್ಲಿ} other{ಈ ನಿಮಿಷ}}} =1{{minutes} ನಿಮಿಷದಲ್ಲಿ} other{{minutes} ನಿಮಿಷಗಳಲ್ಲಿ}}
ko: {minutes, plural, zero{{numeric, select, true{{minutes}분 후} other{현재 분}}} other{{minutes}분 후}}
ky: {minutes, plural, =0{{numeric, select, true{{minutes} мүнөттөн кийин} other{ушул мүнөттө}}} other{{minutes} мүнөттөн кийин}}
lb: {minutes, plural, one{an {minutes} Minutt} other{a(n) {minutes} Minutten}}
lo: {minutes, plural, =0{{numeric, select, true{ໃນອີກ {minutes} ນາທີ} other{ນາທີນີ້}}} other{ໃນອີກ {minutes} ນາທີ}}
lt: {minutes, plural, =0{{numeric, select, true{po {minutes} minučių} other{šią minutę}}} =1{po {minutes} minutės} many{po {minutes} minutės} other{po {minutes} minučių}}
lv: {minutes, plural, =0{{numeric, select, true{pēc {minutes} minūtēm} other{šajā minūtē}}} =1{pēc {minutes} minūtes} other{pēc {minutes} minūtēm}}
mai: {minutes, plural, zero{{numeric, select, true{{minutes} मिनट मे} other{एहि मिनट}}} other{{minutes} मिनट मे}}
mi: {count, plural, zero{{numeric, select, true{+{digits} meneti} other{i tēnei meneti}}} other{+{digits} meneti}}
mk: {minutes, plural, =0{{numeric, select, true{за {minutes} минути} other{оваа минута}}} =1{за {minutes} минута} other{за {minutes} минути}}
ml: {minutes, plural, zero{{numeric, select, true{{minutes} മിനിറ്റിൽ} other{ഈ മിനിറ്റിൽ}}} other{{minutes} മിനിറ്റിൽ}}
mn: {minutes, plural, zero{{numeric, select, true{{minutes} минутын дараа} other{энэ минут}}} other{{minutes} минутын дараа}}
mr: {minutes, plural, =0{{numeric, select, true{{minutes} मिनिटांमध्ये} other{या मिनिटात}}} =1{{minutes} मिनिटामध्ये} other{{minutes} मिनिटांमध्ये}}
ms: {minutes, plural, zero{{numeric, select, true{dalam {minutes} minit} other{pada minit ini}}} other{dalam {minutes} minit}}
ms_arab: دالم {digits} مينيت
mt: {minutes, plural, zero{{numeric, select, true{sa {minutes} minuta oħra} other{din il-minuta}}} one{sa minuta oħra} two{sa {minutes} minuti oħra} few{sa {minutes} minuti oħra} many{sa {minutes}-il minuta oħra} other{sa {minutes} minuta oħra}}
my: {minutes, plural, =0{{numeric, select, true{{minutes} မိနစ်အတွင်း} other{ဤမိနစ်}}} other{{minutes} မိနစ်အတွင်း}}
ne: {minutes, plural, =0{{numeric, select, true{{minutes} मिनेटमा} other{यही मिनेटमा}}} other{{minutes} मिनेटमा}}
nl: {minutes, plural, zero{{numeric, select, true{over {minutes} minuten} other{binnen een minuut}}} one{over {minutes} minuut} other{over {minutes} minuten}}
no: {minutes, plural, zero{{numeric, select, true{om {minutes} minutter} other{dette minuttet}}} one{om {minutes} minutt} other{om {minutes} minutter}}
or: {minutes, plural, zero{{numeric, select, true{{minutes} ମିନିଟ୍‌‌ରେ} other{ଏହି ମିନିଟ୍}}} other{{minutes} ମିନିଟ୍‌‌ରେ}}
pa: {minutes, plural, =0{{numeric, select, true{{minutes} ਮਿੰਟਾਂ ਵਿੱਚ} other{ਇਸ ਮਿੰਟ}}} =1{{minutes} ਮਿੰਟ ਵਿੱਚ} other{{minutes} ਮਿੰਟਾਂ ਵਿੱਚ}}
pl: {count, plural, zero{{numeric, select, true{za {digits} minuty} other{ta minuta}}} one{za {digits} minutę} many{za {digits} minut} other{za {digits} minuty}}
ps: {minutes, plural, =0{{numeric, select, true{په {minutes} دقيقو کې} other{دا دقيقه}}} =1{په {minutes} دقيقه کې} other{په {minutes} دقيقو کې}}
pt: {minutes, plural, =0{{numeric, select, true{em {minutes} minutos} other{este minuto}}} =1{em {minutes} minuto} other{em {minutes} minutos}}
ro: {minutes, plural, =0{{numeric, select, true{peste {minutes} de minute} other{minutul acesta}}} =1{peste {minutes} minut} few{peste {minutes} minute} other{peste {minutes} de minute}}
ru: {minutes, plural, =0{{numeric, select, true{через {minutes} минуты} other{в эту минуту}}} =1{через {minutes} минуту} many{через {minutes} минут} other{через {minutes} минуты}}
sc: {minutes, plural, =0{{numeric, select, true{intro de {minutes} minutos} other{custu minutu}}} =1{intro de {minutes} minutu} other{intro de {minutes} minutos}}
sd: {minutes, plural, =0{{numeric, select, true{+{minutes} min} other{هن منٽ}}} =1{{minutes} منٽن ۾} other{+{minutes} min}}
se: {count, plural, one{{digits} minuhta maŋŋilit} other{{digits} minuhtta maŋŋilit}}
se_fi: {minutes, plural, =0{{numeric, select, true{{minutes} minuhta siste} other{dán minuhta}}} other{{minutes} minuhta siste}}
si: {minutes, plural, =0{{numeric, select, true{මිනිත්තු {minutes}කින්} other{මෙම මිනිත්තුව}}} other{මිනිත්තු {minutes}කින්}}
sk: {minutes, plural, zero{{numeric, select, true{o {minutes} minút} other{v tejto minúte}}} one{o {minutes} minútu} few{o {minutes} minúty} many{o {minutes} minúty} other{o {minutes} minút}}
sl: {minutes, plural, =0{{numeric, select, true{čez {minutes} minut} other{to minuto}}} =1{čez {minutes} minuto} =2{čez {minutes} minuti} few{čez {minutes} minute} other{čez {minutes} minut}}
sq: {minutes, plural, zero{{numeric, select, true{pas {minutes} minutash} other{këtë minutë}}} one{pas {minutes} minute} other{pas {minutes} minutash}}
sr: {minutes, plural, =0{{numeric, select, true{за {minutes} минута} other{овог минута}}} =1{за {minutes} минут} other{за {minutes} минута}}
sr_latn: {minutes, plural, =0{{numeric, select, true{za {minutes} minuta} other{ovog minuta}}} =1{za {minutes} minut} other{za {minutes} minuta}}
sv: {minutes, plural, =0{{numeric, select, true{om {minutes} minuter} other{denna minut}}} =1{om {minutes} minut} other{om {minutes} minuter}}
sw: {minutes, plural, =0{{numeric, select, true{baada ya dakika {minutes}} other{dakika hii}}} other{baada ya dakika {minutes}}}
ta: {minutes, plural, =0{{numeric, select, true{{minutes} நிமிடங்களில்} other{இந்த ஒரு நிமிடத்தில்}}} =1{{minutes} நிமிடத்தில்} other{{minutes} நிமிடங்களில்}}
te: {minutes, plural, zero{{numeric, select, true{{minutes} నిమిషాల్లో} other{ఈ నిమిషం}}} one{{minutes} నిమిషంలో} other{{minutes} నిమిషాల్లో}}
tg: {minutes, plural, =0{{numeric, select, true{пас аз {minutes} дақиқа} other{дақиқаи ҷорӣ}}} other{пас аз {minutes} дақиқа}}
th: {minutes, plural, zero{{numeric, select, true{ในอีก {minutes} นาที} other{นาทีนี้}}} other{ในอีก {minutes} นาที}}
tk: {minutes, plural, zero{{numeric, select, true{{minutes} minutdan} other{şu minut}}} other{{minutes} minutdan}}
tr: {minutes, plural, =0{{numeric, select, true{{minutes} dakika sonra} other{bu dakika}}} other{{minutes} dakika sonra}}
tt: {minutes, plural, zero{{numeric, select, true{{minutes} минуттан} other{бу минутта}}} other{{minutes} минуттан}}
ug: {digits} مىنۇتتىن كېيىن
uk: {count, plural, zero{{numeric, select, true{через {digits} хвилини} other{цієї хвилини}}} one{через {digits} хвилину} many{через {digits} хвилин} other{через {digits} хвилини}}
ur: {minutes, plural, =0{{numeric, select, true{{minutes} منٹ میں} other{اس منٹ}}} other{{minutes} منٹ میں}}
uz: {minutes, plural, =0{{numeric, select, true{{minutes} daqiqadan keyin} other{shu daqiqada}}} other{{minutes} daqiqadan keyin}}
uz_cyrl: {minutes, plural, other{{minutes} дақиқадан сўнг}}
vi: {minutes, plural, zero{{numeric, select, true{sau {minutes} phút nữa} other{phút này}}} other{sau {minutes} phút nữa}}
zh: {minutes, plural, =0{{numeric, select, true{{minutes}分钟后} other{此刻}}} other{{minutes}分钟后}}
zh_hant: {minutes, plural, =0{{numeric, select, true{{minutes} 分鐘後} other{這一分鐘}}} other{{minutes} 分鐘後}}
zu: {minutes, plural, =0{{numeric, select, true{kumaminithi angu-{minutes} ezayo} other{leli minithi}}} =1{kuminithi elingu-{minutes} elizayo} other{kumaminithi angu-{minutes} ezayo}}
