Repository: Mosc/relative_time
Catalog: lib/src/l10n/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, el, eo, es, et, eu, fa, fi, fil, fo, fr, fy, ga, gd, gl, gu, he, hi, hi_latn, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mk, ml, mn, mr, ms, mt, my, ne, nl, no, or, pa, pl, ps, pt, pt_pt, ro, sc, sd, se_fi, si, sk, sl, sq, sr, sr_cyrl_ba, sr_latn, sr_latn_ba, sv, sw, ta, te, tg, th, tk, tr, tt, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# weeksPastNumeric
source: {weeks, plural, =1{{weeks} week ago} other{{weeks} weeks ago}}
as: {weeks, plural, =1{{weeks} সপ্তাহ পূৰ্বে} other{{weeks} সপ্তাহ পূৰ্বে}}
bg: {weeks, plural, =1{преди {weeks} седмица} other{преди {weeks} седмици}}
da: {weeks, plural, =1{for {weeks} uge siden} other{for {weeks} uger siden}}
es: {weeks, plural, =1{hace {weeks} semana} other{hace {weeks} semanas}}
gu: {weeks, plural, =1{{weeks} અઠવાડિયા પહેલાં} other{{weeks} અઠવાડિયા પહેલાં}}
it: {weeks, plural, =1{{weeks} settimana fa} other{{weeks} settimane fa}}
ka: {weeks, plural, =1{{weeks} კვირის წინ} other{{weeks} კვირის წინ}}
kab: {weeks, plural, =1{{weeks} n dduṛt aya} other{{weeks} n dduṛtat aya}}
ky: {weeks, plural, =1{{weeks} апта мурун} other{{weeks} апта мурун}}
lb: {weeks, plural, =1{virun {weeks} Woch} other{viru(n) {weeks} Wochen}}
lv: {weeks, plural, zero{pirms {weeks} nedēļām} =1{pirms {weeks} nedēļas} other{pirms {weeks} nedēļām}}
ml: {weeks, plural, =1{{weeks} ആഴ്ച മുമ്പ്} other{{weeks} ആഴ്ച മുമ്പ്}}
mr: {weeks, plural, =1{{weeks} आठवड्यापूर्वी} other{{weeks} आठवड्यांपूर्वी}}
ms: {weeks, plural, other{{weeks} minggu lalu}}
mt: {weeks, plural, =1{ġimgħa ilu} few{{weeks} ġimgħat ilu} many{{weeks} ġimgħat ilu} other{{weeks} ġimgħat ilu}}
ne: {weeks, plural, =1{{weeks} हप्ता पहिले} other{{weeks} हप्ता पहिले}}
ro: {weeks, plural, =1{acum {weeks} săptămână} few{acum {weeks} săptămâni} other{acum {weeks} de săptămâni}}
si: {weeks, plural, =1{සති {weeks}කට පෙර} other{සති {weeks}කට පෙර}}
sl: {weeks, plural, =1{pred {weeks} tednom} =2{pred {weeks} tednoma} few{pred {weeks} tedni} other{pred {weeks} tedni}}
sq: {weeks, plural, =1{{weeks} javë më parë} other{{weeks} javë më parë}}
sr_latn: {weeks, plural, =1{pre {weeks} nedelje} few{pre {weeks} nedelje} other{pre {weeks} nedelja}}
sw: {weeks, plural, =1{wiki {weeks} iliyopita} other{wiki {weeks} zilizopita}}
te: {weeks, plural, =1{{weeks} వారం క్రితం} other{{weeks} వారాల క్రితం}}
th: {weeks, plural, other{{weeks} สัปดาห์ที่ผ่านมา}}
tk: {weeks, plural, =1{{weeks} hepde öň} other{{weeks} hepde öň}}
tt: {weeks, plural, other{{weeks} атна элек}}
uz: {weeks, plural, =1{{weeks} hafta oldin} other{{weeks} hafta oldin}}
uz_cyrl: {weeks, plural, =1{{weeks} ҳафта олдин} other{{weeks} ҳафта олдин}}
zh: {weeks, plural, other{{weeks}周前}}
zh_hant: {weeks, plural, other{{weeks} 週前}}
zu: {weeks, plural, =1{evikini elingu-{weeks} eledlule} other{amaviki angu-{weeks} edlule}}

# daysFuture
source: {days, plural, =0{today} =1{tomorrow} other{in {days} days}}
af: {days, plural, =0{vandag} =1{oor {days} dag} other{oor {days} dae}}
am: {days, plural, =0{ዛሬ} =1{በ{days} ቀን ውስጥ} other{በ{days} ቀናት ውስጥ}}
ar: {days, plural, =0{اليوم} zero{خلال {days} يوم} =1{خلال يوم واحد} =2{خلال يومين} few{خلال {days} أيام} many{خلال {days} يومًا} other{خلال {days} يوم}}
as: {days, plural, =0{আজি} =1{কাইলৈ} =2{পৰহিলৈ} other{{days} দিনত}}
ast: {days, plural, =0{güei} =1{en {days} día} other{en {days} díes}}
az: {days, plural, =0{bu gün} =1{{days} gün ərzində} other{{days} gün ərzində}}
bg: {days, plural, =0{днес} =1{утре} =2{вдругиден} other{след {days} дни}}
bn: {days, plural, =0{আজ} =1{{days} দিনের মধ্যে} other{{days} দিনের মধ্যে}}
br: {days, plural, =0{hiziv} =1{a-benn {days} deiz} =2{a-benn {days} zeiz} few{a-benn {days} deiz} many{a-benn {days} a zeizioù} other{a-benn {days} deiz}}
bs: {days, plural, =0{danas} =1{za {days} dan} few{za {days} dana} other{za {days} dana}}
bs_cyrl: {days, plural, =0{данас} =1{за {days} дан} few{за {days} дана} other{за {days} дана}}
ca: {days, plural, =1{d’aquí a {days} dia} other{d’aquí a {days} dies}}
cs: {days, plural, =1{za {days} den} few{za {days} dny} many{za {days} dne} other{za {days} dní}}
cy: {days, plural, =0{heddiw} zero{ymhen {days} diwrnod} =1{ymhen diwrnod} =2{ymhen deuddydd} few{ymhen {days} diwrnod} many{ymhen {days} diwrnod} other{ymhen {days} diwrnod}}
da: {days, plural, =0{i dag} =1{i morgen} =2{i overmorgen} other{om {days} dage}}
de: {days, plural, =0{heute} =1{in {days} Tag} other{in {days} Tagen}}
el: {days, plural, =0{σήμερα} =1{σε {days} ημέρα} other{σε {days} ημέρες}}
eo: {days, plural, =0{hodiaŭ} =1{post {days} tago} other{post {days} tagoj}}
es: {days, plural, =0{hoy} =1{mañana} =2{pasado mañana} other{dentro de {days} días}}
et: {days, plural, =0{täna} =1{{days} päeva pärast} other{{days} päeva pärast}}
eu: {days, plural, =0{gaur} =1{{days} egun barru} other{{days} egun barru}}
fa: {days, plural, =0{امروز} =1{{days} روز بعد} other{{days} روز بعد}}
fi: {days, plural, =0{tänään} =1{{days} päivän päästä} other{{days} päivän päästä}}
fil: {days, plural, =0{ngayong araw} =1{sa {days} araw} other{sa {days} (na) araw}}
fo: {days, plural, =0{í dag} =1{um {days} dag} other{um {days} dagar}}
fr: {days, plural, =0{aujourd’hui} =1{dans {days} jour} other{dans {days} jours}}
fy: {days, plural, =0{vandaag} =1{Oer {days} dei} other{Oer {days} deien}}
ga: {days, plural, =0{inniu} =1{i gceann {days} lá} =2{i gceann {days} lá} few{i gceann {days} lá} many{i gceann {days} lá} other{i gceann {days} lá}}
gd: {days, plural, =1{an ceann {days} latha} =2{an ceann {days} latha} few{an ceann {days} làithean} other{an ceann {days} latha}}
gl: {days, plural, =0{hoxe} =1{en {days} día} other{en {days} días}}
gu: {days, plural, =0{આજે} =1{આવતીકાલે} =2{પરમદિવસે} other{{days} દિવસમાં}}
he: {days, plural, =0{היום} =1{בעוד יום {days}} =2{בעוד יומיים} many{בעוד {days} ימים} other{בעוד {days} ימים}}
hi: {days, plural, =0{आज} =1{{days} दिन में} other{{days} दिन में}}
hi_latn: {days, plural, =0{aaj} =1{{days} din mein} other{{days} din mein}}
hu: {days, plural, =0{ma} =1{{days} nap múlva} other{{days} nap múlva}}
hy: {days, plural, =0{այսօր} =1{{days} օրից} other{{days} օրից}}
ia: {days, plural, =0{hodie} =1{in {days} die} other{in {days} dies}}
id: {days, plural, =0{hari ini} other{dalam {days} hari}}
is: {days, plural, =0{í dag} =1{eftir {days} dag} other{eftir {days} daga}}
it: {days, plural, =0{oggi} =1{domani} =2{dopodomani} other{tra {days} giorni}}
ja: {days, plural, =0{今日} other{{days} 日後}}
ka: {days, plural, =0{დღეს} =1{ხვალ} =2{ზეგ} other{{days} დღეში}}
kab: {days, plural, =0{Ass-a} =1{Azekka} other{deg {days} n wussan}}
kk: {days, plural, =1{{days} күннен кейін} other{{days} күннен кейін}}
km: {days, plural, =0{ថ្ងៃ​នេះ} other{{days} ថ្ងៃទៀត}}
kn: {days, plural, =0{ಇಂದು} =1{{days} ದಿನದಲ್ಲಿ} other{{days} ದಿನಗಳಲ್ಲಿ}}
ko: {days, plural, =0{오늘} other{{days}일 후}}
ky: {days, plural, =0{бүгүн} =1{эртең} =2{бүрсүгүнү} other{{days} күндөн кийин}}
lb: {days, plural, =0{haut} =1{muer} other{a(n) {days} Deeg}}
lo: {days, plural, =0{ມື້ນີ້} other{ໃນອີກ {days} ມື້}}
lt: {days, plural, =1{po {days} dienos} few{po {days} dienų} many{po {days} dienos} other{po {days} dienų}}
lv: {days, plural, =0{šodien} =1{rīt} =2{parīt} zero{pēc {days} dienām} other{pēc {days} dienām}}
mk: {days, plural, =0{денес} =1{за {days} ден} other{за {days} дена}}
ml: {days, plural, =0{ഇന്ന്} =1{നാളെ} =2{മറ്റന്നാൾ} other{{days} ദിവസത്തിൽ}}
mn: {days, plural, =0{өнөөдөр} =1{{days} өдрийн дараа} other{{days} өдрийн дараа}}
mr: {days, plural, =0{आज} =1{उद्या} other{येत्या {days} दिवसांमध्ये}}
ms: {days, plural, =0{hari ini} =1{esok} =2{lusa} other{dalam {days} hari}}
mt: {days, plural, =0{illum} =1{għada} few{fi żmien {days} ġurnata oħra} many{fi żmien {days} ġurnata oħra} other{fi żmien {days} ġurnata oħra}}
my: {days, plural, =0{ယနေ့} other{{days} ရက်အတွင်း}}
ne: {days, plural, =0{आज} =1{भोलि} =2{पर्सि} other{{days} दिनमा}}
nl: {days, plural, =0{vandaag} =1{over {days} dag} other{over {days} dagen}}
no: {days, plural, =0{i dag} =1{om {days} døgn} other{om {days} døgn}}
or: {days, plural, =0{ଆଜି} =1{{days} ଦିନରେ} other{{days} ଦିନରେ}}
pa: {days, plural, =0{ਅੱਜ} =1{{days} ਦਿਨ ਵਿੱਚ} other{{days} ਦਿਨਾਂ ਵਿੱਚ}}
pl: {days, plural, =0{dzisiaj} =1{za {days} dzień} few{za {days} dni} many{za {days} dni} other{za {days} dnia}}
ps: {days, plural, =0{نن} =1{په {days} ورځ کې} other{په {days} ورځو کې}}
pt: {days, plural, =0{hoje} =1{em {days} dia} other{em {days} dias}}
pt_pt: {days, plural, =1{dentro de {days} dia} other{dentro de {days} dias}}
ro: {days, plural, =0{azi} =1{mâine} =2{poimâine} few{peste {days} zile} other{peste {days} de zile}}
sc: {days, plural, =1{intro de {days} die} other{intro de {days} dies}}
sd: {days, plural, =0{اڄ} =1{{days} ڏينهن ۾} other{{days} ڏينهن ۾}}
se_fi: {days, plural, =1{{days} beaivve siste} =2{{days} beaivve siste} other{{days} beaivve siste}}
si: {days, plural, =0{අද} =1{හෙට} =2{අනිද්දා} other{දින {days}න්}}
sk: {days, plural, =0{dnes} =1{o {days} deň} few{o {days} dni} many{o {days} dňa} other{o {days} dní}}
sl: {days, plural, =0{danes} =1{jutri} =2{pojutrišnjem} few{čez {days} dni} other{čez {days} dni}}
sq: {days, plural, =0{sot} =1{nesër} other{pas {days} ditësh}}
sr: {days, plural, =0{данас} =1{за {days} дан} few{за {days} дана} other{за {days} дана}}
sr_latn: {days, plural, =0{danas} =1{sutra} =2{prekosutra} few{za {days} dana} other{za {days} dana}}
sv: {days, plural, =0{i dag} =1{om {days} dag} other{om {days} dagar}}
sw: {days, plural, =0{leo} =1{kesho} =2{kesho kutwa} other{baada ya siku {days}}}
ta: {days, plural, =0{இன்று} =1{{days} நாளில்} other{{days} நாட்களில்}}
te: {days, plural, =0{ఈ రోజు} =1{రేపు} =2{ఎల్లుండి} other{{days} రోజుల్లో}}
tg: {days, plural, =0{имрӯз} other{пас аз {days} рӯз}}
th: {days, plural, =0{วันนี้} =1{พรุ่งนี้} =2{มะรืนนี้} other{ในอีก {days} วัน}}
tk: {days, plural, =0{şu gün} =1{ertir} other{{days} günden}}
tr: {days, plural, =0{bugün} =1{{days} gün sonra} other{{days} gün sonra}}
tt: {days, plural, =0{бүген} =1{иртәгә} other{{days} көннән}}
uk: {days, plural, =1{через {days} день} few{через {days} дні} many{через {days} днів} other{через {days} дня}}
ur: {days, plural, =0{آج} =1{{days} دن میں} other{{days} دنوں میں}}
uz: {days, plural, =0{bugun} =1{ertaga} other{{days} kundan keyin}}
uz_cyrl: {days, plural, =0{бугун} =1{эртага} other{{days} кундан сўнг}}
vi: {days, plural, =0{Hôm nay} other{sau {days} ngày nữa}}
zh: {days, plural, =0{今天} =1{明天} =2{后天} other{{days}天后}}
zh_hant: {days, plural, =0{今天} =1{明天} =2{後天} other{{days} 天後}}
zu: {days, plural, =0{namhlanje} =1{kusasa} =2{usuku olulandela olwakusasa} other{ezinsukwini ezingu-{days} ezizayo}}

# daysFutureNumeric
source: {days, plural, =1{in {days} day} other{in {days} days}}
as: {days, plural, =1{{days} দিনত} other{{days} দিনত}}
bg: {days, plural, =1{след {days} ден} other{след {days} дни}}
da: {days, plural, =1{om {days} dag} other{om {days} dage}}
es: {days, plural, =1{dentro de {days} día} other{dentro de {days} días}}
gu: {days, plural, =1{{days} દિવસમાં} other{{days} દિવસમાં}}
it: {days, plural, =1{tra {days} giorno} other{tra {days} giorni}}
ka: {days, plural, =1{{days} დღეში} other{{days} დღეში}}
kab: {days, plural, =1{deg {days} n wass} other{deg {days} n wussan}}
ky: {days, plural, =1{{days} күндөн кийин} other{{days} күндөн кийин}}
lb: {days, plural, =1{an {days} Dag} other{a(n) {days} Deeg}}
lv: {days, plural, zero{pēc {days} dienām} =1{pēc {days} dienas} other{pēc {days} dienām}}
ml: {days, plural, =1{{days} ദിവസത്തിൽ} other{{days} ദിവസത്തിൽ}}
mr: {days, plural, =1{येत्या {days} दिवसामध्ये} other{येत्या {days} दिवसांमध्ये}}
ms: {days, plural, other{dalam {days} hari}}
mt: {days, plural, =1{fi żmien ġurnata} few{fi żmien {days} ġurnata oħra} many{fi żmien {days} ġurnata oħra} other{fi żmien {days} ġurnata oħra}}
ne: {days, plural, =1{{days} दिनमा} other{{days} दिनमा}}
pt_pt: {days, plural, =1{dentro de {days} dia} other{dentro de {days} dias}}
ro: {days, plural, =1{peste {days} zi} few{peste {days} zile} other{peste {days} de zile}}
si: {days, plural, =1{දින {days}න්} other{දින {days}න්}}
sl: {days, plural, =1{čez {days} dan} =2{čez {days} dneva} few{čez {days} dni} other{čez {days} dni}}
sq: {days, plural, =1{pas {days} dite} other{pas {days} ditësh}}
sr_latn: {days, plural, =1{za {days} dan} few{za {days} dana} other{za {days} dana}}
sw: {days, plural, =1{baada ya siku {days}} other{baada ya siku {days}}}
te: {days, plural, =1{{days} రోజులో} other{{days} రోజుల్లో}}
th: {days, plural, other{ในอีก {days} วัน}}
tk: {days, plural, =1{{days} günden} other{{days} günden}}
tt: {days, plural, other{{days} көннән}}
uz: {days, plural, =1{{days} kundan keyin} other{{days} kundan keyin}}
uz_cyrl: {days, plural, =1{{days} кундан сўнг} other{{days} кундан сўнг}}
zh: {days, plural, other{{days}天后}}
zh_hant: {days, plural, other{{days} 天後}}
zu: {days, plural, =1{osukwini olungu-{days} oluzayo} other{ezinsukwini ezingu-{days} ezizayo}}

# daysPast
source: {days, plural, =0{today} =1{yesterday} other{{days} days ago}}
af: {days, plural, =0{vandag} =1{{days} dag gelede} other{{days} dae gelede}}
am: {days, plural, =0{ዛሬ} =1{ከ{days} ቀን በፊት} other{ከ{days} ቀናት በፊት}}
ar: {days, plural, =0{اليوم} zero{قبل {days} يوم} =1{قبل يوم واحد} =2{قبل يومين} few{قبل {days} أيام} many{قبل {days} يومًا} other{قبل {days} يوم}}
as: {days, plural, =0{আজি} =1{কালি} =2{পৰহি} other{{days} দিন পূৰ্বে}}
ast: {days, plural, =0{güei} =1{hai {days} día} other{hai {days} díes}}
az: {days, plural, =0{bu gün} =1{{days} gün öncə} other{{days} gün öncə}}
bg: {days, plural, =0{днес} =1{вчера} =2{онзи ден} other{преди {days} дни}}
bn: {days, plural, =0{আজ} =1{{days} দিন আগে} other{{days} দিন আগে}}
br: {days, plural, =0{hiziv} =1{{days} deiz zo} =2{{days} zeiz zo} few{{days} deiz zo} many{{days} a zeizioù zo} other{{days} deiz zo}}
bs: {days, plural, =0{danas} =1{prije {days} dan} few{prije {days} dana} other{prije {days} dana}}
bs_cyrl: {days, plural, =0{данас} =1{прије {days} дан} few{прије {days} дана} other{прије {days} дана}}
ca: {days, plural, =1{fa {days} dia} other{fa {days} dies}}
cs: {days, plural, =1{před {days} dnem} few{před {days} dny} many{před {days} dne} other{před {days} dny}}
cy: {days, plural, =0{heddiw} zero{{days} diwrnod yn ôl} =1{{days} diwrnod yn ôl} =2{{days} ddiwrnod yn ôl} few{{days} diwrnod yn ôl} many{{days} diwrnod yn ôl} other{{days} diwrnod yn ôl}}
da: {days, plural, =0{i dag} =1{i går} =2{i forgårs} other{for {days} dage siden}}
de: {days, plural, =0{heute} =1{vor {days} Tag} other{vor {days} Tagen}}
el: {days, plural, =0{σήμερα} =1{πριν από {days} ημέρα} other{πριν από {days} ημέρες}}
eo: {days, plural, =0{hodiaŭ} =1{antaŭ {days} tago} other{antaŭ {days} tagoj}}
es: {days, plural, =0{hoy} =1{ayer} =2{anteayer} other{hace {days} días}}
et: {days, plural, =0{täna} =1{{days} päeva eest} other{{days} päeva eest}}
eu: {days, plural, =0{gaur} =1{Duela {days} egun} other{Duela {days} egun}}
fa: {days, plural, =0{امروز} =1{{days} روز پیش} other{{days} روز پیش}}
fi: {days, plural, =0{tänään} =1{{days} päivä sitten} other{{days} päivää sitten}}
fil: {days, plural, =0{ngayong araw} =1{{days} araw ang nakalipas} other{{days} (na) araw ang nakalipas}}
fo: {days, plural, =0{í dag} =1{{days} dagur síðan} other{{days} dagar síðan}}
fr: {days, plural, =0{aujourd’hui} =1{il y a {days} jour} other{il y a {days} jours}}
fy: {days, plural, =0{vandaag} =1{{days} dei lyn} other{{days} deien lyn}}
ga: {days, plural, =0{inniu} =1{{days} lá ó shin} =2{{days} lá ó shin} few{{days} lá ó shin} many{{days} lá ó shin} other{{days} lá ó shin}}
gd: {days, plural, =1{{days} latha air ais} =2{{days} latha air ais} few{{days} làithean air ais} other{{days} latha air ais}}
gl: {days, plural, =0{hoxe} =1{hai {days} día} other{hai {days} días}}
gu: {days, plural, =0{આજે} =1{ગઈકાલે} =2{ગયા પરમદિવસે} other{{days} દિવસ પહેલાં}}
he: {days, plural, =0{היום} =1{לפני יום {days}} =2{לפני יומיים} many{לפני {days} ימים} other{לפני {days} ימים}}
hi: {days, plural, =0{आज} =1{{days} दिन पहले} other{{days} दिन पहले}}
hi_latn: {days, plural, =0{aaj} =1{{days} din pehle} other{{days} din pehle}}
hu: {days, plural, =0{ma} =1{{days} nappal ezelőtt} other{{days} nappal ezelőtt}}
hy: {days, plural, =0{այսօր} =1{{days} օր առաջ} other{{days} օր առաջ}}
ia: {days, plural, =0{hodie} =1{{days} die retro} other{{days} dies retro}}
id: {days, plural, =0{hari ini} other{{days} hari yang lalu}}
is: {days, plural, =0{í dag} =1{fyrir {days} degi} other{fyrir {days} dögum}}
it: {days, plural, =0{oggi} =1{ieri} =2{l’altro ieri} other{{days} giorni fa}}
ja: {days, plural, =0{今日} other{{days} 日前}}
ka: {days, plural, =0{დღეს} =1{გუშინ} =2{გუშინწინ} other{{days} დღის წინ}}
kab: {days, plural, =0{Ass-a} =1{Iḍelli} other{{days} n wussan aya}}
kk: {days, plural, =1{{days} күн бұрын} other{{days} күн бұрын}}
km: {days, plural, =0{ថ្ងៃ​នេះ} other{{days} ថ្ងៃ​មុន}}
kn: {days, plural, =0{ಇಂದು} =1{{days} ದಿನದ ಹಿಂದೆ} other{{days} ದಿನಗಳ ಹಿಂದೆ}}
ko: {days, plural, =0{오늘} other{{days}일 전}}
ky: {days, plural, =0{бүгүн} =1{кечээ} =2{мурдагы күнү} other{{days} күн мурун}}
lb: {days, plural, =0{haut} =1{gëschter} other{viru(n) {days} Deeg}}
lo: {days, plural, =0{ມື້ນີ້} other{{days} ມື້ກ່ອນ}}
lt: {days, plural, =1{prieš {days} dieną} few{prieš {days} dienas} many{prieš {days} dienos} other{prieš {days} dienų}}
lv: {days, plural, =0{šodien} =1{vakar} =2{aizvakar} zero{pirms {days} dienām} other{pirms {days} dienām}}
mk: {days, plural, =0{денес} =1{пред {days} ден} other{пред {days} дена}}
ml: {days, plural, =0{ഇന്ന്} =1{ഇന്നലെ} =2{മിനിഞ്ഞാന്ന്} other{{days} ദിവസം മുമ്പ്}}
mn: {days, plural, =0{өнөөдөр} =1{{days} өдрийн өмнө} other{{days} өдрийн өмнө}}
mr: {days, plural, =0{आज} =1{काल} other{{days} दिवसांपूर्वी}}
ms: {days, plural, =0{hari ini} =1{semalam} =2{kelmarin} other{{days} hari lalu}}
mt: {days, plural, =0{illum} =1{lbieraħ} few{{days} ġranet ilu} many{{days}-il ġurnata ilu} other{{days}-il ġurnata ilu}}
my: {days, plural, =0{ယနေ့} other{ပြီးခဲ့သည့် {days} ရက်}}
ne: {days, plural, =0{आज} =1{हिजो} =2{अस्ति} other{{days} दिन पहिले}}
nl: {days, plural, =0{vandaag} =1{{days} dag geleden} other{{days} dagen geleden}}
no: {days, plural, =0{i dag} =1{for {days} døgn siden} other{for {days} døgn siden}}
or: {days, plural, =0{ଆଜି} =1{{days} ଦିନ ପୂର୍ବେ} other{{days} ଦିନ ପୂର୍ବେ}}
pa: {days, plural, =0{ਅੱਜ} =1{{days} ਦਿਨ ਪਹਿਲਾਂ} other{{days} ਦਿਨ ਪਹਿਲਾਂ}}
pl: {days, plural, =0{dzisiaj} =1{{days} dzień temu} few{{days} dni temu} many{{days} dni temu} other{{days} dnia temu}}
ps: {days, plural, =0{نن} =1{{days} ورځ مخکې} other{{days} ورځې مخکې}}
pt: {days, plural, =0{hoje} =1{há {days} dia} other{há {days} dias}}
ro: {days, plural, =0{azi} =1{ieri} =2{alaltăieri} few{acum {days} zile} other{acum {days} de zile}}
sc: {days, plural, =1{{days} die a como} other{{days} dies a como}}
sd: {days, plural, =0{اڄ} =1{{days} ڏينهن پهرين} other{{days} ڏينهن پهرين}}
se_fi: {days, plural, =1{ikte} =2{ovddet beaivve} other{{days} beaivve dás ovdal}}
si: {days, plural, =0{අද} =1{ඊයේ} =2{පෙරේදා} other{දින {days}කට පෙර}}
sk: {days, plural, =0{dnes} =1{pred {days} dňom} few{pred {days} dňami} many{pred {days} dňa} other{pred {days} dňami}}
sl: {days, plural, =0{danes} =1{včeraj} =2{predvčerajšnjim} few{pred {days} dnevi} other{pred {days} dnevi}}
sq: {days, plural, =0{sot} =1{dje} other{{days} ditë më parë}}
sr: {days, plural, =0{данас} =1{пре {days} дана} few{пре {days} дана} other{пре {days} дана}}
sr_cyrl_ba: {days, plural, =1{прије {days} дана} few{прије {days} дана} other{прије {days} дана}}
sr_latn: {days, plural, =0{danas} =1{juče} =2{prekjuče} few{pre {days} dana} other{pre {days} dana}}
sr_latn_ba: {days, plural, =1{prije {days} dana} few{prije {days} dana} other{prije {days} dana}}
sv: {days, plural, =0{i dag} =1{för {days} dag sedan} other{för {days} dagar sedan}}
sw: {days, plural, =0{leo} =1{jana} =2{juzi} other{siku {days} zilizopita}}
ta: {days, plural, =0{இன்று} =1{{days} நாளுக்கு முன்} other{{days} நாட்களுக்கு முன்}}
te: {days, plural, =0{ఈ రోజు} =1{నిన్న} =2{మొన్న} other{{days} రోజుల క్రితం}}
tg: {days, plural, =0{имрӯз} other{{days} рӯз пеш}}
th: {days, plural, =0{วันนี้} =1{เมื่อวาน} =2{เมื่อวานซืน} other{{days} วันที่ผ่านมา}}
tk: {days, plural, =0{şu gün} =1{düýn} other{{days} gün öň}}
tr: {days, plural, =0{bugün} =1{{days} gün önce} other{{days} gün önce}}
tt: {days, plural, =0{бүген} =1{кичә} other{{days} көн элек}}
uk: {days, plural, =1{{days} день тому} few{{days} дні тому} many{{days} днів тому} other{{days} дня тому}}
ur: {days, plural, =0{آج} =1{{days} دن پہلے} other{{days} دنوں پہلے}}
uz: {days, plural, =0{bugun} =1{kecha} other{{days} kun oldin}}
uz_cyrl: {days, plural, =0{бугун} =1{кеча} other{{days} кун олдин}}
vi: {days, plural, =0{Hôm nay} other{{days} ngày trước}}
zh: {days, plural, =0{今天} =1{昨天} =2{前天} other{{days}天前}}
zh_hant: {days, plural, =0{今天} =1{昨天} =2{前天} other{{days} 天前}}
zu: {days, plural, =0{namhlanje} =1{izolo} =2{usuku olwandulela olwayizolo} other{ezinsukwini ezingu-{days} ezedlule.}}

# daysPastNumeric
source: {days, plural, =1{{days} day ago} other{{days} days ago}}
as: {days, plural, =1{{days} দিন পূৰ্বে} other{{days} দিন পূৰ্বে}}
bg: {days, plural, =1{преди {days} ден} other{преди {days} дни}}
da: {days, plural, =1{for {days} dag siden} other{for {days} dage siden}}
es: {days, plural, =1{hace {days} día} other{hace {days} días}}
gu: {days, plural, =1{{days} દિવસ પહેલાં} other{{days} દિવસ પહેલાં}}
it: {days, plural, =1{{days} giorno fa} other{{days} giorni fa}}
ka: {days, plural, =1{{days} დღის წინ} other{{days} დღის წინ}}
kab: {days, plural, =1{{days} n wass aya} other{{days} n wussan aya}}
ky: {days, plural, =1{{days} күн мурун} other{{days} күн мурун}}
lb: {days, plural, =1{virun {days} Dag} other{viru(n) {days} Deeg}}
lv: {days, plural, zero{pirms {days} dienām} =1{pirms {days} dienas} other{pirms {days} dienām}}
ml: {days, plural, =1{{days} ദിവസം മുമ്പ്} other{{days} ദിവസം മുമ്പ്}}
mr: {days, plural, =1{{days} दिवसापूर्वी} other{{days} दिवसांपूर्वी}}
ms: {days, plural, other{{days} hari lalu}}
mt: {days, plural, =1{ġurnata ilu} few{{days} ġranet ilu} many{{days}-il ġurnata ilu} other{{days}-il ġurnata ilu}}
ne: {days, plural, =1{{days} दिन पहिले} other{{days} दिन पहिले}}
ro: {days, plural, =1{acum {days} zi} few{acum {days} zile} other{acum {days} de zile}}
si: {days, plural, =1{දින {days}කට පෙර} other{දින {days}කට පෙර}}
sl: {days, plural, =1{pred {days} dnevom} =2{pred {days} dnevoma} few{pred {days} dnevi} other{pred {days} dnevi}}
sq: {days, plural, =1{{days} ditë më parë} other{{days} ditë më parë}}
sr_latn: {days, plural, =1{pre {days} dana} few{pre {days} dana} other{pre {days} dana}}
sw: {days, plural, =1{siku {days} iliyopita} other{siku {days} zilizopita}}
te: {days, plural, =1{{days} రోజు క్రితం} other{{days} రోజుల క్రితం}}
th: {days, plural, other{{days} วันที่ผ่านมา}}
tk: {days, plural, =1{{days} gün öň} other{{days} gün öň}}
tt: {days, plural, other{{days} көн элек}}
uz: {days, plural, =1{{days} kun oldin} other{{days} kun oldin}}
uz_cyrl: {days, plural, =1{{days} кун олдин} other{{days} кун олдин}}
zh: {days, plural, other{{days}天前}}
zh_hant: {days, plural, other{{days} 天前}}
zu: {days, plural, =1{osukwini olungu-{days} olwedlule} other{ezinsukwini ezingu-{days} ezedlule.}}
