Repository: Mosc/relative_time
Catalog: lib/src/l10n/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, el, eo, es, et, eu, fa, fi, fil, fo, fr, fy, ga, gd, gl, gu, he, hi, hi_latn, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mk, ml, mn, mr, ms, mt, my, ne, nl, no, or, pa, pl, ps, pt, pt_pt, ro, sc, sd, se_fi, si, sk, sl, sq, sr, sr_cyrl_ba, sr_latn, sr_latn_ba, sv, sw, ta, te, tg, th, tk, tr, tt, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# yearsFuture
source: {years, plural, =0{this year} =1{next year} other{in {years} years}}
af: {years, plural, =0{hierdie jaar} =1{oor {years} jaar} other{oor {years} jaar}}
am: {years, plural, =0{በዚህ ዓመት} =1{በ{years} ዓመታት ውስጥ} other{በ{years} ዓመታት ውስጥ}}
ar: {years, plural, =0{السنة الحالية} zero{خلال {years} سنة} =1{خلال سنة واحدة} =2{خلال سنتين} few{خلال {years} سنوات} many{خلال {years} سنة} other{خلال {years} سنة}}
as: {years, plural, =0{এই বছৰ} =1{অহা বছৰ} other{{years} বছৰত}}
ast: {years, plural, =0{esti añu} =1{en {years} añu} other{en {years} años}}
az: {years, plural, =0{bu il} =1{{years} il ərzində} other{{years} il ərzində}}
bg: {years, plural, =0{тази година} =1{следващата година} other{след {years} години}}
bn: {years, plural, =0{এই বছর} =1{{years} বছরে} other{{years} বছরে}}
br: {years, plural, =0{hevlene} =1{a-benn {years} bloaz} =2{a-benn {years} vloaz} few{a-benn {years} bloaz} many{a-benn {years} a vloazioù} other{a-benn {years} vloaz}}
bs: {years, plural, =0{ove godine} =1{za {years} godinu} few{za {years} godine} other{za {years} godina}}
bs_cyrl: {years, plural, =0{ове године} =1{за {years} годину} few{за {years} године} other{за {years} година}}
ca: {years, plural, =1{d’aquí a {years} any} other{d’aquí a {years} anys}}
cs: {years, plural, =1{za {years} rok} few{za {years} roky} many{za {years} roku} other{za {years} let}}
cy: {years, plural, =0{eleni} zero{ymhen {years} mlynedd} =1{ymhen blwyddyn} =2{ymhen {years} flynedd} few{ymhen {years} blynedd} many{ymhen {years} blynedd} other{ymhen {years} mlynedd}}
da: {years, plural, =0{i år} =1{næste år} other{om {years} år}}
de: {years, plural, =0{dieses Jahr} =1{in {years} Jahr} other{in {years} Jahren}}
el: {years, plural, =0{φέτος} =1{σε {years} έτος} other{σε {years} έτη}}
eo: {years, plural, =0{nuna jaro} =1{post {years} jaro} other{post {years} jaroj}}
es: {years, plural, =0{este año} =1{el próximo año} other{dentro de {years} años}}
et: {years, plural, =0{käesolev aasta} =1{{years} aasta pärast} other{{years} aasta pärast}}
eu: {years, plural, =0{aurten} =1{{years} urte barru} other{{years} urte barru}}
fa: {years, plural, =0{امسال} =1{{years} سال بعد} other{{years} سال بعد}}
fi: {years, plural, =0{tänä vuonna} =1{{years} vuoden päästä} other{{years} vuoden päästä}}
fil: {years, plural, =0{ngayong taon} =1{sa {years} taon} other{sa {years} (na) taon}}
fo: {years, plural, =0{í ár} =1{um {years} ár} other{um {years} ár}}
fr: {years, plural, =0{cette année} =1{dans {years} an} other{dans {years} ans}}
fy: {years, plural, =0{dit jier} =1{Oer {years} jier} other{Oer {years} jier}}
ga: {years, plural, =0{i mbliana} =1{i gceann {years} bhliain} =2{i gceann {years} bhliain} few{i gceann {years} bliana} many{i gceann {years} mbliana} other{i gceann {years} bliain}}
gd: {years, plural, =1{an ceann {years} bhliadhna} =2{an ceann {years} bhliadhna} few{an ceann {years} bliadhnaichean} other{an ceann {years} bliadhna}}
gl: {years, plural, =0{este ano} =1{en {years} ano} other{en {years} anos}}
gu: {years, plural, =0{આ વર્ષે} =1{આવતા વર્ષે} other{{years} વર્ષમાં}}
he: {years, plural, =0{השנה} =1{בעוד שנה} =2{בעוד שנתיים} many{בעוד {years} שנה} other{בעוד {years} שנים}}
hi: {years, plural, =0{इस वर्ष} =1{{years} वर्ष में} other{{years} वर्ष में}}
hi_latn: {years, plural, =0{is saal} =1{{years} saal mein} other{{years} saal mein}}
hu: {years, plural, =0{ez az év} =1{{years} év múlva} other{{years} év múlva}}
hy: {years, plural, =0{այս տարի} =1{{years} տարուց} other{{years} տարուց}}
ia: {years, plural, =0{iste anno} =1{in {years} anno} other{in {years} annos}}
id: {years, plural, =0{tahun ini} other{dalam {years} tahun}}
is: {years, plural, =0{á þessu ári} =1{eftir {years} ár} other{eftir {years} ár}}
it: {years, plural, =0{quest’anno} =1{anno prossimo} other{tra {years} anni}}
ja: {years, plural, =0{今年} other{{years} 年後}}
ka: {years, plural, =0{ამ წელს} =1{მომავალ წელს} other{{years} წელიწადში}}
kab: {years, plural, =0{aseggas-a} =1{qabel} other{deg {years} n yiseggasen}}
kk: {years, plural, =1{{years} жылдан кейін} other{{years} жылдан кейін}}
km: {years, plural, =0{ឆ្នាំ​នេះ} other{{years} ឆ្នាំទៀត}}
kn: {years, plural, =0{ಈ ವರ್ಷ} =1{{years} ವರ್ಷದಲ್ಲಿ} other{{years} ವರ್ಷಗಳಲ್ಲಿ}}
ko: {years, plural, =0{올해} other{{years}년 후}}
ky: {years, plural, =0{быйыл} =1{эмдиги жылы} other{{years} жылдан кийин}}
lb: {years, plural, =0{dëst Joer} =1{nächst Joer} other{a(n) {years} Joer}}
lo: {years, plural, =0{ປີນີ້} other{ໃນອີກ {years} ປີ}}
lt: {years, plural, =1{po {years} metų} few{po {years} metų} many{po {years} metų} other{po {years} metų}}
lv: {years, plural, =0{šajā gadā} =1{nākamajā gadā} zero{pēc {years} gadiem} other{pēc {years} gadiem}}
mk: {years, plural, =0{оваа година} =1{за {years} година} other{за {years} години}}
ml: {years, plural, =0{ഈ വർ‌ഷം} =1{അടുത്തവർഷം} other{{years} വർഷത്തിൽ}}
mn: {years, plural, =0{энэ жил} =1{{years} жилийн дараа} other{{years} жилийн дараа}}
mr: {years, plural, =0{हे वर्ष} =1{पुढील वर्ष} other{येत्या {years} वर्षांमध्ये}}
ms: {years, plural, =0{tahun ini} =1{tahun depan} other{dalam {years} tahun}}
mt: {years, plural, =0{din is-sena} =1{is-sena d-dieħla} few{fi żmien {years} snin oħra} many{fi żmien {years} snin oħra} other{fi żmien {years} snin oħra}}
my: {years, plural, =0{ယခုနှစ်} other{{years} နှစ်အတွင်း}}
ne: {years, plural, =0{यो वर्ष} =1{आगामी वर्ष} other{{years} वर्षमा}}
nl: {years, plural, =0{dit jaar} =1{over {years} jaar} other{over {years} jaar}}
no: {years, plural, =0{i år} =1{om {years} år} other{om {years} år}}
or: {years, plural, =0{ଏହି ବର୍ଷ} =1{{years} ବର୍ଷରେ} other{{years} ବର୍ଷରେ}}
pa: {years, plural, =0{ਇਹ ਸਾਲ} =1{{years} ਸਾਲ ਵਿੱਚ} other{{years} ਸਾਲਾਂ ਵਿੱਚ}}
pl: {years, plural, =0{w tym roku} =1{za {years} rok} few{za {years} lata} many{za {years} lat} other{za {years} roku}}
ps: {years, plural, =0{سږکال} =1{په {years} کال کې} other{په {years} کالونو کې}}
pt: {years, plural, =0{este ano} =1{em {years} ano} other{em {years} anos}}
pt_pt: {years, plural, =1{dentro de {years} ano} other{dentro de {years} anos}}
ro: {years, plural, =0{anul acesta} =1{anul viitor} few{peste {years} ani} other{peste {years} de ani}}
sc: {years, plural, =1{intro de {years} annu} other{intro de {years} annos}}
sd: {years, plural, =0{پويون سال} =1{{years} سالن ۾} other{{years} سالن ۾}}
se_fi: {years, plural, =0{dán jagi} =1{{years} jagi siste} =2{{years} jagi siste} other{{years} jagi siste}}
si: {years, plural, =0{මෙම වසර} =1{ඊළඟ වසර} other{වසර {years}කින්}}
sk: {years, plural, =0{tento rok} =1{o {years} rok} few{o {years} roky} many{o {years} roka} other{o {years} rokov}}
sl: {years, plural, =0{letos} =1{naslednje leto} =2{čez {years} leti} few{čez {years} leta} other{čez {years} let}}
sq: {years, plural, =0{sivjet} =1{mot} other{pas {years} vjetësh}}
sr: {years, plural, =0{ове године} =1{за {years} годину} few{за {years} године} other{за {years} година}}
sr_latn: {years, plural, =0{ove godine} =1{sledeće godine} few{za {years} godine} other{za {years} godina}}
sv: {years, plural, =0{i år} =1{om {years} år} other{om {years} år}}
sw: {years, plural, =0{mwaka huu} =1{mwaka ujao} other{baada ya miaka {years}}}
ta: {years, plural, =0{இந்த ஆண்டு} =1{{years} ஆண்டில்} other{{years} ஆண்டுகளில்}}
te: {years, plural, =0{ఈ సంవత్సరం} =1{తదుపరి సంవత్సరం} other{{years} సంవత్సరాల్లో}}
tg: {years, plural, =0{соли ҷорӣ} other{пас аз {years} сол}}
th: {years, plural, =0{ปีนี้} =1{ปีหน้า} other{ในอีก {years} ปี}}
tk: {years, plural, =0{şu ýyl} =1{indiki ýyl} other{{years} ýyldan}}
tr: {years, plural, =0{bu yıl} =1{{years} yıl sonra} other{{years} yıl sonra}}
tt: {years, plural, =0{быел} =1{киләсе елда} other{{years} елдан}}
uk: {years, plural, =1{через {years} рік} few{через {years} роки} many{через {years} років} other{через {years} року}}
ur: {years, plural, =0{اس سال} =1{{years} سال میں} other{{years} سال میں}}
uz: {years, plural, =0{shu yil} =1{keyingi yil} other{{years} yildan keyin}}
uz_cyrl: {years, plural, =0{бу йил} =1{кейинги йил} other{{years} йилдан сўнг}}
vi: {years, plural, =0{năm nay} other{sau {years} năm nữa}}
zh: {years, plural, =0{今年} =1{明年} other{{years}年后}}
zh_hant: {years, plural, =0{今年} =1{明年} other{{years} 年後}}
zu: {years, plural, =0{kulo nyaka} =1{unyaka ozayo} other{eminyakeni engu-{years} ezayo}}

# yearsFutureNumeric
source: {years, plural, =1{in {years} year} other{in {years} years}}
as: {years, plural, =1{{years} বছৰত} other{{years} বছৰত}}
bg: {years, plural, =1{след {years} година} other{след {years} години}}
da: {years, plural, =1{om {years} år} other{om {years} år}}
es: {years, plural, =1{dentro de {years} año} other{dentro de {years} años}}
gu: {years, plural, =1{{years} વર્ષમાં} other{{years} વર્ષમાં}}
it: {years, plural, =1{tra {years} anno} other{tra {years} anni}}
ka: {years, plural, =1{{years} წელიწადში} other{{years} წელიწადში}}
kab: {years, plural, =1{deg {years} n useggas} other{deg {years} n yiseggasen}}
ky: {years, plural, =1{{years} жылдан кийин} other{{years} жылдан кийин}}
lb: {years, plural, =1{an {years} Joer} other{a(n) {years} Joer}}
lv: {years, plural, zero{pēc {years} gadiem} =1{pēc {years} gada} other{pēc {years} gadiem}}
ml: {years, plural, =1{{years} വർഷത്തിൽ} other{{years} വർഷത്തിൽ}}
mr: {years, plural, =1{येत्या {years} वर्षामध्ये} other{येत्या {years} वर्षांमध्ये}}
ms: {years, plural, other{dalam {years} tahun}}
mt: {years, plural, =1{fi żmien sena} few{fi żmien {years} snin oħra} many{fi żmien {years} snin oħra} other{fi żmien {years} snin oħra}}
ne: {years, plural, =1{{years} वर्षमा} other{{years} वर्षमा}}
pt_pt: {years, plural, =1{dentro de {years} ano} other{dentro de {years} anos}}
ro: {years, plural, =1{peste {years} an} few{peste {years} ani} other{peste {years} de ani}}
si: {years, plural, =1{වසර {years}කින්} other{වසර {years}කින්}}
sl: {years, plural, =1{čez {years} leto} =2{čez {years} leti} few{čez {years} leta} other{čez {years} let}}
sq: {years, plural, =1{pas {years} viti} other{pas {years} vjetësh}}
sr_latn: {years, plural, =1{za {years} godinu} few{za {years} godine} other{za {years} godina}}
sw: {years, plural, =1{baada ya mwaka {years}} other{baada ya miaka {years}}}
te: {years, plural, =1{{years} సంవత్సరంలో} other{{years} సంవత్సరాల్లో}}
th: {years, plural, other{ในอีก {years} ปี}}
tk: {years, plural, =1{{years} ýyldan} other{{years} ýyldan}}
tt: {years, plural, other{{years} елдан}}
uz: {years, plural, =1{{years} yildan keyin} other{{years} yildan keyin}}
uz_cyrl: {years, plural, =1{{years} йилдан сўнг} other{{years} йилдан сўнг}}
zh: {years, plural, other{{years}年后}}
zh_hant: {years, plural, other{{years} 年後}}
zu: {years, plural, =1{onyakeni ongu-{years} ozayo} other{eminyakeni engu-{years} ezayo}}

# yearsPast
source: {years, plural, =0{this year} =1{last year} other{{years} years ago}}
af: {years, plural, =0{hierdie jaar} =1{{years} jaar gelede} other{{years} jaar gelede}}
am: {years, plural, =0{በዚህ ዓመት} =1{ከ{years} ዓመት በፊት} other{ከ{years} ዓመታት በፊት}}
ar: {years, plural, =0{السنة الحالية} zero{قبل {years} سنة} =1{قبل سنة واحدة} =2{قبل سنتين} few{قبل {years} سنوات} many{قبل {years} سنة} other{قبل {years} سنة}}
as: {years, plural, =0{এই বছৰ} =1{যোৱা বছৰ} other{{years} বছৰৰ পূৰ্বে}}
ast: {years, plural, =0{esti añu} =1{hai {years} añu} other{hai {years} años}}
az: {years, plural, =0{bu il} =1{{years} il öncə} other{{years} il öncə}}
bg: {years, plural, =0{тази година} =1{миналата година} other{преди {years} години}}
bn: {years, plural, =0{এই বছর} =1{{years} বছর পূর্বে} other{{years} বছর পূর্বে}}
br: {years, plural, =0{hevlene} =1{{years} bloaz zo} =2{{years} vloaz zo} few{{years} bloaz zo} many{{years} a vloazioù zo} other{{years} vloaz zo}}
bs: {years, plural, =0{ove godine} =1{prije {years} godinu} few{prije {years} godine} other{prije {years} godina}}
bs_cyrl: {years, plural, =0{ове године} =1{прије {years} годину} few{прије {years} године} other{прије {years} година}}
ca: {years, plural, =1{fa {years} any} other{fa {years} anys}}
cs: {years, plural, =1{před {years} rokem} few{před {years} lety} many{před {years} roku} other{před {years} lety}}
cy: {years, plural, =0{eleni} zero{{years} o flynyddoedd yn ôl} =1{blwyddyn yn ôl} =2{{years} flynedd yn ôl} few{{years} blynedd yn ôl} many{{years} blynedd yn ôl} other{{years} o flynyddoedd yn ôl}}
da: {years, plural, =0{i år} =1{sidste år} other{for {years} år siden}}
de: {years, plural, =0{dieses Jahr} =1{vor {years} Jahr} other{vor {years} Jahren}}
el: {years, plural, =0{φέτος} =1{πριν από {years} έτος} other{πριν από {years} έτη}}
eo: {years, plural, =0{nuna jaro} =1{antaŭ {years} jaro} other{antaŭ {years} jaroj}}
es: {years, plural, =0{este año} =1{el año pasado} other{hace {years} años}}
et: {years, plural, =0{käesolev aasta} =1{{years} aasta eest} other{{years} aasta eest}}
eu: {years, plural, =0{aurten} =1{Duela {years} urte} other{Duela {years} urte}}
fa: {years, plural, =0{امسال} =1{{years} سال پیش} other{{years} سال پیش}}
fi: {years, plural, =0{tänä vuonna} =1{{years} vuosi sitten} other{{years} vuotta sitten}}
fil: {years, plural, =0{ngayong taon} =1{{years} taon ang nakalipas} other{{years} (na) taon ang nakalipas}}
fo: {years, plural, =0{í ár} =1{{years} ár síðan} other{{years} ár síðan}}
fr: {years, plural, =0{cette année} =1{il y a {years} an} other{il y a {years} ans}}
fy: {years, plural, =0{dit jier} =1{{years} jier lyn} other{{years} jier lyn}}
ga: {years, plural, =0{i mbliana} =1{{years} bhliain ó shin} =2{{years} bhliain ó shin} few{{years} bliana ó shin} many{{years} mbliana ó shin} other{{years} bliain ó shin}}
gd: {years, plural, =1{{years} bhliadhna air ais} =2{{years} bhliadhna air ais} few{{years} bhliadhnaichean air ais} other{{years} bliadhna air ais}}
gl: {years, plural, =0{este ano} =1{hai {years} ano} other{hai {years} anos}}
gu: {years, plural, =0{આ વર્ષે} =1{ગયા વર્ષે} other{{years} વર્ષ પહેલાં}}
he: {years, plural, =0{השנה} =1{לפני שנה} =2{לפני שנתיים} many{לפני {years} שנה} other{לפני {years} שנים}}
hi: {years, plural, =0{इस वर्ष} =1{{years} वर्ष पहले} other{{years} वर्ष पहले}}
hi_latn: {years, plural, =0{is saal} =1{{years} saal pehle} other{{years} saal pehle}}
hu: {years, plural, =0{ez az év} =1{{years} évvel ezelőtt} other{{years} évvel ezelőtt}}
hy: {years, plural, =0{այս տարի} =1{{years} տարի առաջ} other{{years} տարի առաջ}}
ia: {years, plural, =0{iste anno} =1{{years} anno retro} other{{years} annos retro}}
id: {years, plural, =0{tahun ini} other{{years} tahun yang lalu}}
is: {years, plural, =0{á þessu ári} =1{fyrir {years} ári} other{fyrir {years} árum}}
it: {years, plural, =0{quest’anno} =1{anno scorso} other{{years} anni fa}}
ja: {years, plural, =0{今年} other{{years} 年前}}
ka: {years, plural, =0{ამ წელს} =1{გასულ წელს} other{{years} წლის წინ}}
kab: {years, plural, =0{aseggas-a} =1{ilindi} other{{years} n yiseggasen aya}}
kk: {years, plural, =1{{years} жыл бұрын} other{{years} жыл бұрын}}
km: {years, plural, =0{ឆ្នាំ​នេះ} other{{years} ឆ្នាំ​មុន}}
kn: {years, plural, =0{ಈ ವರ್ಷ} =1{{years} ವರ್ಷದ ಹಿಂದೆ} other{{years} ವರ್ಷಗಳ ಹಿಂದೆ}}
ko: {years, plural, =0{올해} other{{years}년 전}}
ky: {years, plural, =0{быйыл} =1{былтыр} other{{years} жыл мурун}}
lb: {years, plural, =0{dëst Joer} =1{lescht Joer} other{viru(n) {years} Joer}}
lo: {years, plural, =0{ປີນີ້} other{{years} ປີກ່ອນ}}
lt: {years, plural, =1{prieš {years} metus} few{prieš {years} metus} many{prieš {years} metų} other{prieš {years} metų}}
lv: {years, plural, =0{šajā gadā} =1{pagājušajā gadā} zero{pirms {years} gadiem} other{pirms {years} gadiem}}
mk: {years, plural, =0{оваа година} =1{пред {years} година} other{пред {years} години}}
ml: {years, plural, =0{ഈ വർ‌ഷം} =1{കഴിഞ്ഞ വർഷം} other{{years} വർഷം മുമ്പ്}}
mn: {years, plural, =0{энэ жил} =1{{years} жилийн өмнө} other{{years} жилийн өмнө}}
mr: {years, plural, =0{हे वर्ष} =1{मागील वर्ष} other{{years} वर्षांपूर्वी}}
ms: {years, plural, =0{tahun ini} =1{tahun lalu} other{{years} tahun lalu}}
mt: {years, plural, =0{din is-sena} =1{is-sena l-oħra} few{{years} snin ilu} many{{years} snin ilu} other{{years} snin ilu}}
my: {years, plural, =0{ယခုနှစ်} other{ပြီးခဲ့သည့် {years} နှစ်}}
ne: {years, plural, =0{यो वर्ष} =1{गत वर्ष} other{{years} वर्ष अघि}}
nl: {years, plural, =0{dit jaar} =1{{years} jaar geleden} other{{years} jaar geleden}}
no: {years, plural, =0{i år} =1{for {years} år siden} other{for {years} år siden}}
or: {years, plural, =0{ଏହି ବର୍ଷ} =1{{years} ବର୍ଷ ପୂର୍ବେ} other{{years} ବର୍ଷ ପୂର୍ବେ}}
pa: {years, plural, =0{ਇਹ ਸਾਲ} =1{{years} ਸਾਲ ਪਹਿਲਾਂ} other{{years} ਸਾਲ ਪਹਿਲਾਂ}}
pl: {years, plural, =0{w tym roku} =1{{years} rok temu} few{{years} lata temu} many{{years} lat temu} other{{years} roku temu}}
ps: {years, plural, =0{سږکال} =1{{years} کال مخکې} other{{years} کاله مخکې}}
pt: {years, plural, =0{este ano} =1{há {years} ano} other{há {years} anos}}
ro: {years, plural, =0{anul acesta} =1{anul trecut} few{acum {years} ani} other{acum {years} de ani}}
sc: {years, plural, =1{{years} annu a como} other{{years} annos a como}}
sd: {years, plural, =0{پويون سال} =1{{years} سال پهرين} other{{years} سال پهرين}}
se_fi: {years, plural, =0{dán jagi} =1{diibmá} =2{ovddet jagi} other{{years} jagi dás ovdal}}
si: {years, plural, =0{මෙම වසර} =1{පසුගිය වසර} other{වසර {years}කට පෙර}}
sk: {years, plural, =0{tento rok} =1{pred {years} rokom} few{pred {years} rokmi} many{pred {years} roka} other{pred {years} rokmi}}
sl: {years, plural, =0{letos} =1{lani} =2{pred {years} letoma} few{pred {years} leti} other{pred {years} leti}}
sq: {years, plural, =0{sivjet} =1{vjet} other{{years} vjet më parë}}
sr: {years, plural, =0{ове године} =1{пре {years} године} few{пре {years} године} other{пре {years} година}}
sr_cyrl_ba: {years, plural, =0{ове године} =1{прије {years} године} few{прије {years} године} other{прије {years} година}}
sr_latn: {years, plural, =0{ove godine} =1{prošle godine} few{pre {years} godine} other{pre {years} godina}}
sr_latn_ba: {years, plural, =1{prije {years} godine} few{prije {years} godine} other{prije {years} godina}}
sv: {years, plural, =0{i år} =1{för {years} år sedan} other{för {years} år sedan}}
sw: {years, plural, =0{mwaka huu} =1{mwaka uliopita} other{miaka {years} iliyopita}}
ta: {years, plural, =0{இந்த ஆண்டு} =1{{years} ஆண்டிற்கு முன்} other{{years} ஆண்டுகளுக்கு முன்}}
te: {years, plural, =0{ఈ సంవత్సరం} =1{గత సంవత్సరం} other{{years} సంవత్సరాల క్రితం}}
tg: {years, plural, =0{соли ҷорӣ} other{{years} сол пеш}}
th: {years, plural, =0{ปีนี้} =1{ปีที่แล้ว} other{{years} ปีที่แล้ว}}
tk: {years, plural, =0{şu ýyl} =1{geçen ýyl} other{{years} ýyl öň}}
tr: {years, plural, =0{bu yıl} =1{{years} yıl önce} other{{years} yıl önce}}
tt: {years, plural, =0{быел} =1{узган ел} other{{years} ел элек}}
uk: {years, plural, =1{{years} рік тому} few{{years} роки тому} many{{years} років тому} other{{years} року тому}}
ur: {years, plural, =0{اس سال} =1{{years} سال پہلے} other{{years} سال پہلے}}
uz: {years, plural, =0{shu yil} =1{o‘tgan yil} other{{years} yil oldin}}
uz_cyrl: {years, plural, =0{бу йил} =1{ўтган йил} other{{years} йил аввал}}
vi: {years, plural, =0{năm nay} other{{years} năm trước}}
zh: {years, plural, =0{今年} =1{去年} other{{years}年前}}
zh_hant: {years, plural, =0{今年} =1{去年} other{{years} 年前}}
zu: {years, plural, =0{kulo nyaka} =1{onyakeni odlule} other{{years} iminyaka edlule}}

# yearsPastNumeric
source: {years, plural, =1{{years} year ago} other{{years} years ago}}
as: {years, plural, =1{{years} বছৰৰ পূৰ্বে} other{{years} বছৰৰ পূৰ্বে}}
bg: {years, plural, =1{преди {years} година} other{преди {years} години}}
da: {years, plural, =1{for {years} år siden} other{for {years} år siden}}
es: {years, plural, =1{hace {years} año} other{hace {years} años}}
gu: {years, plural, =1{{years} વર્ષ પહેલાં} other{{years} વર્ષ પહેલાં}}
it: {years, plural, =1{{years} anno fa} other{{years} anni fa}}
ka: {years, plural, =1{{years} წლის წინ} other{{years} წლის წინ}}
kab: {years, plural, =1{{years} n useggas aya} other{{years} n yiseggasen aya}}
ky: {years, plural, =1{{years} жыл мурун} other{{years} жыл мурун}}
lb: {years, plural, =1{virun {years} Joer} other{viru(n) {years} Joer}}
lv: {years, plural, zero{pirms {years} gadiem} =1{pirms {years} gada} other{pirms {years} gadiem}}
ml: {years, plural, =1{{years} വർഷം മുമ്പ്} other{{years} വർഷം മുമ്പ്}}
mr: {years, plural, =1{{years} वर्षापूर्वी} other{{years} वर्षांपूर्वी}}
ms: {years, plural, other{{years} tahun lalu}}
mt: {years, plural, =1{sena ilu} few{{years} snin ilu} many{{years} snin ilu} other{{years} snin ilu}}
ne: {years, plural, =1{{years} वर्ष अघि} other{{years} वर्ष अघि}}
ro: {years, plural, =1{acum {years} an} few{acum {years} ani} other{acum {years} de ani}}
si: {years, plural, =1{වසර {years}කට පෙර} other{වසර {years}කට පෙර}}
sl: {years, plural, =1{pred {years} letom} =2{pred {years} letoma} few{pred {years} leti} other{pred {years} leti}}
sq: {years, plural, =1{{years} vit më parë} other{{years} vjet më parë}}
sr_latn: {years, plural, =1{pre {years} godine} few{pre {years} godine} other{pre {years} godina}}
sw: {years, plural, =1{mwaka {years} uliopita} other{miaka {years} iliyopita}}
te: {years, plural, =1{{years} సంవత్సరం క్రితం} other{{years} సంవత్సరాల క్రితం}}
th: {years, plural, other{{years} ปีที่แล้ว}}
tk: {years, plural, =1{{years} ýyl öň} other{{years} ýyl öň}}
tt: {years, plural, other{{years} ел элек}}
uz: {years, plural, =1{{years} yil oldin} other{{years} yil oldin}}
uz_cyrl: {years, plural, =1{{years} йил аввал} other{{years} йил аввал}}
zh: {years, plural, other{{years}年前}}
zh_hant: {years, plural, other{{years} 年前}}
zu: {years, plural, =1{{years} unyaka odlule} other{{years} iminyaka edlule}}
