Repository: Mosc/relative_time
Catalog: lib/src/l10n/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, el, eo, es, et, eu, fa, fi, fil, fo, fr, fy, ga, gd, gl, gu, he, hi, hi_latn, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mk, ml, mn, mr, ms, mt, my, ne, nl, no, or, pa, pl, ps, pt, pt_pt, ro, sc, sd, se_fi, si, sk, sl, sq, sr, sr_cyrl_ba, sr_latn, sr_latn_ba, sv, sw, ta, te, tg, th, tk, tr, tt, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# quartersPastNumeric
source: {quarters, plural, =1{{quarters} quarter ago} other{{quarters} quarters ago}}
as: {quarters, plural, =1{{quarters} তিনি মাহ পূৰ্বে} other{{quarters} তিনি মাহ পূৰ্বে}}
bg: {quarters, plural, =1{преди {quarters} тримесечие} other{преди {quarters} тримесечия}}
da: {quarters, plural, =1{for {quarters} kvartal siden} other{for {quarters} kvartaler siden}}
es: {quarters, plural, =1{hace {quarters} trimestre} other{hace {quarters} trimestres}}
gu: {quarters, plural, =1{{quarters} ત્રિમાસિક પહેલાં} other{{quarters} ત્રિમાસિક પહેલાં}}
it: {quarters, plural, =1{{quarters} trimestre fa} other{{quarters} trimestri fa}}
ka: {quarters, plural, =1{{quarters} კვარტალის წინ} other{{quarters} კვარტალის წინ}}
kab: {quarters, plural, =1{{quarters} n ukraḍyur aya} other{{quarters} n yikraḍyuren aya}}
ky: {quarters, plural, =1{{quarters} чейрек мурун} other{{quarters} чейрек мурун}}
lb: {quarters, plural, =1{virun {quarters} Quartal} other{viru(n) {quarters} Quartaler}}
lv: {quarters, plural, zero{pirms {quarters} ceturkšņiem} =1{pirms {quarters} ceturkšņa} other{pirms {quarters} ceturkšņiem}}
ml: {quarters, plural, =1{{quarters} പാദം മുമ്പ്} other{{quarters} പാദം മുമ്പ്}}
mr: {quarters, plural, =1{{quarters} तिमाहीपूर्वी} other{{quarters} तिमाहींपूर्वी}}
ms: {quarters, plural, other{{quarters} suku tahun lalu}}
mt: {quarters, plural, =1{il-kwart ta’ sena li għadda} few{{quarters} kwarti ta’ sena li għaddew} many{{quarters} kwarti ta’ sena li għaddew} other{{quarters} kwarti ta’ sena li għaddew}}
ne: {quarters, plural, =1{{quarters}सत्र अघि} other{{quarters}सत्र अघि}}
ro: {quarters, plural, =1{acum {quarters} trimestru} few{acum {quarters} trimestre} other{acum {quarters} de trimestre}}
si: {quarters, plural, =1{කාර්තු {quarters}කට පෙර} other{කාර්තු {quarters}කට පෙර}}
sl: {quarters, plural, =1{pred {quarters} četrtletjem} =2{pred {quarters} četrtletjema} few{pred {quarters} četrtletji} other{pred {quarters} četrtletji}}
sq: {quarters, plural, =1{{quarters} tremujor më parë} other{{quarters} tremujorë më parë}}
sr_latn: {quarters, plural, =1{pre {quarters} kvartala} few{pre {quarters} kvartala} other{pre {quarters} kvartala}}
sw: {quarters, plural, =1{robo {quarters} iliyopita} other{robo {quarters} zilizopita}}
te: {quarters, plural, =1{{quarters} త్రైమాసికం క్రితం} other{{quarters} త్రైమాసికాల క్రితం}}
th: {quarters, plural, other{{quarters} ไตรมาสที่แล้ว}}
tk: {quarters, plural, =1{{quarters} çärýek öň} other{{quarters} çärýek öň}}
tt: {quarters, plural, other{{quarters} квартал элек}}
uz: {quarters, plural, =1{{quarters} chorak oldin} other{{quarters} chorak oldin}}
zh: {quarters, plural, other{{quarters}个季度前}}
zh_hant: {quarters, plural, other{{quarters} 季前}}
zu: {quarters, plural, =1{{quarters} ikota edlule} other{{quarters} amakota adlule}}

# monthsFuture
source: {months, plural, =0{this month} =1{next month} other{in {months} months}}
af: {months, plural, =0{vandeesmaand} =1{oor {months} maand} other{oor {months} maande}}
am: {months, plural, =0{በዚህ ወር} =1{በ{months} ወር ውስጥ} other{በ{months} ወራት ውስጥ}}
ar: {months, plural, =0{هذا الشهر} zero{خلال {months} شهر} =1{خلال شهر واحد} =2{خلال شهرين} few{خلال {months} أشهر} many{خلال {months} شهرًا} other{خلال {months} شهر}}
as: {months, plural, =0{এই মাহ} =1{অহা মাহ} other{{months} মাহত}}
ast: {months, plural, =0{esti mes} =1{en {months} mes} other{en {months} meses}}
az: {months, plural, =0{bu ay} =1{{months} ay ərzində} other{{months} ay ərzində}}
bg: {months, plural, =0{този месец} =1{следващ месец} other{след {months} месеца}}
bn: {months, plural, =0{এই মাস} =1{{months} মাসে} other{{months} মাসে}}
br: {months, plural, =0{ar miz-mañ} =1{a-benn {months} miz} =2{a-benn {months} viz} few{a-benn {months} miz} many{a-benn {months} a vizioù} other{a-benn {months} miz}}
bs: {months, plural, =0{ovaj mjesec} =1{za {months} mjesec} few{za {months} mjeseca} other{za {months} mjeseci}}
bs_cyrl: {months, plural, =0{овог мјесеца} =1{за {months} мјесец} few{за {months} мјесеца} other{за {months} мјесеци}}
ca: {months, plural, =1{d’aquí a {months} mes} other{d’aquí a {months} mesos}}
cs: {months, plural, =1{za {months} měsíc} few{za {months} měsíce} many{za {months} měsíce} other{za {months} měsíců}}
cy: {months, plural, =0{y mis hwn} zero{ymhen {months} mis} =1{ymhen mis} =2{ymhen deufis} few{ymhen {months} mis} many{ymhen {months} mis} other{ymhen {months} mis}}
da: {months, plural, =0{denne måned} =1{næste måned} other{om {months} måneder}}
de: {months, plural, =0{diesen Monat} =1{in {months} Monat} other{in {months} Monaten}}
el: {months, plural, =0{τρέχων μήνας} =1{σε {months} μήνα} other{σε {months} μήνες}}
eo: {months, plural, =0{nuna monato} =1{post {months} monato} other{post {months} monatoj}}
es: {months, plural, =0{este mes} =1{el próximo mes} other{dentro de {months} meses}}
et: {months, plural, =0{käesolev kuu} =1{{months} kuu pärast} other{{months} kuu pärast}}
eu: {months, plural, =0{hilabete honetan} =1{{months} hilabete barru} other{{months} hilabete barru}}
fa: {months, plural, =0{این ماه} =1{{months} ماه بعد} other{{months} ماه بعد}}
fi: {months, plural, =0{tässä kuussa} =1{{months} kuukauden päästä} other{{months} kuukauden päästä}}
fil: {months, plural, =0{ngayong buwan} =1{sa {months} buwan} other{sa {months} (na) buwan}}
fo: {months, plural, =0{henda mánaðin} =1{um {months} mánað} other{um {months} mánaðir}}
fr: {months, plural, =0{ce mois-ci} =1{dans {months} mois} other{dans {months} mois}}
fy: {months, plural, =0{dizze moanne} =1{Oer {months} moanne} other{Oer {months} moannen}}
ga: {months, plural, =0{an mhí seo} =1{i gceann {months} mhí} =2{i gceann {months} mhí} few{i gceann {months} mhí} many{i gceann {months} mí} other{i gceann {months} mí}}
gd: {months, plural, =1{an ceann {months} mhìosa} =2{an ceann {months} mhìosa} few{an ceann {months} mìosan} other{an ceann {months} mìosa}}
gl: {months, plural, =0{este mes} =1{en {months} mes} other{en {months} meses}}
gu: {months, plural, =0{આ મહિને} =1{આવતા મહિને} other{{months} મહિનામાં}}
he: {months, plural, =0{החודש} =1{בעוד חודש} =2{בעוד חודשיים} many{בעוד {months} חודשים} other{בעוד {months} חודשים}}
hi: {months, plural, =0{इस माह} =1{{months} माह में} other{{months} माह में}}
hi_latn: {months, plural, =0{is mahine} =1{{months} mahine mein} other{{months} mahine mein}}
hu: {months, plural, =0{ez a hónap} =1{{months} hónap múlva} other{{months} hónap múlva}}
hy: {months, plural, =0{այս ամիս} =1{{months} ամսից} other{{months} ամսից}}
ia: {months, plural, =0{iste mense} =1{in {months} mense} other{in {months} menses}}
id: {months, plural, =0{bulan ini} other{dalam {months} bulan}}
is: {months, plural, =0{í þessum mánuði} =1{eftir {months} mánuð} other{eftir {months} mánuði}}
it: {months, plural, =0{questo mese} =1{mese prossimo} other{tra {months} mesi}}
ja: {months, plural, =0{今月} other{{months} か月後}}
ka: {months, plural, =0{ამ თვეში} =1{მომავალ თვეს} other{{months} თვეში}}
kab: {months, plural, =0{ayyur-a} =1{ayyur i d-itteddun} other{deg {months} n wayyuren}}
kk: {months, plural, =1{{months} айдан кейін} other{{months} айдан кейін}}
km: {months, plural, =0{ខែ​នេះ} other{{months} ខែទៀត}}
kn: {months, plural, =0{ಈ ತಿಂಗಳು} =1{{months} ತಿಂಗಳಲ್ಲಿ} other{{months} ತಿಂಗಳುಗಳಲ್ಲಿ}}
ko: {months, plural, =0{이번 달} other{{months}개월 후}}
ky: {months, plural, =0{бул айда} =1{эмдиги айда} other{{months} айдан кийин}}
lb: {months, plural, =0{dëse Mount} =1{nächste Mount} other{a(n) {months} Méint}}
lo: {months, plural, =0{ເດືອນນີ້} other{ໃນອີກ {months} ເດືອນ}}
lt: {months, plural, =1{po {months} mėnesio} few{po {months} mėnesių} many{po {months} mėnesio} other{po {months} mėnesių}}
lv: {months, plural, =0{šajā mēnesī} =1{nākamajā mēnesī} zero{pēc {months} mēnešiem} other{pēc {months} mēnešiem}}
mk: {months, plural, =0{овој месец} =1{за {months} месец} other{за {months} месеци}}
ml: {months, plural, =0{ഈ മാസം} =1{അടുത്ത മാസം} other{{months} മാസത്തിൽ}}
mn: {months, plural, =0{энэ сар} =1{{months} сарын дараа} other{{months} сарын дараа}}
mr: {months, plural, =0{हा महिना} =1{पुढील महिना} other{येत्या {months} महिन्यांमध्ये}}
ms: {months, plural, =0{bulan ini} =1{bulan depan} other{dalam {months} bulan}}
mt: {months, plural, =0{Dan ix-xahar} =1{Ix-xahar id-dieħel} few{fi {months} xhur oħra} many{fi {months} xhur oħra} other{fi {months} xhur oħra}}
my: {months, plural, =0{ယခုလ} other{{months} လအတွင်း}}
ne: {months, plural, =0{यो महिना} =1{अर्को महिना} other{{months} महिनामा}}
nl: {months, plural, =0{deze maand} =1{over {months} maand} other{over {months} maanden}}
no: {months, plural, =0{denne måneden} =1{om {months} måned} other{om {months} måneder}}
or: {months, plural, =0{ଏହି ମାସ} =1{{months} ମାସରେ} other{{months} ମାସରେ}}
pa: {months, plural, =0{ਇਹ ਮਹੀਨਾ} =1{{months} ਮਹੀਨੇ ਵਿੱਚ} other{{months} ਮਹੀਨਿਆਂ ਵਿੱਚ}}
pl: {months, plural, =0{w tym miesiącu} =1{za {months} miesiąc} few{za {months} miesiące} many{za {months} miesięcy} other{za {months} miesiąca}}
ps: {months, plural, =0{دا مياشت} =1{په {months} مياشت کې} other{په {months} مياشتو کې}}
pt: {months, plural, =0{este mês} =1{em {months} mês} other{em {months} meses}}
pt_pt: {months, plural, =1{dentro de {months} mês} other{dentro de {months} meses}}
ro: {months, plural, =0{luna aceasta} =1{luna viitoare} few{peste {months} luni} other{peste {months} de luni}}
sc: {months, plural, =1{intro de {months} mese} other{intro de {months} meses}}
sd: {months, plural, =0{هن مهيني} =1{{months} مهينن ۾} other{{months} مهينن ۾}}
se_fi: {months, plural, =0{dán mánu} =1{{months} mánu siste} =2{{months} mánu siste} other{{months} mánu siste}}
si: {months, plural, =0{මෙම මාසය} =1{ඊළඟ මාසය} other{මාස {months}කින්}}
sk: {months, plural, =0{tento mesiac} =1{o {months} mesiac} few{o {months} mesiace} many{o {months} mesiaca} other{o {months} mesiacov}}
sl: {months, plural, =0{ta mesec} =1{naslednji mesec} =2{čez {months} meseca} few{čez {months} mesece} other{čez {months} mesecev}}
sq: {months, plural, =0{këtë muaj} =1{muajin e ardhshëm} other{pas {months} muajsh}}
sr: {months, plural, =0{овог месеца} =1{за {months} месец} few{за {months} месеца} other{за {months} месеци}}
sr_cyrl_ba: {months, plural, =0{овог мјесеца} =1{за {months} мјесец} few{за {months} мјесеца} other{за {months} мјесеци}}
sr_latn: {months, plural, =0{ovog meseca} =1{sledećeg meseca} few{za {months} meseca} other{za {months} meseci}}
sr_latn_ba: {months, plural, =1{za {months} mjesec} few{za {months} mjeseca} other{za {months} mjeseci}}
sv: {months, plural, =0{denna månad} =1{om {months} månad} other{om {months} månader}}
sw: {months, plural, =0{mwezi huu} =1{mwezi ujao} other{baada ya miezi {months}}}
ta: {months, plural, =0{இந்த மாதம்} =1{{months} மாதத்தில்} other{{months} மாதங்களில்}}
te: {months, plural, =0{ఈ నెల} =1{తదుపరి నెల} other{{months} నెలల్లో}}
tg: {months, plural, =0{моҳи ҷорӣ} other{пас аз {months} моҳ}}
th: {months, plural, =0{เดือนนี้} =1{เดือนหน้า} other{ในอีก {months} เดือน}}
tk: {months, plural, =0{şu aý} =1{indiki aý} other{{months} aýdan}}
tr: {months, plural, =0{bu ay} =1{{months} ay sonra} other{{months} ay sonra}}
tt: {months, plural, =0{бу айда} =1{киләсе айда} other{{months} айдан}}
uk: {months, plural, =1{через {months} місяць} few{через {months} місяці} many{через {months} місяців} other{через {months} місяця}}
ur: {months, plural, =0{اس ماہ} =1{{months} مہینہ میں} other{{months} مہینے میں}}
uz: {months, plural, =0{shu oy} =1{keyingi oy} other{{months} oydan keyin}}
uz_cyrl: {months, plural, =0{бу ой} =1{кейинги ой} other{{months} ойдан сўнг}}
vi: {months, plural, =0{tháng này} other{sau {months} tháng nữa}}
zh: {months, plural, =0{本月} =1{下个月} other{{months}个月后}}
zh_hant: {months, plural, =0{本月} =1{下個月} other{{months} 個月後}}
zu: {months, plural, =0{le nyanga} =1{inyanga ezayo} other{ezinyangeni ezingu-{months} ezizayo}}

# monthsFutureNumeric
source: {months, plural, =1{in {months} month} other{in {months} months}}
as: {months, plural, =1{{months} মাহত} other{{months} মাহত}}
bg: {months, plural, =1{след {months} месец} other{след {months} месеца}}
da: {months, plural, =1{om {months} måned} other{om {months} måneder}}
es: {months, plural, =1{dentro de {months} mes} other{dentro de {months} meses}}
gu: {months, plural, =1{{months} મહિનામાં} other{{months} મહિનામાં}}
it: {months, plural, =1{tra {months} mese} other{tra {months} mesi}}
ka: {months, plural, =1{{months} თვეში} other{{months} თვეში}}
kab: {months, plural, =1{deg {months} n wayyur} other{deg {months} n wayyuren}}
ky: {months, plural, =1{{months} айдан кийин} other{{months} айдан кийин}}
lb: {months, plural, =1{an {months} Mount} other{a(n) {months} Méint}}
lv: {months, plural, zero{pēc {months} mēnešiem} =1{pēc {months} mēneša} other{pēc {months} mēnešiem}}
ml: {months, plural, =1{{months} മാസത്തിൽ} other{{months} മാസത്തിൽ}}
mr: {months, plural, =1{येत्या {months} महिन्यामध्ये} other{येत्या {months} महिन्यांमध्ये}}
ms: {months, plural, other{dalam {months} bulan}}
mt: {months, plural, =1{sa xahar ieħor} few{fi {months} xhur oħra} many{fi {months} xhur oħra} other{fi {months} xhur oħra}}
ne: {months, plural, =1{{months} महिनामा} other{{months} महिनामा}}
pt_pt: {months, plural, =1{dentro de {months} mês} other{dentro de {months} meses}}
ro: {months, plural, =1{peste {months} lună} few{peste {months} luni} other{peste {months} de luni}}
si: {months, plural, =1{මාස {months}කින්} other{මාස {months}කින්}}
sl: {months, plural, =1{čez {months} mesec} =2{čez {months} meseca} few{čez {months} mesece} other{čez {months} mesecev}}
sq: {months, plural, =1{pas {months} muaji} other{pas {months} muajsh}}
sr_latn: {months, plural, =1{za {months} mesec} few{za {months} meseca} other{za {months} meseci}}
sw: {months, plural, =1{baada ya mwezi {months}} other{baada ya miezi {months}}}
te: {months, plural, =1{{months} నెలలో} other{{months} నెలల్లో}}
th: {months, plural, other{ในอีก {months} เดือน}}
tk: {months, plural, =1{{months} aýdan} other{{months} aýdan}}
tt: {months, plural, other{{months} айдан}}
uz: {months, plural, =1{{months} oydan keyin} other{{months} oydan keyin}}
uz_cyrl: {months, plural, =1{{months} ойдан сўнг} other{{months} ойдан сўнг}}
zh: {months, plural, other{{months}个月后}}
zh_hant: {months, plural, other{{months} 個月後}}
zu: {months, plural, =1{enyangeni engu-{months}} other{ezinyangeni ezingu-{months} ezizayo}}

# monthsPast
source: {months, plural, =0{this month} =1{last month} other{{months} months ago}}
af: {months, plural, =0{vandeesmaand} =1{{months} maand gelede} other{{months} maande gelede}}
am: {months, plural, =0{በዚህ ወር} =1{ከ{months} ወር በፊት} other{ከ{months} ወራት በፊት}}
ar: {months, plural, =0{هذا الشهر} zero{قبل {months} شهر} =1{قبل شهر واحد} =2{قبل شهرين} few{قبل {months} أشهر} many{قبل {months} شهرًا} other{قبل {months} شهر}}
as: {months, plural, =0{এই মাহ} =1{যোৱা মাহ} other{{months} মাহ পূৰ্বে}}
ast: {months, plural, =0{esti mes} =1{hai {months} mes} other{hai {months} meses}}
az: {months, plural, =0{bu ay} =1{{months} ay öncə} other{{months} ay öncə}}
bg: {months, plural, =0{този месец} =1{предходен месец} other{преди {months} месеца}}
bn: {months, plural, =0{এই মাস} =1{{months} মাস আগে} other{{months} মাস আগে}}
br: {months, plural, =0{ar miz-mañ} =1{{months} miz zo} =2{{months} viz zo} few{{months} miz zo} many{{months} a vizioù zo} other{{months} miz zo}}
bs: {months, plural, =0{ovaj mjesec} =1{prije {months} mjesec} few{prije {months} mjeseca} other{prije {months} mjeseci}}
bs_cyrl: {months, plural, =0{овог мјесеца} =1{прије {months} мјесец} few{прије {months} мјесеца} other{прије {months} мјесеци}}
ca: {months, plural, =1{fa {months} mes} other{fa {months} mesos}}
cs: {months, plural, =1{před {months} měsícem} few{před {months} měsíci} many{před {months} měsíce} other{před {months} měsíci}}
cy: {months, plural, =0{y mis hwn} zero{{months} mis yn ôl} =1{{months} mis yn ôl} =2{{months} fis yn ôl} few{{months} mis yn ôl} many{{months} mis yn ôl} other{{months} mis yn ôl}}
da: {months, plural, =0{denne måned} =1{sidste måned} other{for {months} måneder siden}}
de: {months, plural, =0{diesen Monat} =1{vor {months} Monat} other{vor {months} Monaten}}
el: {months, plural, =0{τρέχων μήνας} =1{πριν από {months} μήνα} other{πριν από {months} μήνες}}
eo: {months, plural, =0{nuna monato} =1{antaŭ {months} monato} other{antaŭ {months} monatoj}}
es: {months, plural, =0{este mes} =1{el mes pasado} other{hace {months} meses}}
et: {months, plural, =0{käesolev kuu} =1{{months} kuu eest} other{{months} kuu eest}}
eu: {months, plural, =0{hilabete honetan} =1{Duela {months} hilabete} other{Duela {months} hilabete}}
fa: {months, plural, =0{این ماه} =1{{months} ماه پیش} other{{months} ماه پیش}}
fi: {months, plural, =0{tässä kuussa} =1{{months} kuukausi sitten} other{{months} kuukautta sitten}}
fil: {months, plural, =0{ngayong buwan} =1{{months} buwan ang nakalipas} other{{months} (na) buwan ang nakalipas}}
fo: {months, plural, =0{henda mánaðin} =1{{months} mánað síðan} other{{months} mánaðir síðan}}
fr: {months, plural, =0{ce mois-ci} =1{il y a {months} mois} other{il y a {months} mois}}
fy: {months, plural, =0{dizze moanne} =1{{months} moanne lyn} other{{months} moannen lyn}}
ga: {months, plural, =0{an mhí seo} =1{{months} mhí ó shin} =2{{months} mhí ó shin} few{{months} mhí ó shin} many{{months} mí ó shin} other{{months} mí ó shin}}
gd: {months, plural, =1{{months} mhìos air ais} =2{{months} mhìos air ais} few{{months} mìosan air ais} other{{months} mìos air ais}}
gl: {months, plural, =0{este mes} =1{hai {months} mes} other{hai {months} meses}}
gu: {months, plural, =0{આ મહિને} =1{ગયા મહિને} other{{months} મહિના પહેલાં}}
he: {months, plural, =0{החודש} =1{לפני חודש} =2{לפני חודשיים} many{לפני {months} חודשים} other{לפני {months} חודשים}}
hi: {months, plural, =0{इस माह} =1{{months} माह पहले} other{{months} माह पहले}}
hi_latn: {months, plural, =0{is mahine} =1{{months} mahine pehle} other{{months} mahine pehle}}
hu: {months, plural, =0{ez a hónap} =1{{months} hónappal ezelőtt} other{{months} hónappal ezelőtt}}
hy: {months, plural, =0{այս ամիս} =1{{months} ամիս առաջ} other{{months} ամիս առաջ}}
ia: {months, plural, =0{iste mense} =1{{months} mense retro} other{{months} menses retro}}
id: {months, plural, =0{bulan ini} other{{months} bulan yang lalu}}
is: {months, plural, =0{í þessum mánuði} =1{fyrir {months} mánuði} other{fyrir {months} mánuðum}}
it: {months, plural, =0{questo mese} =1{mese scorso} other{{months} mesi fa}}
ja: {months, plural, =0{今月} other{{months} か月前}}
ka: {months, plural, =0{ამ თვეში} =1{გასულ თვეს} other{{months} თვის წინ}}
kab: {months, plural, =0{ayyur-a} =1{ayyur izrin} other{{months} n wayyuren aya}}
kk: {months, plural, =1{{months} ай бұрын} other{{months} ай бұрын}}
km: {months, plural, =0{ខែ​នេះ} other{{months} ខែមុន}}
kn: {months, plural, =0{ಈ ತಿಂಗಳು} =1{{months} ತಿಂಗಳ ಹಿಂದೆ} other{{months} ತಿಂಗಳುಗಳ ಹಿಂದೆ}}
ko: {months, plural, =0{이번 달} other{{months}개월 전}}
ky: {months, plural, =0{бул айда} =1{өткөн айда} other{{months} ай мурун}}
lb: {months, plural, =0{dëse Mount} =1{leschte Mount} other{viru(n) {months} Méint}}
lo: {months, plural, =0{ເດືອນນີ້} other{{months} ເດືອນກ່ອນ}}
lt: {months, plural, =1{prieš {months} mėnesį} few{prieš {months} mėnesius} many{prieš {months} mėnesio} other{prieš {months} mėnesių}}
lv: {months, plural, =0{šajā mēnesī} =1{pagājušajā mēnesī} zero{pirms {months} mēnešiem} other{pirms {months} mēnešiem}}
mk: {months, plural, =0{овој месец} =1{пред {months} месец} other{пред {months} месеци}}
ml: {months, plural, =0{ഈ മാസം} =1{കഴിഞ്ഞ മാസം} other{{months} മാസം മുമ്പ്}}
mn: {months, plural, =0{энэ сар} =1{{months} сарын өмнө} other{{months} сарын өмнө}}
mr: {months, plural, =0{हा महिना} =1{मागील महिना} other{{months} महिन्यांपूर्वी}}
ms: {months, plural, =0{bulan ini} =1{bulan lalu} other{{months} bulan lalu}}
mt: {months, plural, =0{Dan ix-xahar} =1{Ix-xahar li għadda} few{{months} xhur ilu} many{{months} xhur ilu} other{{months} xhur ilu}}
my: {months, plural, =0{ယခုလ} other{ပြီးခဲ့သည့် {months} လ}}
ne: {months, plural, =0{यो महिना} =1{गत महिना} other{{months} महिना पहिले}}
nl: {months, plural, =0{deze maand} =1{{months} maand geleden} other{{months} maanden geleden}}
no: {months, plural, =0{denne måneden} =1{for {months} måned siden} other{for {months} måneder siden}}
or: {months, plural, =0{ଏହି ମାସ} =1{{months} ମାସ ପୂର୍ବେ} other{{months} ମାସ ପୂର୍ବେ}}
pa: {months, plural, =0{ਇਹ ਮਹੀਨਾ} =1{{months} ਮਹੀਨਾ ਪਹਿਲਾਂ} other{{months} ਮਹੀਨੇ ਪਹਿਲਾਂ}}
pl: {months, plural, =0{w tym miesiącu} =1{{months} miesiąc temu} few{{months} miesiące temu} many{{months} miesięcy temu} other{{months} miesiąca temu}}
ps: {months, plural, =0{دا مياشت} =1{{months} مياشت مخکې} other{{months} مياشتې مخکې}}
pt: {months, plural, =0{este mês} =1{há {months} mês} other{há {months} meses}}
ro: {months, plural, =0{luna aceasta} =1{luna trecută} few{acum {months} luni} other{acum {months} de luni}}
sc: {months, plural, =1{{months} mese a como} other{{months} meses a como}}
sd: {months, plural, =0{هن مهيني} =1{{months} مهينا پهرين} other{{months} مهينا پهرين}}
se_fi: {months, plural, =0{dán mánu} =1{{months} mánnu dás ovdal} =2{{months} mánu dás ovdal} other{{months} mánu dás ovdal}}
si: {months, plural, =0{මෙම මාසය} =1{පසුගිය මාසය} other{මාස {months}කට පෙර}}
sk: {months, plural, =0{tento mesiac} =1{pred {months} mesiacom} few{pred {months} mesiacmi} many{pred {months} mesiaca} other{pred {months} mesiacmi}}
sl: {months, plural, =0{ta mesec} =1{prejšnji mesec} =2{pred {months} mesecema} few{pred {months} meseci} other{pred {months} meseci}}
sq: {months, plural, =0{këtë muaj} =1{muajin e kaluar} other{{months} muaj më parë}}
sr: {months, plural, =0{овог месеца} =1{пре {months} месеца} few{пре {months} месеца} other{пре {months} месеци}}
sr_cyrl_ba: {months, plural, =0{овог мјесеца} =1{прије {months} мјесеца} few{прије {months} мјесеца} other{прије {months} мјесеци}}
sr_latn: {months, plural, =0{ovog meseca} =1{prošlog meseca} few{pre {months} meseca} other{pre {months} meseci}}
sr_latn_ba: {months, plural, =1{prije {months} mjeseca} few{prije {months} mjeseca} other{prije {months} mjeseci}}
sv: {months, plural, =0{denna månad} =1{för {months} månad sedan} other{för {months} månader sedan}}
sw: {months, plural, =0{mwezi huu} =1{mwezi uliopita} other{miezi {months} iliyopita}}
ta: {months, plural, =0{இந்த மாதம்} =1{{months} மாதத்துக்கு முன்} other{{months} மாதங்களுக்கு முன்}}
te: {months, plural, =0{ఈ నెల} =1{గత నెల} other{{months} నెలల క్రితం}}
tg: {months, plural, =0{моҳи ҷорӣ} other{{months} моҳ пеш}}
th: {months, plural, =0{เดือนนี้} =1{เดือนที่แล้ว} other{{months} เดือนที่ผ่านมา}}
tk: {months, plural, =0{şu aý} =1{geçen aý} other{{months} aý öň}}
tr: {months, plural, =0{bu ay} =1{{months} ay önce} other{{months} ay önce}}
tt: {months, plural, =0{бу айда} =1{узган айда} other{{months} ай элек}}
uk: {months, plural, =1{{months} місяць тому} few{{months} місяці тому} many{{months} місяців тому} other{{months} місяця тому}}
ur: {months, plural, =0{اس ماہ} =1{{months} مہینہ پہلے} other{{months} مہینے پہلے}}
uz: {months, plural, =0{shu oy} =1{o‘tgan oy} other{{months} oy oldin}}
uz_cyrl: {months, plural, =0{бу ой} =1{ўтган ой} other{{months} ой аввал}}
vi: {months, plural, =0{tháng này} other{{months} tháng trước}}
zh: {months, plural, =0{本月} =1{上个月} other{{months}个月前}}
zh_hant: {months, plural, =0{本月} =1{上個月} other{{months} 個月前}}
zu: {months, plural, =0{le nyanga} =1{inyanga edlule} other{{months} izinyanga ezedlule}}
