Repository: Mosc/relative_time
Catalog: lib/src/l10n/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, el, eo, es, et, eu, fa, fi, fil, fo, fr, fy, ga, gd, gl, gu, he, hi, hi_latn, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mk, ml, mn, mr, ms, mt, my, ne, nl, no, or, pa, pl, ps, pt, pt_pt, ro, sc, sd, se_fi, si, sk, sl, sq, sr, sr_cyrl_ba, sr_latn, sr_latn_ba, sv, sw, ta, te, tg, th, tk, tr, tt, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# hoursFuture
source: {hours, plural, =0{this hour} =1{in {hours} hour} other{in {hours} hours}}
af: {hours, plural, =0{hierdie uur} =1{oor {hours} uur} other{oor {hours} uur}}
am: {hours, plural, =0{ይህ ሰዓት} =1{በ{hours} ሰዓት ውስጥ} other{በ{hours} ሰዓቶች ውስጥ}}
ar: {hours, plural, =0{الساعة الحالية} zero{خلال {hours} ساعة} =1{خلال ساعة واحدة} =2{خلال ساعتين} few{خلال {hours} ساعات} many{خلال {hours} ساعة} other{خلال {hours} ساعة}}
as: {hours, plural, =0{এইটো ঘণ্টাত} =1{{hours} ঘণ্টাত} other{{hours} ঘণ্টাত}}
ast: {hours, plural, =0{esta hora} =1{en {hours} hora} other{en {hours} hores}}
az: {hours, plural, =0{bu saat} =1{{hours} saat ərzində} other{{hours} saat ərzində}}
bg: {hours, plural, =0{в този час} =1{след {hours} час} other{след {hours} часа}}
bn: {hours, plural, =0{এই ঘণ্টায়} =1{{hours} ঘন্টায়} other{{hours} ঘন্টায়}}
br: {hours, plural, =0{dʼan eur-mañ} =1{a-benn {hours} eur} =2{a-benn {hours} eur} few{a-benn {hours} eur} many{a-benn {hours} a eurioù} other{a-benn {hours} eur}}
bs: {hours, plural, =0{ovaj sat} =1{za {hours} sat} few{za {hours} sata} other{za {hours} sati}}
bs_cyrl: {hours, plural, =0{овог сата} =1{за {hours} сат} few{за {hours} сата} other{за {hours} сати}}
ca: {hours, plural, =1{d’aquí a {hours} hora} other{d’aquí a {hours} hores}}
cs: {hours, plural, =1{za {hours} hodinu} few{za {hours} hodiny} many{za {hours} hodiny} other{za {hours} hodin}}
cy: {hours, plural, =0{yr awr hon} zero{ymhen {hours} awr} =1{ymhen awr} =2{ymhen {hours} awr} few{ymhen {hours} awr} many{ymhen {hours} awr} other{ymhen {hours} awr}}
da: {hours, plural, =0{denne time} =1{om {hours} time} other{om {hours} timer}}
de: {hours, plural, =0{in dieser Stunde} =1{in {hours} Stunde} other{in {hours} Stunden}}
el: {hours, plural, =0{τρέχουσα ώρα} =1{σε {hours} ώρα} other{σε {hours} ώρες}}
eo: {hours, plural, =1{post {hours} horo} other{post {hours} horoj}}
es: {hours, plural, =0{esta hora} =1{dentro de {hours} hora} other{dentro de {hours} horas}}
et: {hours, plural, =0{praegusel tunnil} =1{{hours} tunni pärast} other{{hours} tunni pärast}}
eu: {hours, plural, =0{ordu honetan} =1{{hours} ordu barru} other{{hours} ordu barru}}
fa: {hours, plural, =0{همین ساعت} =1{{hours} ساعت بعد} other{{hours} ساعت بعد}}
fi: {hours, plural, =0{tämän tunnin aikana} =1{{hours} tunnin päästä} other{{hours} tunnin päästä}}
fil: {hours, plural, =0{ngayong oras} =1{sa {hours} oras} other{sa {hours} (na) oras}}
fo: {hours, plural, =0{hendan tíman} =1{um {hours} tíma} other{um {hours} tímar}}
fr: {hours, plural, =0{cette heure-ci} =1{dans {hours} heure} other{dans {hours} heures}}
fy: {hours, plural, =1{Oer {hours} oere} other{Oer {hours} oere}}
ga: {hours, plural, =0{an uair seo} =1{i gceann {hours} uair an chloig} =2{i gceann {hours} uair an chloig} few{i gceann {hours} uair an chloig} many{i gceann {hours} n-uaire an chloig} other{i gceann {hours} uair an chloig}}
gd: {hours, plural, =1{an ceann {hours} uair a thìde} =2{an ceann {hours} uair a thìde} few{an ceann {hours} uairean a thìde} other{an ceann {hours} uair a thìde}}
gl: {hours, plural, =0{esta hora} =1{en {hours} hora} other{en {hours} horas}}
gu: {hours, plural, =0{આ કલાક} =1{{hours} કલાકમાં} other{{hours} કલાકમાં}}
he: {hours, plural, =0{בשעה זו} =1{בעוד שעה} =2{בעוד שעתיים} many{בעוד {hours} שעות} other{בעוד {hours} שעות}}
hi: {hours, plural, =0{यह घंटा} =1{{hours} घंटे में} other{{hours} घंटे में}}
hi_latn: {hours, plural, =0{yeh ghanta} =1{{hours} ghante mein} other{{hours} ghante mein}}
hu: {hours, plural, =0{ebben az órában} =1{{hours} óra múlva} other{{hours} óra múlva}}
hy: {hours, plural, =0{այս ժամին} =1{{hours} ժամից} other{{hours} ժամից}}
ia: {hours, plural, =0{iste hora} =1{in {hours} hora} other{in {hours} horas}}
id: {hours, plural, =0{jam ini} other{dalam {hours} jam}}
is: {hours, plural, =0{þessa stundina} =1{eftir {hours} klukkustund} other{eftir {hours} klukkustundir}}
it: {hours, plural, =0{quest’ora} =1{tra {hours} ora} other{tra {hours} ore}}
ja: {hours, plural, =0{1 時間以内} other{{hours} 時間後}}
ka: {hours, plural, =0{ამ საათში} =1{{hours} საათში} other{{hours} საათში}}
kab: {hours, plural, =0{asrag-agi} =1{deg {hours} n usrag} other{deg {hours} n isragen}}
kk: {hours, plural, =1{{hours} сағаттан кейін} other{{hours} сағаттан кейін}}
km: {hours, plural, =0{ម៉ោងនេះ} other{ក្នុង​រយៈ​ពេល {hours} ម៉ោង}}
kn: {hours, plural, =0{ಈ ಗಂಟೆ} =1{{hours} ಗಂಟೆಯಲ್ಲಿ} other{{hours} ಗಂಟೆಗಳಲ್ಲಿ}}
ko: {hours, plural, =0{현재 시간} other{{hours}시간 후}}
ky: {hours, plural, =0{ушул саатта} =1{{hours} сааттан кийин} other{{hours} сааттан кийин}}
lb: {hours, plural, =1{an {hours} Stonn} other{a(n) {hours} Stonnen}}
lo: {hours, plural, =0{ຊົ່ວໂມງນີ້} other{ໃນອີກ {hours} ຊົ່ວໂມງ}}
lt: {hours, plural, =1{po {hours} valandos} few{po {hours} valandų} many{po {hours} valandos} other{po {hours} valandų}}
lv: {hours, plural, =0{šajā stundā} zero{pēc {hours} stundām} =1{pēc {hours} stundas} other{pēc {hours} stundām}}
mk: {hours, plural, =0{часов} =1{за {hours} час} other{за {hours} часа}}
ml: {hours, plural, =0{ഈ മണിക്കൂറിൽ} =1{{hours} മണിക്കൂറിൽ} other{{hours} മണിക്കൂറിൽ}}
mn: {hours, plural, =0{энэ цаг} =1{{hours} цагийн дараа} other{{hours} цагийн дараа}}
mr: {hours, plural, =0{तासात} =1{{hours} तासामध्ये} other{{hours} तासांमध्ये}}
ms: {hours, plural, =0{jam ini} other{dalam {hours} jam}}
mt: {hours, plural, =0{din is-siegħa} =1{fi żmien siegħa oħra} few{fi żmien {hours} sigħat} many{fi żmien{hours} sigħat} other{fi żmien {hours} sigħat}}
my: {hours, plural, =0{ဤအချိန်} other{{hours} နာရီအတွင်း}}
ne: {hours, plural, =0{यस घडीमा} =1{{hours} घण्टामा} other{{hours} घण्टामा}}
nl: {hours, plural, =0{binnen een uur} =1{over {hours} uur} other{over {hours} uur}}
no: {hours, plural, =0{denne timen} =1{om {hours} time} other{om {hours} timer}}
or: {hours, plural, =0{ଏହି ଘଣ୍ଟା} =1{{hours} ଘଣ୍ଟାରେ} other{{hours} ଘଣ୍ଟାରେ}}
pa: {hours, plural, =0{ਇਸ ਘੰਟੇ} =1{{hours} ਘੰਟੇ ਵਿੱਚ} other{{hours} ਘੰਟਿਆਂ ਵਿੱਚ}}
pl: {hours, plural, =0{ta godzina} =1{za {hours} godzinę} few{za {hours} godziny} many{za {hours} godzin} other{za {hours} godziny}}
ps: {hours, plural, =0{دا ساعت} =1{په {hours} ساعت کې} other{په {hours} ساعتو کې}}
pt: {hours, plural, =0{esta hora} =1{em {hours} hora} other{em {hours} horas}}
pt_pt: {hours, plural, =1{dentro de {hours} hora} other{dentro de {hours} horas}}
ro: {hours, plural, =0{ora aceasta} =1{peste {hours} oră} few{peste {hours} ore} other{peste {hours} de ore}}
sc: {hours, plural, =1{intro de {hours} ora} other{intro de {hours} oras}}
sd: {hours, plural, =0{هن ڪلڪ} =1{{hours} ڪلاڪ ۾} other{{hours} ڪلاڪ ۾}}
se_fi: {hours, plural, =0{dán diimmu} =1{{hours} diimmu siste} =2{{hours} diimmu siste} other{{hours} diimmu siste}}
si: {hours, plural, =0{මෙම පැය} =1{පැය {hours}කින්} other{පැය {hours}කින්}}
sk: {hours, plural, =0{v tejto hodine} =1{o {hours} hodinu} few{o {hours} hodiny} many{o {hours} hodiny} other{o {hours} hodín}}
sl: {hours, plural, =0{v tej uri} =1{čez {hours} uro} =2{čez {hours} uri} few{čez {hours} ure} other{čez {hours} ur}}
sq: {hours, plural, =0{këtë orë} =1{pas {hours} ore} other{pas {hours} orësh}}
sr: {hours, plural, =0{овог сата} =1{за {hours} сат} few{за {hours} сата} other{за {hours} сати}}
sr_latn: {hours, plural, =0{ovog sata} =1{za {hours} sat} few{za {hours} sata} other{za {hours} sati}}
sv: {hours, plural, =0{denna timme} =1{om {hours} timme} other{om {hours} timmar}}
sw: {hours, plural, =0{saa hii} =1{baada ya saa {hours}} other{baada ya saa {hours}}}
ta: {hours, plural, =0{இந்த ஒரு மணிநேரத்தில்} =1{{hours} மணிநேரத்தில்} other{{hours} மணிநேரத்தில்}}
te: {hours, plural, =0{ఈ గంట} =1{{hours} గంటలో} other{{hours} గంటల్లో}}
tg: {hours, plural, =0{соати ҷорӣ} other{пас аз {hours} соат}}
th: {hours, plural, =0{ชั่วโมงนี้} other{ในอีก {hours} ชั่วโมง}}
tk: {hours, plural, =0{şu sagat} =1{{hours} sagatdan} other{{hours} sagatdan}}
tr: {hours, plural, =0{bu saat} =1{{hours} saat sonra} other{{hours} saat sonra}}
tt: {hours, plural, =0{бу сәгатьтә} other{{hours} сәгатьтән}}
uk: {hours, plural, =1{через {hours} годину} few{через {hours} години} many{через {hours} годин} other{через {hours} години}}
ur: {hours, plural, =0{اس گھنٹے} =1{{hours} گھنٹے میں} other{{hours} گھنٹے میں}}
uz: {hours, plural, =0{shu soatda} =1{{hours} soatdan keyin} other{{hours} soatdan keyin}}
uz_cyrl: {hours, plural, =1{{hours} соатдан сўнг} other{{hours} соатдан сўнг}}
vi: {hours, plural, =0{giờ này} other{sau {hours} giờ nữa}}
zh: {hours, plural, =0{这一时间 / 此时} other{{hours}小时后}}
zh_hant: {hours, plural, =0{這一小時} other{{hours} 小時後}}
zu: {hours, plural, =0{leli hora} =1{ehoreni elingu-{hours} elizayo} other{emahoreni angu-{hours} ezayo}}

# hoursFutureNumeric
source: {hours, plural, =1{in {hours} hour} other{in {hours} hours}}
as: {hours, plural, =1{{hours} ঘণ্টাত} other{{hours} ঘণ্টাত}}
bg: {hours, plural, =1{след {hours} час} other{след {hours} часа}}
da: {hours, plural, =1{om {hours} time} other{om {hours} timer}}
es: {hours, plural, =1{dentro de {hours} hora} other{dentro de {hours} horas}}
gu: {hours, plural, =1{{hours} કલાકમાં} other{{hours} કલાકમાં}}
it: {hours, plural, =1{tra {hours} ora} other{tra {hours} ore}}
ka: {hours, plural, =1{{hours} საათში} other{{hours} საათში}}
kab: {hours, plural, =1{deg {hours} n usrag} other{deg {hours} n isragen}}
ky: {hours, plural, =1{{hours} сааттан кийин} other{{hours} сааттан кийин}}
lb: {hours, plural, =1{an {hours} Stonn} other{a(n) {hours} Stonnen}}
lv: {hours, plural, zero{pēc {hours} stundām} =1{pēc {hours} stundas} other{pēc {hours} stundām}}
ml: {hours, plural, =1{{hours} മണിക്കൂറിൽ} other{{hours} മണിക്കൂറിൽ}}
mr: {hours, plural, =1{{hours} तासामध्ये} other{{hours} तासांमध्ये}}
ms: {hours, plural, other{dalam {hours} jam}}
mt: {hours, plural, =1{fi żmien siegħa oħra} few{fi żmien {hours} sigħat} many{fi żmien{hours} sigħat} other{fi żmien {hours} sigħat}}
ne: {hours, plural, =1{{hours} घण्टामा} other{{hours} घण्टामा}}
pt_pt: {hours, plural, =1{dentro de {hours} hora} other{dentro de {hours} horas}}
ro: {hours, plural, =1{peste {hours} oră} few{peste {hours} ore} other{peste {hours} de ore}}
si: {hours, plural, =1{පැය {hours}කින්} other{පැය {hours}කින්}}
sl: {hours, plural, =1{čez {hours} uro} =2{čez {hours} uri} few{čez {hours} ure} other{čez {hours} ur}}
sq: {hours, plural, =1{pas {hours} ore} other{pas {hours} orësh}}
sr_latn: {hours, plural, =1{za {hours} sat} few{za {hours} sata} other{za {hours} sati}}
sw: {hours, plural, =1{baada ya saa {hours}} other{baada ya saa {hours}}}
te: {hours, plural, =1{{hours} గంటలో} other{{hours} గంటల్లో}}
th: {hours, plural, other{ในอีก {hours} ชั่วโมง}}
tk: {hours, plural, =1{{hours} sagatdan} other{{hours} sagatdan}}
tt: {hours, plural, other{{hours} сәгатьтән}}
uz: {hours, plural, =1{{hours} soatdan keyin} other{{hours} soatdan keyin}}
uz_cyrl: {hours, plural, =1{{hours} соатдан сўнг} other{{hours} соатдан сўнг}}
zh: {hours, plural, other{{hours}小时后}}
zh_hant: {hours, plural, other{{hours} 小時後}}
zu: {hours, plural, =1{ehoreni elingu-{hours} elizayo} other{emahoreni angu-{hours} ezayo}}

# hoursPast
source: {hours, plural, =0{this hour} =1{{hours} hour ago} other{{hours} hours ago}}
af: {hours, plural, =0{hierdie uur} =1{{hours} uur gelede} other{{hours} uur gelede}}
am: {hours, plural, =0{ይህ ሰዓት} =1{ከ{hours} ሰዓት በፊት} other{ከ{hours} ሰዓቶች በፊት}}
ar: {hours, plural, =0{الساعة الحالية} zero{قبل {hours} ساعة} =1{قبل ساعة واحدة} =2{قبل ساعتين} few{قبل {hours} ساعات} many{قبل {hours} ساعة} other{قبل {hours} ساعة}}
as: {hours, plural, =0{এইটো ঘণ্টাত} =1{{hours} ঘণ্টা পূৰ্বে} other{{hours} ঘণ্টা পূৰ্বে}}
ast: {hours, plural, =0{esta hora} =1{hai {hours} hora} other{hai {hours} hores}}
az: {hours, plural, =0{bu saat} =1{{hours} saat öncə} other{{hours} saat öncə}}
bg: {hours, plural, =0{в този час} =1{преди {hours} час} other{преди {hours} часа}}
bn: {hours, plural, =0{এই ঘণ্টায়} =1{{hours} ঘন্টা আগে} other{{hours} ঘন্টা আগে}}
br: {hours, plural, =0{dʼan eur-mañ} =1{{hours} eur zo} =2{{hours} eur zo} few{{hours} eur zo} many{{hours} a eurioù zo} other{{hours} eur zo}}
bs: {hours, plural, =0{ovaj sat} =1{prije {hours} sat} few{prije {hours} sata} other{prije {hours} sati}}
bs_cyrl: {hours, plural, =0{овог сата} =1{прије {hours} сат} few{прије {hours} сата} other{прије {hours} сати}}
ca: {hours, plural, =1{fa {hours} hora} other{fa {hours} hores}}
cs: {hours, plural, =1{před {hours} hodinou} few{před {hours} hodinami} many{před {hours} hodiny} other{před {hours} hodinami}}
cy: {hours, plural, =0{yr awr hon} zero{{hours} awr yn ôl} =1{{hours} awr yn ôl} =2{{hours} awr yn ôl} few{{hours} awr yn ôl} many{{hours} awr yn ôl} other{{hours} awr yn ôl}}
da: {hours, plural, =0{denne time} =1{for {hours} time siden} other{for {hours} timer siden}}
de: {hours, plural, =0{in dieser Stunde} =1{vor {hours} Stunde} other{vor {hours} Stunden}}
el: {hours, plural, =0{τρέχουσα ώρα} =1{πριν από {hours} ώρα} other{πριν από {hours} ώρες}}
eo: {hours, plural, =1{antaŭ {hours} horo} other{antaŭ {hours} horoj}}
es: {hours, plural, =0{esta hora} =1{hace {hours} hora} other{hace {hours} horas}}
et: {hours, plural, =0{praegusel tunnil} =1{{hours} tunni eest} other{{hours} tunni eest}}
eu: {hours, plural, =0{ordu honetan} =1{Duela {hours} ordu} other{Duela {hours} ordu}}
fa: {hours, plural, =0{همین ساعت} =1{{hours} ساعت پیش} other{{hours} ساعت پیش}}
fi: {hours, plural, =0{tämän tunnin aikana} =1{{hours} tunti sitten} other{{hours} tuntia sitten}}
fil: {hours, plural, =0{ngayong oras} =1{{hours} oras ang nakalipas} other{{hours} (na) oras ang nakalipas}}
fo: {hours, plural, =0{hendan tíman} =1{{hours} tími síðan} other{{hours} tímar síðan}}
fr: {hours, plural, =0{cette heure-ci} =1{il y a {hours} heure} other{il y a {hours} heures}}
fy: {hours, plural, =1{{hours} oere lyn} other{{hours} oere lyn}}
ga: {hours, plural, =0{an uair seo} =1{{hours} uair an chloig ó shin} =2{{hours} uair an chloig ó shin} few{{hours} uair an chloig ó shin} many{{hours} n-uaire an chloig ó shin} other{{hours} uair an chloig ó shin}}
gd: {hours, plural, =1{{hours} uair a thìde air ais} =2{{hours} uair a thìde air ais} few{{hours} uairean a thìde air ais} other{{hours} uair a thìde air ais}}
gl: {hours, plural, =0{esta hora} =1{hai {hours} hora} other{hai {hours} horas}}
gu: {hours, plural, =0{આ કલાક} =1{{hours} કલાક પહેલાં} other{{hours} કલાક પહેલાં}}
he: {hours, plural, =0{בשעה זו} =1{לפני שעה} =2{לפני שעתיים} many{לפני {hours} שעות} other{לפני {hours} שעות}}
hi: {hours, plural, =0{यह घंटा} =1{{hours} घंटे पहले} other{{hours} घंटे पहले}}
hi_latn: {hours, plural, =0{yeh ghanta} =1{{hours} ghante pehle} other{{hours} ghante pehle}}
hu: {hours, plural, =0{ebben az órában} =1{{hours} órával ezelőtt} other{{hours} órával ezelőtt}}
hy: {hours, plural, =0{այս ժամին} =1{{hours} ժամ առաջ} other{{hours} ժամ առաջ}}
ia: {hours, plural, =0{iste hora} =1{{hours} hora retro} other{{hours} horas retro}}
id: {hours, plural, =0{jam ini} other{{hours} jam yang lalu}}
is: {hours, plural, =0{þessa stundina} =1{fyrir {hours} klukkustund} other{fyrir {hours} klukkustundum}}
it: {hours, plural, =0{quest’ora} =1{{hours} ora fa} other{{hours} ore fa}}
ja: {hours, plural, =0{1 時間以内} other{{hours} 時間前}}
ka: {hours, plural, =0{ამ საათში} =1{{hours} საათის წინ} other{{hours} საათის წინ}}
kab: {hours, plural, =0{asrag-agi} =1{{hours} n usrag aya} other{{hours} n isragen aya}}
kk: {hours, plural, =1{{hours} сағат бұрын} other{{hours} сағат бұрын}}
km: {hours, plural, =0{ម៉ោងនេះ} other{{hours} ម៉ោង​មុន}}
kn: {hours, plural, =0{ಈ ಗಂಟೆ} =1{{hours} ಗಂಟೆ ಹಿಂದೆ} other{{hours} ಗಂಟೆಗಳ ಹಿಂದೆ}}
ko: {hours, plural, =0{현재 시간} other{{hours}시간 전}}
ky: {hours, plural, =0{ушул саатта} =1{{hours} саат мурун} other{{hours} саат мурун}}
lb: {hours, plural, =1{virun {hours} Stonn} other{viru(n) {hours} Stonnen}}
lo: {hours, plural, =0{ຊົ່ວໂມງນີ້} other{{hours} ຊົ່ວໂມງກ່ອນ}}
lt: {hours, plural, =1{prieš {hours} valandą} few{prieš {hours} valandas} many{prieš {hours} valandos} other{prieš {hours} valandų}}
lv: {hours, plural, =0{šajā stundā} zero{pirms {hours} stundām} =1{pirms {hours} stundas} other{pirms {hours} stundām}}
mk: {hours, plural, =0{часов} =1{пред {hours} час} other{пред {hours} часа}}
ml: {hours, plural, =0{ഈ മണിക്കൂറിൽ} =1{{hours} മണിക്കൂർ മുമ്പ്} other{{hours} മണിക്കൂർ മുമ്പ്}}
mn: {hours, plural, =0{энэ цаг} =1{{hours} цагийн өмнө} other{{hours} цагийн өмнө}}
mr: {hours, plural, =0{तासात} =1{{hours} तासापूर्वी} other{{hours} तासांपूर्वी}}
ms: {hours, plural, =0{jam ini} other{{hours} jam lalu}}
mt: {hours, plural, =0{din is-siegħa} =1{siegħa ilu} few{{hours} sigħat ilu} many{{hours} sigħat ilu} other{{hours} sigħat ilu}}
my: {hours, plural, =0{ဤအချိန်} other{ပြီးခဲ့သည့် {hours} နာရီ}}
ne: {hours, plural, =0{यस घडीमा} =1{{hours} घण्टा पहिले} other{{hours} घण्टा पहिले}}
nl: {hours, plural, =0{binnen een uur} =1{{hours} uur geleden} other{{hours} uur geleden}}
no: {hours, plural, =0{denne timen} =1{for {hours} time siden} other{for {hours} timer siden}}
or: {hours, plural, =0{ଏହି ଘଣ୍ଟା} =1{{hours} ଘଣ୍ଟା ପୂର୍ବେ} other{{hours} ଘଣ୍ଟା ପୂର୍ବେ}}
pa: {hours, plural, =0{ਇਸ ਘੰਟੇ} =1{{hours} ਘੰਟਾ ਪਹਿਲਾਂ} other{{hours} ਘੰਟੇ ਪਹਿਲਾਂ}}
pl: {hours, plural, =0{ta godzina} =1{{hours} godzinę temu} few{{hours} godziny temu} many{{hours} godzin temu} other{{hours} godziny temu}}
ps: {hours, plural, =0{دا ساعت} =1{{hours} ساعت مخکې} other{{hours} ساعتونه مخکې}}
pt: {hours, plural, =0{esta hora} =1{há {hours} hora} other{há {hours} horas}}
ro: {hours, plural, =0{ora aceasta} =1{acum {hours} oră} few{acum {hours} ore} other{acum {hours} de ore}}
sc: {hours, plural, =1{{hours} ora a como} other{{hours} oras a como}}
sd: {hours, plural, =0{هن ڪلڪ} =1{{hours} ڪلاڪ پهرين} other{{hours} ڪلاڪ پهرين}}
se_fi: {hours, plural, =0{dán diimmu} =1{{hours} diibmu áigi} =2{{hours} diimmu áigi} other{{hours} diimmu áigi}}
si: {hours, plural, =0{මෙම පැය} =1{පැය {hours}කට පෙර} other{පැය {hours}කට පෙර}}
sk: {hours, plural, =0{v tejto hodine} =1{pred {hours} hodinou} few{pred {hours} hodinami} many{pred {hours} hodinou} other{pred {hours} hodinami}}
sl: {hours, plural, =0{v tej uri} =1{pred {hours} uro} =2{pred {hours} urama} few{pred {hours} urami} other{pred {hours} urami}}
sq: {hours, plural, =0{këtë orë} =1{{hours} orë më parë} other{{hours} orë më parë}}
sr: {hours, plural, =0{овог сата} =1{пре {hours} сата} few{пре {hours} сата} other{пре {hours} сати}}
sr_cyrl_ba: {hours, plural, =1{прије {hours} сата} few{прије {hours} сата} other{прије {hours} сати}}
sr_latn: {hours, plural, =0{ovog sata} =1{pre {hours} sata} few{pre {hours} sata} other{pre {hours} sati}}
sr_latn_ba: {hours, plural, =1{prije {hours} sata} few{prije {hours} sata} other{prije {hours} sati}}
sv: {hours, plural, =0{denna timme} =1{för {hours} timme sedan} other{för {hours} timmar sedan}}
sw: {hours, plural, =0{saa hii} =1{saa {hours} iliyopita} other{saa {hours} zilizopita}}
ta: {hours, plural, =0{இந்த ஒரு மணிநேரத்தில்} =1{{hours} மணிநேரம் முன்} other{{hours} மணிநேரம் முன்}}
te: {hours, plural, =0{ఈ గంట} =1{{hours} గంట క్రితం} other{{hours} గంటల క్రితం}}
tg: {hours, plural, =0{соати ҷорӣ} other{{hours} соат пеш}}
th: {hours, plural, =0{ชั่วโมงนี้} other{{hours} ชั่วโมงที่ผ่านมา}}
tk: {hours, plural, =0{şu sagat} =1{{hours} sagat öň} other{{hours} sagat öň}}
tr: {hours, plural, =0{bu saat} =1{{hours} saat önce} other{{hours} saat önce}}
tt: {hours, plural, =0{бу сәгатьтә} other{{hours} сәгать элек}}
uk: {hours, plural, =1{{hours} годину тому} few{{hours} години тому} many{{hours} годин тому} other{{hours} години тому}}
ur: {hours, plural, =0{اس گھنٹے} =1{{hours} گھنٹہ پہلے} other{{hours} گھنٹے پہلے}}
uz: {hours, plural, =0{shu soatda} =1{{hours} soat oldin} other{{hours} soat oldin}}
uz_cyrl: {hours, plural, =1{{hours} соат олдин} other{{hours} соат олдин}}
vi: {hours, plural, =0{giờ này} other{{hours} giờ trước}}
zh: {hours, plural, =0{这一时间 / 此时} other{{hours}小时前}}
zh_hant: {hours, plural, =0{這一小時} other{{hours} 小時前}}
zu: {hours, plural, =0{leli hora} =1{{hours} ihora eledlule} other{emahoreni angu-{hours} edlule}}

# hoursPastNumeric
source: {hours, plural, =1{{hours} hour ago} other{{hours} hours ago}}
as: {hours, plural, =1{{hours} ঘণ্টা পূৰ্বে} other{{hours} ঘণ্টা পূৰ্বে}}
bg: {hours, plural, =1{преди {hours} час} other{преди {hours} часа}}
da: {hours, plural, =1{for {hours} time siden} other{for {hours} timer siden}}
es: {hours, plural, =1{hace {hours} hora} other{hace {hours} horas}}
gu: {hours, plural, =1{{hours} કલાક પહેલાં} other{{hours} કલાક પહેલાં}}
it: {hours, plural, =1{{hours} ora fa} other{{hours} ore fa}}
ka: {hours, plural, =1{{hours} საათის წინ} other{{hours} საათის წინ}}
kab: {hours, plural, =1{{hours} n usrag aya} other{{hours} n isragen aya}}
ky: {hours, plural, =1{{hours} саат мурун} other{{hours} саат мурун}}
lb: {hours, plural, =1{virun {hours} Stonn} other{viru(n) {hours} Stonnen}}
lv: {hours, plural, zero{pirms {hours} stundām} =1{pirms {hours} stundas} other{pirms {hours} stundām}}
ml: {hours, plural, =1{{hours} മണിക്കൂർ മുമ്പ്} other{{hours} മണിക്കൂർ മുമ്പ്}}
mr: {hours, plural, =1{{hours} तासापूर्वी} other{{hours} तासांपूर्वी}}
ms: {hours, plural, other{{hours} jam lalu}}
mt: {hours, plural, =1{siegħa ilu} few{{hours} sigħat ilu} many{{hours} sigħat ilu} other{{hours} sigħat ilu}}
ne: {hours, plural, =1{{hours} घण्टा पहिले} other{{hours} घण्टा पहिले}}
ro: {hours, plural, =1{acum {hours} oră} few{acum {hours} ore} other{acum {hours} de ore}}
si: {hours, plural, =1{පැය {hours}කට පෙර} other{පැය {hours}කට පෙර}}
sl: {hours, plural, =1{pred {hours} uro} =2{pred {hours} urama} few{pred {hours} urami} other{pred {hours} urami}}
sq: {hours, plural, =1{{hours} orë më parë} other{{hours} orë më parë}}
sr_latn: {hours, plural, =1{pre {hours} sata} few{pre {hours} sata} other{pre {hours} sati}}
sw: {hours, plural, =1{saa {hours} iliyopita} other{saa {hours} zilizopita}}
te: {hours, plural, =1{{hours} గంట క్రితం} other{{hours} గంటల క్రితం}}
th: {hours, plural, other{{hours} ชั่วโมงที่ผ่านมา}}
tk: {hours, plural, =1{{hours} sagat öň} other{{hours} sagat öň}}
tt: {hours, plural, other{{hours} сәгать элек}}
uz: {hours, plural, =1{{hours} soat oldin} other{{hours} soat oldin}}
uz_cyrl: {hours, plural, =1{{hours} соат олдин} other{{hours} соат олдин}}
zh: {hours, plural, other{{hours}小时前}}
zh_hant: {hours, plural, other{{hours} 小時前}}
zu: {hours, plural, =1{{hours} ihora eledlule} other{emahoreni angu-{hours} edlule}}
