Repository: Mosc/relative_time
Catalog: lib/src/l10n/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, el, eo, es, et, eu, fa, fi, fil, fo, fr, fy, ga, gd, gl, gu, he, hi, hi_latn, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mk, ml, mn, mr, ms, mt, my, ne, nl, no, or, pa, pl, ps, pt, pt_pt, ro, sc, sd, se_fi, si, sk, sl, sq, sr, sr_cyrl_ba, sr_latn, sr_latn_ba, sv, sw, ta, te, tg, th, tk, tr, tt, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# minutesFuture
source: {minutes, plural, =0{this minute} =1{in {minutes} minute} other{in {minutes} minutes}}
af: {minutes, plural, =0{hierdie minuut} =1{oor {minutes} minuut} other{oor {minutes} minute}}
am: {minutes, plural, =0{ይህ ደቂቃ} =1{በ{minutes} ደቂቃ ውስጥ} other{በ{minutes} ደቂቃዎች ውስጥ}}
ar: {minutes, plural, =0{هذه الدقيقة} zero{خلال {minutes} دقيقة} =1{خلال دقيقة واحدة} =2{خلال دقيقتين} few{خلال {minutes} دقائق} many{خلال {minutes} دقيقة} other{خلال {minutes} دقيقة}}
as: {minutes, plural, =0{এইটো মিনিটত} =1{{minutes} মিনিটত} other{{minutes} মিনিটত}}
ast: {minutes, plural, =0{esti minutu} =1{en {minutes} minutu} other{en {minutes} minutos}}
az: {minutes, plural, =0{bu dəqiqə} =1{{minutes} dəqiqə ərzində} other{{minutes} dəqiqə ərzində}}
bg: {minutes, plural, =0{в тази минута} =1{след {minutes} минута} other{след {minutes} минути}}
bn: {minutes, plural, =0{এই মিনিট} =1{{minutes} মিনিটে} other{{minutes} মিনিটে}}
br: {minutes, plural, =0{ar munut-mañ} =1{a-benn {minutes} munut} =2{a-benn {minutes} vunut} few{a-benn {minutes} munut} many{a-benn {minutes} a vunutoù} other{a-benn {minutes} munut}}
bs: {minutes, plural, =0{ova minuta} =1{za {minutes} minutu} few{za {minutes} minute} other{za {minutes} minuta}}
bs_cyrl: {minutes, plural, =0{овог минута} =1{за {minutes} минут} few{за {minutes} минута} other{за {minutes} минута}}
ca: {minutes, plural, =1{d’aquí a {minutes} minut} other{d’aquí a {minutes} minuts}}
cs: {minutes, plural, =1{za {minutes} minutu} few{za {minutes} minuty} many{za {minutes} minuty} other{za {minutes} minut}}
cy: {minutes, plural, =0{y funud hon} zero{ymhen {minutes} munud} =1{ymhen {minutes} munud} =2{ymhen {minutes} munud} few{ymhen {minutes} munud} many{ymhen {minutes} munud} other{ymhen {minutes} munud}}
da: {minutes, plural, =0{dette minut} =1{om {minutes} minut} other{om {minutes} minutter}}
de: {minutes, plural, =0{in dieser Minute} =1{in {minutes} Minute} other{in {minutes} Minuten}}
el: {minutes, plural, =0{τρέχον λεπτό} =1{σε {minutes} λεπτό} other{σε {minutes} λεπτά}}
eo: {minutes, plural, =1{post {minutes} minuto} other{post {minutes} minutoj}}
es: {minutes, plural, =0{este minuto} =1{dentro de {minutes} minuto} other{dentro de {minutes} minutos}}
et: {minutes, plural, =0{praegusel minutil} =1{{minutes} minuti pärast} other{{minutes} minuti pärast}}
eu: {minutes, plural, =0{minutu honetan} =1{{minutes} minutu barru} other{{minutes} minutu barru}}
fa: {minutes, plural, =0{همین دقیقه} =1{{minutes} دقیقه بعد} other{{minutes} دقیقه بعد}}
fi: {minutes, plural, =0{tämän minuutin aikana} =1{{minutes} minuutin päästä} other{{minutes} minuutin päästä}}
fil: {minutes, plural, =0{sa minutong ito} =1{sa {minutes} minuto} other{sa {minutes} (na) minuto}}
fo: {minutes, plural, =0{hendan minuttin} =1{um {minutes} minutt} other{um {minutes} minuttir}}
fr: {minutes, plural, =0{cette minute-ci} =1{dans {minutes} minute} other{dans {minutes} minutes}}
fy: {minutes, plural, =1{Oer {minutes} minút} other{Oer {minutes} minuten}}
ga: {minutes, plural, =0{an nóiméad seo} =1{i gceann {minutes} nóiméad} =2{i gceann {minutes} nóiméad} few{i gceann {minutes} nóiméad} many{i gceann {minutes} nóiméad} other{i gceann {minutes} nóiméad}}
gd: {minutes, plural, =1{an ceann {minutes} mhionaid} =2{an ceann {minutes} mhionaid} few{an ceann {minutes} mionaidean} other{an ceann {minutes} mionaid}}
gl: {minutes, plural, =0{este minuto} =1{en {minutes} minuto} other{en {minutes} minutos}}
gu: {minutes, plural, =0{આ મિનિટ} =1{{minutes} મિનિટમાં} other{{minutes} મિનિટમાં}}
he: {minutes, plural, =0{בדקה זו} =1{בעוד דקה} =2{בעוד שתי דקות} many{בעוד {minutes} דקות} other{בעוד {minutes} דקות}}
hi: {minutes, plural, =0{यह मिनट} =1{{minutes} मिनट में} other{{minutes} मिनट में}}
hi_latn: {minutes, plural, =0{yeh minute} =1{{minutes} minute mein} other{{minutes} minute mein}}
hu: {minutes, plural, =0{ebben a percben} =1{{minutes} perc múlva} other{{minutes} perc múlva}}
hy: {minutes, plural, =0{այս րոպեին} =1{{minutes} րոպեից} other{{minutes} րոպեից}}
ia: {minutes, plural, =0{iste minuta} =1{in {minutes} minuta} other{in {minutes} minutas}}
id: {minutes, plural, =0{menit ini} other{dalam {minutes} menit}}
is: {minutes, plural, =0{á þessari mínútu} =1{eftir {minutes} mínútu} other{eftir {minutes} mínútur}}
it: {minutes, plural, =0{questo minuto} =1{tra {minutes} minuto} other{tra {minutes} minuti}}
ja: {minutes, plural, =0{1 分以内} other{{minutes} 分後}}
ka: {minutes, plural, =0{ამ წუთში} =1{{minutes} წუთში} other{{minutes} წუთში}}
kab: {minutes, plural, =0{tasdat-agi} =1{deg {minutes} n tesdat} other{deg {minutes} n tesdatin}}
kk: {minutes, plural, =1{{minutes} минуттан кейін} other{{minutes} минуттан кейін}}
km: {minutes, plural, =0{នាទីនេះ} other{{minutes} នាទីទៀត}}
kn: {minutes, plural, =0{ಈ ನಿಮಿಷ} =1{{minutes} ನಿಮಿಷದಲ್ಲಿ} other{{minutes} ನಿಮಿಷಗಳಲ್ಲಿ}}
ko: {minutes, plural, =0{현재 분} other{{minutes}분 후}}
ky: {minutes, plural, =0{ушул мүнөттө} =1{{minutes} мүнөттөн кийин} other{{minutes} мүнөттөн кийин}}
lb: {minutes, plural, =1{an {minutes} Minutt} other{a(n) {minutes} Minutten}}
lo: {minutes, plural, =0{ນາທີນີ້} other{ໃນອີກ {minutes} ນາທີ}}
lt: {minutes, plural, =1{po {minutes} minutės} few{po {minutes} minučių} many{po {minutes} minutės} other{po {minutes} minučių}}
lv: {minutes, plural, =0{šajā minūtē} zero{pēc {minutes} minūtēm} =1{pēc {minutes} minūtes} other{pēc {minutes} minūtēm}}
mk: {minutes, plural, =0{оваа минута} =1{за {minutes} минута} other{за {minutes} минути}}
ml: {minutes, plural, =0{ഈ മിനിറ്റിൽ} =1{{minutes} മിനിറ്റിൽ} other{{minutes} മിനിറ്റിൽ}}
mn: {minutes, plural, =0{энэ минут} =1{{minutes} минутын дараа} other{{minutes} минутын дараа}}
mr: {minutes, plural, =0{या मिनिटात} =1{{minutes} मिनिटामध्ये} other{{minutes} मिनिटांमध्ये}}
ms: {minutes, plural, =0{pada minit ini} other{dalam {minutes} minit}}
mt: {minutes, plural, =0{din il-minuta} =1{sa minuta oħra} few{sa {minutes} minuti oħra} many{sa {minutes} minuti oħra} other{sa {minutes} minuti oħra}}
my: {minutes, plural, =0{ဤမိနစ်} other{{minutes} မိနစ်အတွင်း}}
ne: {minutes, plural, =0{यही मिनेटमा} =1{{minutes} मिनेटमा} other{{minutes} मिनेटमा}}
nl: {minutes, plural, =0{binnen een minuut} =1{over {minutes} minuut} other{over {minutes} minuten}}
no: {minutes, plural, =0{dette minuttet} =1{om {minutes} minutt} other{om {minutes} minutter}}
or: {minutes, plural, =0{ଏହି ମିନିଟ୍} =1{{minutes} ମିନିଟ୍‌‌ରେ} other{{minutes} ମିନିଟ୍‌‌ରେ}}
pa: {minutes, plural, =0{ਇਸ ਮਿੰਟ} =1{{minutes} ਮਿੰਟ ਵਿੱਚ} other{{minutes} ਮਿੰਟਾਂ ਵਿੱਚ}}
pl: {minutes, plural, =0{ta minuta} =1{za {minutes} minutę} few{za {minutes} minuty} many{za {minutes} minut} other{za {minutes} minuty}}
ps: {minutes, plural, =0{دا دقيقه} =1{په {minutes} دقيقه کې} other{په {minutes} دقيقو کې}}
pt: {minutes, plural, =0{este minuto} =1{em {minutes} minuto} other{em {minutes} minutos}}
pt_pt: {minutes, plural, =1{dentro de {minutes} minuto} other{dentro de {minutes} minutos}}
ro: {minutes, plural, =0{minutul acesta} =1{peste {minutes} minut} few{peste {minutes} minute} other{peste {minutes} de minute}}
sc: {minutes, plural, =1{intro de {minutes} minutu} other{intro de {minutes} minutos}}
sd: {minutes, plural, =0{هن منٽ} =1{{minutes} منٽن ۾} other{+{minutes} min}}
se_fi: {minutes, plural, =0{dán minuhta} =1{{minutes} minuhta siste} =2{{minutes} minuhta siste} other{{minutes} minuhta siste}}
si: {minutes, plural, =0{මෙම මිනිත්තුව} =1{මිනිත්තු {minutes}කින්} other{මිනිත්තු {minutes}කින්}}
sk: {minutes, plural, =0{v tejto minúte} =1{o {minutes} minútu} few{o {minutes} minúty} many{o {minutes} minúty} other{o {minutes} minút}}
sl: {minutes, plural, =0{to minuto} =1{čez {minutes} minuto} =2{čez {minutes} minuti} few{čez {minutes} minute} other{čez {minutes} minut}}
sq: {minutes, plural, =0{këtë minutë} =1{pas {minutes} minute} other{pas {minutes} minutash}}
sr: {minutes, plural, =0{овог минута} =1{за {minutes} минут} few{за {minutes} минута} other{за {minutes} минута}}
sr_latn: {minutes, plural, =0{ovog minuta} =1{za {minutes} minut} few{za {minutes} minuta} other{za {minutes} minuta}}
sv: {minutes, plural, =0{denna minut} =1{om {minutes} minut} other{om {minutes} minuter}}
sw: {minutes, plural, =0{dakika hii} =1{baada ya dakika {minutes}} other{baada ya dakika {minutes}}}
ta: {minutes, plural, =0{இந்த ஒரு நிமிடத்தில்} =1{{minutes} நிமிடத்தில்} other{{minutes} நிமிடங்களில்}}
te: {minutes, plural, =0{ఈ నిమిషం} =1{{minutes} నిమిషంలో} other{{minutes} నిమిషాల్లో}}
tg: {minutes, plural, =0{дақиқаи ҷорӣ} other{пас аз {minutes} дақиқа}}
th: {minutes, plural, =0{นาทีนี้} other{ในอีก {minutes} นาที}}
tk: {minutes, plural, =0{şu minut} =1{{minutes} minutdan} other{{minutes} minutdan}}
tr: {minutes, plural, =0{bu dakika} =1{{minutes} dakika sonra} other{{minutes} dakika sonra}}
tt: {minutes, plural, =0{бу минутта} other{{minutes} минуттан}}
uk: {minutes, plural, =1{через {minutes} хвилину} few{через {minutes} хвилини} many{через {minutes} хвилин} other{через {minutes} хвилини}}
ur: {minutes, plural, =0{اس منٹ} =1{{minutes} منٹ میں} other{{minutes} منٹ میں}}
uz: {minutes, plural, =0{shu daqiqada} =1{{minutes} daqiqadan keyin} other{{minutes} daqiqadan keyin}}
uz_cyrl: {minutes, plural, =1{{minutes} дақиқадан сўнг} other{{minutes} дақиқадан сўнг}}
vi: {minutes, plural, =0{phút này} other{sau {minutes} phút nữa}}
zh: {minutes, plural, =0{此刻} other{{minutes}分钟后}}
zh_hant: {minutes, plural, =0{這一分鐘} other{{minutes} 分鐘後}}
zu: {minutes, plural, =0{leli minithi} =1{kuminithi elingu-{minutes} elizayo} other{kumaminithi angu-{minutes} ezayo}}

# minutesFutureNumeric
source: {minutes, plural, =1{in {minutes} minute} other{in {minutes} minutes}}
as: {minutes, plural, =1{{minutes} মিনিটত} other{{minutes} মিনিটত}}
bg: {minutes, plural, =1{след {minutes} минута} other{след {minutes} минути}}
da: {minutes, plural, =1{om {minutes} minut} other{om {minutes} minutter}}
es: {minutes, plural, =1{dentro de {minutes} minuto} other{dentro de {minutes} minutos}}
gu: {minutes, plural, =1{{minutes} મિનિટમાં} other{{minutes} મિનિટમાં}}
it: {minutes, plural, =1{tra {minutes} minuto} other{tra {minutes} minuti}}
ka: {minutes, plural, =1{{minutes} წუთში} other{{minutes} წუთში}}
kab: {minutes, plural, =1{deg {minutes} n tesdat} other{deg {minutes} n tesdatin}}
ky: {minutes, plural, =1{{minutes} мүнөттөн кийин} other{{minutes} мүнөттөн кийин}}
lb: {minutes, plural, =1{an {minutes} Minutt} other{a(n) {minutes} Minutten}}
lv: {minutes, plural, zero{pēc {minutes} minūtēm} =1{pēc {minutes} minūtes} other{pēc {minutes} minūtēm}}
ml: {minutes, plural, =1{{minutes} മിനിറ്റിൽ} other{{minutes} മിനിറ്റിൽ}}
mr: {minutes, plural, =1{{minutes} मिनिटामध्ये} other{{minutes} मिनिटांमध्ये}}
ms: {minutes, plural, other{dalam {minutes} minit}}
mt: {minutes, plural, =1{sa minuta oħra} few{sa {minutes} minuti oħra} many{sa {minutes} minuti oħra} other{sa {minutes} minuti oħra}}
ne: {minutes, plural, =1{{minutes} मिनेटमा} other{{minutes} मिनेटमा}}
pt_pt: {minutes, plural, =1{dentro de {minutes} minuto} other{dentro de {minutes} minutos}}
ro: {minutes, plural, =1{peste {minutes} minut} few{peste {minutes} minute} other{peste {minutes} de minute}}
si: {minutes, plural, =1{මිනිත්තු {minutes}කින්} other{මිනිත්තු {minutes}කින්}}
sl: {minutes, plural, =1{čez {minutes} minuto} =2{čez {minutes} minuti} few{čez {minutes} minute} other{čez {minutes} minut}}
sq: {minutes, plural, =1{pas {minutes} minute} other{pas {minutes} minutash}}
sr_latn: {minutes, plural, =1{za {minutes} minut} few{za {minutes} minuta} other{za {minutes} minuta}}
sw: {minutes, plural, =1{baada ya dakika {minutes}} other{baada ya dakika {minutes}}}
te: {minutes, plural, =1{{minutes} నిమిషంలో} other{{minutes} నిమిషాల్లో}}
th: {minutes, plural, other{ในอีก {minutes} นาที}}
tk: {minutes, plural, =1{{minutes} minutdan} other{{minutes} minutdan}}
tt: {minutes, plural, other{{minutes} минуттан}}
uz: {minutes, plural, =1{{minutes} daqiqadan keyin} other{{minutes} daqiqadan keyin}}
uz_cyrl: {minutes, plural, =1{{minutes} дақиқадан сўнг} other{{minutes} дақиқадан сўнг}}
zh: {minutes, plural, other{{minutes}分钟后}}
zh_hant: {minutes, plural, other{{minutes} 分鐘後}}
zu: {minutes, plural, =1{kuminithi elingu-{minutes} elizayo} other{kumaminithi angu-{minutes} ezayo}}

# minutesPast
source: {minutes, plural, =0{this minute} =1{{minutes} minute ago} other{{minutes} minutes ago}}
af: {minutes, plural, =0{hierdie minuut} =1{{minutes} minuut gelede} other{{minutes} minute gelede}}
am: {minutes, plural, =0{ይህ ደቂቃ} =1{ከ{minutes} ደቂቃ በፊት} other{ከ{minutes} ደቂቃዎች በፊት}}
ar: {minutes, plural, =0{هذه الدقيقة} zero{قبل {minutes} دقيقة} =1{قبل دقيقة واحدة} =2{قبل دقيقتين} few{قبل {minutes} دقائق} many{قبل {minutes} دقيقة} other{قبل {minutes} دقيقة}}
as: {minutes, plural, =0{এইটো মিনিটত} =1{{minutes} মিনিট পূৰ্বে} other{{minutes} মিনিট পূৰ্বে}}
ast: {minutes, plural, =0{esti minutu} =1{hai {minutes} minutu} other{hai {minutes} minutos}}
az: {minutes, plural, =0{bu dəqiqə} =1{{minutes} dəqiqə öncə} other{{minutes} dəqiqə öncə}}
bg: {minutes, plural, =0{в тази минута} =1{преди {minutes} минута} other{преди {minutes} минути}}
bn: {minutes, plural, =0{এই মিনিট} =1{{minutes} মিনিট আগে} other{{minutes} মিনিট আগে}}
br: {minutes, plural, =0{ar munut-mañ} =1{{minutes} munut zo} =2{{minutes} vunut zo} few{{minutes} munut zo} many{{minutes} a vunutoù zo} other{{minutes} munut zo}}
bs: {minutes, plural, =0{ova minuta} =1{prije {minutes} minutu} few{prije {minutes} minute} other{prije {minutes} minuta}}
bs_cyrl: {minutes, plural, =0{овог минута} =1{прије {minutes} минут} few{прије {minutes} минута} other{прије {minutes} минута}}
ca: {minutes, plural, =1{fa {minutes} minut} other{fa {minutes} minuts}}
cs: {minutes, plural, =1{před {minutes} minutou} few{před {minutes} minutami} many{před {minutes} minuty} other{před {minutes} minutami}}
cy: {minutes, plural, =0{y funud hon} zero{{minutes} munud yn ôl} =1{{minutes} munud yn ôl} =2{{minutes} munud yn ôl} few{{minutes} munud yn ôl} many{{minutes} munud yn ôl} other{{minutes} munud yn ôl}}
da: {minutes, plural, =0{dette minut} =1{for {minutes} minut siden} other{for {minutes} minutter siden}}
de: {minutes, plural, =0{in dieser Minute} =1{vor {minutes} Minute} other{vor {minutes} Minuten}}
el: {minutes, plural, =0{τρέχον λεπτό} =1{πριν από {minutes} λεπτό} other{πριν από {minutes} λεπτά}}
eo: {minutes, plural, =1{antaŭ {minutes} minuto} other{antaŭ {minutes} minutoj}}
es: {minutes, plural, =0{este minuto} =1{hace {minutes} minuto} other{hace {minutes} minutos}}
et: {minutes, plural, =0{praegusel minutil} =1{{minutes} minuti eest} other{{minutes} minuti eest}}
eu: {minutes, plural, =0{minutu honetan} =1{Duela {minutes} minutu} other{Duela {minutes} minutu}}
fa: {minutes, plural, =0{همین دقیقه} =1{{minutes} دقیقه پیش} other{{minutes} دقیقه پیش}}
fi: {minutes, plural, =0{tämän minuutin aikana} =1{{minutes} minuutti sitten} other{{minutes} minuuttia sitten}}
fil: {minutes, plural, =0{sa minutong ito} =1{{minutes} minuto ang nakalipas} other{{minutes} (na) minuto ang nakalipas}}
fo: {minutes, plural, =0{hendan minuttin} =1{{minutes} minutt síðan} other{{minutes} minuttir síðan}}
fr: {minutes, plural, =0{cette minute-ci} =1{il y a {minutes} minute} other{il y a {minutes} minutes}}
fy: {minutes, plural, =1{{minutes} minút lyn} other{{minutes} minuten lyn}}
ga: {minutes, plural, =0{an nóiméad seo} =1{{minutes} nóiméad ó shin} =2{{minutes} nóiméad ó shin} few{{minutes} nóiméad ó shin} many{{minutes} nóiméad ó shin} other{{minutes} nóiméad ó shin}}
gd: {minutes, plural, =1{{minutes} mhionaid air ais} =2{{minutes} mhionaid air ais} few{{minutes} mionaidean air ais} other{{minutes} mionaid air ais}}
gl: {minutes, plural, =0{este minuto} =1{hai {minutes} minuto} other{hai {minutes} minutos}}
gu: {minutes, plural, =0{આ મિનિટ} =1{{minutes} મિનિટ પહેલાં} other{{minutes} મિનિટ પહેલાં}}
he: {minutes, plural, =0{בדקה זו} =1{לפני דקה} =2{לפני שתי דקות} many{לפני {minutes} דקות} other{לפני {minutes} דקות}}
hi: {minutes, plural, =0{यह मिनट} =1{{minutes} मिनट पहले} other{{minutes} मिनट पहले}}
hi_latn: {minutes, plural, =0{yeh minute} =1{{minutes} minute pehle} other{{minutes} minute pehle}}
hu: {minutes, plural, =0{ebben a percben} =1{{minutes} perccel ezelőtt} other{{minutes} perccel ezelőtt}}
hy: {minutes, plural, =0{այս րոպեին} =1{{minutes} րոպե առաջ} other{{minutes} րոպե առաջ}}
ia: {minutes, plural, =0{iste minuta} =1{{minutes} minuta retro} other{{minutes} minutas retro}}
id: {minutes, plural, =0{menit ini} other{{minutes} menit yang lalu}}
is: {minutes, plural, =0{á þessari mínútu} =1{fyrir {minutes} mínútu} other{fyrir {minutes} mínútum}}
it: {minutes, plural, =0{questo minuto} =1{{minutes} minuto fa} other{{minutes} minuti fa}}
ja: {minutes, plural, =0{1 分以内} other{{minutes} 分前}}
ka: {minutes, plural, =0{ამ წუთში} =1{{minutes} წუთის წინ} other{{minutes} წუთის წინ}}
kab: {minutes, plural, =0{tasdat-agi} =1{{minutes} n tesdat aya} other{{minutes} n tesdatin aya}}
kk: {minutes, plural, =1{{minutes} минут бұрын} other{{minutes} минут бұрын}}
km: {minutes, plural, =0{នាទីនេះ} other{{minutes} នាទី​មុន}}
kn: {minutes, plural, =0{ಈ ನಿಮಿಷ} =1{{minutes} ನಿಮಿಷದ ಹಿಂದೆ} other{{minutes} ನಿಮಿಷಗಳ ಹಿಂದೆ}}
ko: {minutes, plural, =0{현재 분} other{{minutes}분 전}}
ky: {minutes, plural, =0{ушул мүнөттө} =1{{minutes} мүнөт мурун} other{{minutes} мүнөт мурун}}
lb: {minutes, plural, =1{virun {minutes} Minutt} other{viru(n) {minutes} Minutten}}
lo: {minutes, plural, =0{ນາທີນີ້} other{{minutes} ນາທີກ່ອນ}}
lt: {minutes, plural, =1{prieš {minutes} minutę} few{prieš {minutes} minutes} many{prieš {minutes} minutės} other{prieš {minutes} minučių}}
lv: {minutes, plural, =0{šajā minūtē} zero{pirms {minutes} minūtēm} =1{pirms {minutes} minūtes} other{pirms {minutes} minūtēm}}
mk: {minutes, plural, =0{оваа минута} =1{пред {minutes} минута} other{пред {minutes} минути}}
ml: {minutes, plural, =0{ഈ മിനിറ്റിൽ} =1{{minutes} മിനിറ്റ് മുമ്പ്} other{{minutes} മിനിറ്റ് മുമ്പ്}}
mn: {minutes, plural, =0{энэ минут} =1{{minutes} минутын өмнө} other{{minutes} минутын өмнө}}
mr: {minutes, plural, =0{या मिनिटात} =1{{minutes} मिनिटापूर्वी} other{{minutes} मिनिटांपूर्वी}}
ms: {minutes, plural, =0{pada minit ini} other{{minutes} minit lalu}}
mt: {minutes, plural, =0{din il-minuta} =1{minuta ilu} few{{minutes} minuti ilu} many{{minutes} minuti ilu} other{{minutes} minuti ilu}}
my: {minutes, plural, =0{ဤမိနစ်} other{ပြီးခဲ့သည့် {minutes} မိနစ်}}
ne: {minutes, plural, =0{यही मिनेटमा} =1{{minutes} मिनेट पहिले} other{{minutes} मिनेट पहिले}}
nl: {minutes, plural, =0{binnen een minuut} =1{{minutes} minuut geleden} other{{minutes} minuten geleden}}
no: {minutes, plural, =0{dette minuttet} =1{for {minutes} minutt siden} other{for {minutes} minutter siden}}
or: {minutes, plural, =0{ଏହି ମିନିଟ୍} =1{{minutes} ମିନିଟ୍ ପୂର୍ବେ} other{{minutes} ମିନିଟ୍ ପୂର୍ବେ}}
pa: {minutes, plural, =0{ਇਸ ਮਿੰਟ} =1{{minutes} ਮਿੰਟ ਪਹਿਲਾਂ} other{{minutes} ਮਿੰਟ ਪਹਿਲਾਂ}}
pl: {minutes, plural, =0{ta minuta} =1{{minutes} minutę temu} few{{minutes} minuty temu} many{{minutes} minut temu} other{{minutes} minuty temu}}
ps: {minutes, plural, =0{دا دقيقه} =1{{minutes} دقيقه مخکې} other{{minutes} دقيقې مخکې}}
pt: {minutes, plural, =0{este minuto} =1{há {minutes} minuto} other{há {minutes} minutos}}
ro: {minutes, plural, =0{minutul acesta} =1{acum {minutes} minut} few{acum {minutes} minute} other{acum {minutes} de minute}}
sc: {minutes, plural, =1{{minutes} minutu a como} other{{minutes} minutos a como}}
sd: {minutes, plural, =0{هن منٽ} =1{{minutes} منٽ پهرين} other{{minutes} منٽ پهرين}}
se_fi: {minutes, plural, =0{dán minuhta} =1{{minutes} minuhtta áigi} =2{{minutes} minuhta áigi} other{{minutes} minuhta áigi}}
si: {minutes, plural, =0{මෙම මිනිත්තුව} =1{මිනිත්තු {minutes}කට පෙර} other{මිනිත්තු {minutes}කට පෙර}}
sk: {minutes, plural, =0{v tejto minúte} =1{pred {minutes} minútou} few{pred {minutes} minútami} many{pred {minutes} minúty} other{pred {minutes} minútami}}
sl: {minutes, plural, =0{to minuto} =1{pred {minutes} minuto} =2{pred {minutes} minutama} few{pred {minutes} minutami} other{pred {minutes} minutami}}
sq: {minutes, plural, =0{këtë minutë} =1{{minutes} minutë më parë} other{{minutes} minuta më parë}}
sr: {minutes, plural, =0{овог минута} =1{пре {minutes} минута} few{пре {minutes} минута} other{пре {minutes} минута}}
sr_cyrl_ba: {minutes, plural, =1{прије {minutes} минута} few{прије {minutes} минута} other{прије {minutes} минута}}
sr_latn: {minutes, plural, =0{ovog minuta} =1{pre {minutes} minuta} few{pre {minutes} minuta} other{pre {minutes} minuta}}
sr_latn_ba: {minutes, plural, =1{prije {minutes} minuta} few{prije {minutes} minuta} other{prije {minutes} minuta}}
sv: {minutes, plural, =0{denna minut} =1{för {minutes} minut sedan} other{för {minutes} minuter sedan}}
sw: {minutes, plural, =0{dakika hii} =1{dakika {minutes} iliyopita} other{dakika {minutes} zilizopita}}
ta: {minutes, plural, =0{இந்த ஒரு நிமிடத்தில்} =1{{minutes} நிமிடத்திற்கு முன்} other{{minutes} நிமிடங்களுக்கு முன்}}
te: {minutes, plural, =0{ఈ నిమిషం} =1{{minutes} నిమిషం క్రితం} other{{minutes} నిమిషాల క్రితం}}
tg: {minutes, plural, =0{дақиқаи ҷорӣ} other{{minutes} дақиқа пеш}}
th: {minutes, plural, =0{นาทีนี้} other{{minutes} นาทีที่ผ่านมา}}
tk: {minutes, plural, =0{şu minut} =1{{minutes} minut öň} other{{minutes} minut öň}}
tr: {minutes, plural, =0{bu dakika} =1{{minutes} dakika önce} other{{minutes} dakika önce}}
tt: {minutes, plural, =0{бу минутта} other{{minutes} минут элек}}
uk: {minutes, plural, =1{{minutes} хвилину тому} few{{minutes} хвилини тому} many{{minutes} хвилин тому} other{{minutes} хвилини тому}}
ur: {minutes, plural, =0{اس منٹ} =1{{minutes} منٹ پہلے} other{{minutes} منٹ پہلے}}
uz: {minutes, plural, =0{shu daqiqada} =1{{minutes} daqiqa oldin} other{{minutes} daqiqa oldin}}
uz_cyrl: {minutes, plural, =1{{minutes} дақиқа олдин} other{{minutes} дақиқа олдин}}
vi: {minutes, plural, =0{phút này} other{{minutes} phút trước}}
zh: {minutes, plural, =0{此刻} other{{minutes}分钟前}}
zh_hant: {minutes, plural, =0{這一分鐘} other{{minutes} 分鐘前}}
zu: {minutes, plural, =0{leli minithi} =1{{minutes} iminithi eledlule} other{{minutes} amaminithi edlule}}
