Repository: Mosc/relative_time
Catalog: lib/src/l10n/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, el, eo, es, et, eu, fa, fi, fil, fo, fr, fy, ga, gd, gl, gu, he, hi, hi_latn, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mk, ml, mn, mr, ms, mt, my, ne, nl, no, or, pa, pl, ps, pt, pt_pt, ro, sc, sd, se_fi, si, sk, sl, sq, sr, sr_cyrl_ba, sr_latn, sr_latn_ba, sv, sw, ta, te, tg, th, tk, tr, tt, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# monthsPastNumeric
source: {months, plural, =1{{months} month ago} other{{months} months ago}}
as: {months, plural, =1{{months} মাহ পূৰ্বে} other{{months} মাহ পূৰ্বে}}
bg: {months, plural, =1{преди {months} месец} other{преди {months} месеца}}
da: {months, plural, =1{for {months} måned siden} other{for {months} måneder siden}}
es: {months, plural, =1{hace {months} mes} other{hace {months} meses}}
gu: {months, plural, =1{{months} મહિના પહેલાં} other{{months} મહિના પહેલાં}}
it: {months, plural, =1{{months} mese fa} other{{months} mesi fa}}
ka: {months, plural, =1{{months} თვის წინ} other{{months} თვის წინ}}
kab: {months, plural, =1{{months} n wayyur aya} other{{months} n wayyuren aya}}
ky: {months, plural, =1{{months} ай мурун} other{{months} ай мурун}}
lb: {months, plural, =1{virun {months} Mount} other{viru(n) {months} Méint}}
lv: {months, plural, zero{pirms {months} mēnešiem} =1{pirms {months} mēneša} other{pirms {months} mēnešiem}}
ml: {months, plural, =1{{months} മാസം മുമ്പ്} other{{months} മാസം മുമ്പ്}}
mr: {months, plural, =1{{months} महिन्यापूर्वी} other{{months} महिन्यांपूर्वी}}
ms: {months, plural, other{{months} bulan lalu}}
mt: {months, plural, =1{xahar ilu} few{{months} xhur ilu} many{{months} xhur ilu} other{{months} xhur ilu}}
ne: {months, plural, =1{{months} महिना पहिले} other{{months} महिना पहिले}}
ro: {months, plural, =1{acum {months} lună} few{acum {months} luni} other{acum {months} de luni}}
si: {months, plural, =1{මාස {months}කට පෙර} other{මාස {months}කට පෙර}}
sl: {months, plural, =1{pred {months} mesecem} =2{pred {months} mesecema} few{pred {months} meseci} other{pred {months} meseci}}
sq: {months, plural, =1{{months} muaj më parë} other{{months} muaj më parë}}
sr_latn: {months, plural, =1{pre {months} meseca} few{pre {months} meseca} other{pre {months} meseci}}
sw: {months, plural, =1{mwezi {months} uliopita} other{miezi {months} iliyopita}}
te: {months, plural, =1{{months} నెల క్రితం} other{{months} నెలల క్రితం}}
th: {months, plural, other{{months} เดือนที่ผ่านมา}}
tk: {months, plural, =1{{months} aý öň} other{{months} aý öň}}
tt: {months, plural, other{{months} ай элек}}
uz: {months, plural, =1{{months} oy oldin} other{{months} oy oldin}}
uz_cyrl: {months, plural, =1{{months} ой аввал} other{{months} ой аввал}}
zh: {months, plural, other{{months}个月前}}
zh_hant: {months, plural, other{{months} 個月前}}
zu: {months, plural, =1{{months} inyanga edlule} other{{months} izinyanga ezedlule}}

# weeksFuture
source: {weeks, plural, =0{this week} =1{next week} other{in {weeks} weeks}}
af: {weeks, plural, =0{hierdie week} =1{oor {weeks} week} other{oor {weeks} weke}}
am: {weeks, plural, =0{በዚህ ሳምንት} =1{በ{weeks} ሳምንት ውስጥ} other{በ{weeks} ሳምንታት ውስጥ}}
ar: {weeks, plural, =0{هذا الأسبوع} zero{خلال {weeks} أسبوع} =1{خلال أسبوع واحد} =2{خلال أسبوعين} few{خلال {weeks} أسابيع} many{خلال {weeks} أسبوعًا} other{خلال {weeks} أسبوع}}
as: {weeks, plural, =0{এই সপ্তাহ} =1{অহা সপ্তাহ} other{{weeks} সপ্তাহত}}
ast: {weeks, plural, =0{esta selmana} =1{en {weeks} selmana} other{en {weeks} selmanes}}
az: {weeks, plural, =0{bu həftə} =1{{weeks} həftə ərzində} other{{weeks} həftə ərzində}}
bg: {weeks, plural, =0{тази седмица} =1{следващата седмица} other{след {weeks} седмици}}
bn: {weeks, plural, =0{এই সপ্তাহ} =1{{weeks} সপ্তাহে} other{{weeks} সপ্তাহে}}
br: {weeks, plural, =0{ar sizhun-mañ} =1{a-benn {weeks} sizhun} =2{a-benn {weeks} sizhun} few{a-benn {weeks} sizhun} many{a-benn {weeks} a sizhunioù} other{a-benn {weeks} sizhun}}
bs: {weeks, plural, =0{ove sedmice} =1{za {weeks} sedmicu} few{za {weeks} sedmice} other{za {weeks} sedmica}}
bs_cyrl: {weeks, plural, =0{ове седмице} =1{за {weeks} седмицу} few{за {weeks} седмице} other{за {weeks} седмица}}
ca: {weeks, plural, =1{d’aquí a {weeks} setmana} other{d’aquí a {weeks} setmanes}}
cs: {weeks, plural, =1{za {weeks} týden} few{za {weeks} týdny} many{za {weeks} týdne} other{za {weeks} týdnů}}
cy: {weeks, plural, =0{yr wythnos hon} zero{ymhen {weeks} wythnos} =1{ymhen wythnos} =2{ymhen pythefnos} few{ymhen {weeks} wythnos} many{ymhen {weeks} wythnos} other{ymhen {weeks} wythnos}}
da: {weeks, plural, =0{denne uge} =1{næste uge} other{om {weeks} uger}}
de: {weeks, plural, =0{diese Woche} =1{in {weeks} Woche} other{in {weeks} Wochen}}
el: {weeks, plural, =0{τρέχουσα εβδομάδα} =1{σε {weeks} εβδομάδα} other{σε {weeks} εβδομάδες}}
eo: {weeks, plural, =0{nuna semajno} =1{post {weeks} semajno} other{post {weeks} semajnoj}}
es: {weeks, plural, =0{esta semana} =1{la próxima semana} other{dentro de {weeks} semanas}}
et: {weeks, plural, =0{käesolev nädal} =1{{weeks} nädala pärast} other{{weeks} nädala pärast}}
eu: {weeks, plural, =0{aste honetan} =1{{weeks} aste barru} other{{weeks} aste barru}}
fa: {weeks, plural, =0{این هفته} =1{{weeks} هفته بعد} other{{weeks} هفته بعد}}
fi: {weeks, plural, =0{tällä viikolla} =1{{weeks} viikon päästä} other{{weeks} viikon päästä}}
fil: {weeks, plural, =0{sa linggong ito} =1{sa {weeks} linggo} other{sa {weeks} (na) linggo}}
fo: {weeks, plural, =0{hesu viku} =1{um {weeks} viku} other{um {weeks} vikur}}
fr: {weeks, plural, =0{cette semaine} =1{dans {weeks} semaine} other{dans {weeks} semaines}}
fy: {weeks, plural, =0{dizze wike} =1{Oer {weeks} wike} other{Oer {weeks} wiken}}
ga: {weeks, plural, =0{an tseachtain seo} =1{i gceann {weeks} seachtain} =2{i gceann {weeks} sheachtain} few{i gceann {weeks} seachtaine} many{i gceann {weeks} seachtaine} other{i gceann {weeks} seachtain}}
gd: {weeks, plural, =1{an ceann {weeks} seachdain} =2{an ceann {weeks} sheachdain} few{an ceann {weeks} seachdainean} other{an ceann {weeks} seachdain}}
gl: {weeks, plural, =0{esta semana} =1{en {weeks} semana} other{en {weeks} semanas}}
gu: {weeks, plural, =0{આ અઠવાડિયે} =1{આવતા અઠવાડિયે} other{{weeks} અઠવાડિયામાં}}
he: {weeks, plural, =0{השבוע} =1{בעוד שבוע} =2{בעוד שבועיים} many{בעוד {weeks} שבועות} other{בעוד {weeks} שבועות}}
hi: {weeks, plural, =0{इस सप्ताह} =1{{weeks} सप्ताह में} other{{weeks} सप्ताह में}}
hi_latn: {weeks, plural, =0{is hafte} =1{{weeks} hafte mein} other{{weeks} hafte mein}}
hu: {weeks, plural, =0{ez a hét} =1{{weeks} hét múlva} other{{weeks} hét múlva}}
hy: {weeks, plural, =0{այս շաբաթ} =1{{weeks} շաբաթից} other{{weeks} շաբաթից}}
ia: {weeks, plural, =0{iste septimana} =1{in {weeks} septimana} other{in {weeks} septimanas}}
id: {weeks, plural, =0{minggu ini} other{dalam {weeks} minggu}}
is: {weeks, plural, =0{í þessari viku} =1{eftir {weeks} viku} other{eftir {weeks} vikur}}
it: {weeks, plural, =0{questa settimana} =1{settimana prossima} other{tra {weeks} settimane}}
ja: {weeks, plural, =0{今週} other{{weeks} 週間後}}
ka: {weeks, plural, =0{ამ კვირაში} =1{მომავალ კვირაში} other{{weeks} კვირაში}}
kab: {weeks, plural, =0{dduṛt -a} =1{dduṛt i d-itteddun} other{deg {weeks} n dduṛtat}}
kk: {weeks, plural, =1{{weeks} аптадан кейін} other{{weeks} аптадан кейін}}
km: {weeks, plural, =0{សប្ដាហ៍​នេះ} other{{weeks} សប្ដាហ៍ទៀត}}
kn: {weeks, plural, =0{ಈ ವಾರ} =1{{weeks} ವಾರದಲ್ಲಿ} other{{weeks} ವಾರಗಳಲ್ಲಿ}}
ko: {weeks, plural, =0{이번 주} other{{weeks}주 후}}
ky: {weeks, plural, =0{ушул аптада} =1{келерки аптада} other{{weeks} аптадан кийин}}
lb: {weeks, plural, =0{dës Woch} =1{nächst Woch} other{a(n) {weeks} Wochen}}
lo: {weeks, plural, =0{ອາທິດນີ້} other{ໃນອີກ {weeks} ອາທິດ}}
lt: {weeks, plural, =1{po {weeks} savaitės} few{po {weeks} savaičių} many{po {weeks} savaitės} other{po {weeks} savaičių}}
lv: {weeks, plural, =0{šajā nedēļā} =1{nākamajā nedēļā} zero{pēc {weeks} nedēļām} other{pēc {weeks} nedēļām}}
mk: {weeks, plural, =0{оваа седмица} =1{за {weeks} седмица} other{за {weeks} седмици}}
ml: {weeks, plural, =0{ഈ ആഴ്ച} =1{അടുത്ത ആഴ്ച} other{{weeks} ആഴ്ചയിൽ}}
mn: {weeks, plural, =0{энэ долоо хоног} =1{{weeks} долоо хоногийн дараа} other{{weeks} долоо хоногийн дараа}}
mr: {weeks, plural, =0{हा आठवडा} =1{पुढील आठवडा} other{{weeks} आठवड्यांमध्ये}}
ms: {weeks, plural, =0{minggu ini} =1{minggu depan} other{dalam {weeks} minggu}}
mt: {weeks, plural, =0{din il-ġimgħa} =1{il-ġimgħa d-dieħla} few{sa {weeks} ġimgħat oħra} many{sa {weeks} ġimgħat oħra} other{sa {weeks} ġimgħat oħra}}
my: {weeks, plural, =0{ယခု သီတင်းပတ်} other{{weeks} ပတ်အတွင်း}}
ne: {weeks, plural, =0{यो हप्ता} =1{आउने हप्ता} other{{weeks} हप्तामा}}
nl: {weeks, plural, =0{deze week} =1{over {weeks} week} other{over {weeks} weken}}
no: {weeks, plural, =0{denne uken} =1{om {weeks} uke} other{om {weeks} uker}}
or: {weeks, plural, =0{ଏହି ସପ୍ତାହ} =1{{weeks} ସପ୍ତାହରେ} other{{weeks} ସପ୍ତାହରେ}}
pa: {weeks, plural, =0{ਇਹ ਹਫ਼ਤਾ} =1{{weeks} ਹਫ਼ਤੇ ਵਿੱਚ} other{{weeks} ਹਫ਼ਤਿਆਂ ਵਿੱਚ}}
pl: {weeks, plural, =0{w tym tygodniu} =1{za {weeks} tydzień} few{za {weeks} tygodnie} many{za {weeks} tygodni} other{za {weeks} tygodnia}}
ps: {weeks, plural, =0{دا اونۍ} =1{په {weeks} اونۍ کې} other{په {weeks} اونيو کې}}
pt: {weeks, plural, =0{esta semana} =1{em {weeks} semana} other{em {weeks} semanas}}
pt_pt: {weeks, plural, =1{dentro de {weeks} semana} other{dentro de {weeks} semanas}}
ro: {weeks, plural, =0{săptămâna aceasta} =1{săptămâna viitoare} few{peste {weeks} săptămâni} other{peste {weeks} de săptămâni}}
sc: {weeks, plural, =1{intro de {weeks} chida} other{intro de {weeks} chidas}}
sd: {weeks, plural, =0{هن هفتي} =1{{weeks} هفتن ۾} other{{weeks} هفتن ۾}}
se_fi: {weeks, plural, =0{dán vahku} =1{{weeks} vahku geahčen} =2{{weeks} vahku geahčen} other{{weeks} vahku geahčen}}
si: {weeks, plural, =0{මෙම සතිය} =1{ඊළඟ සතිය} other{සති {weeks}කින්}}
sk: {weeks, plural, =0{tento týždeň} =1{o {weeks} týždeň} few{o {weeks} týždne} many{o {weeks} týždňa} other{o {weeks} týždňov}}
sl: {weeks, plural, =0{ta teden} =1{naslednji teden} =2{čez {weeks} tedna} few{čez {weeks} tedne} other{čez {weeks} tednov}}
sq: {weeks, plural, =0{këtë javë} =1{javën e ardhshme} other{pas {weeks} javësh}}
sr: {weeks, plural, =0{ове недеље} =1{за {weeks} недељу} few{за {weeks} недеље} other{за {weeks} недеља}}
sr_cyrl_ba: {weeks, plural, =0{ове недјеље} =1{за {weeks} недјељу} few{за {weeks} недјеље} other{за {weeks} недјеља}}
sr_latn: {weeks, plural, =0{ove nedelje} =1{sledeće nedelje} few{za {weeks} nedelje} other{za {weeks} nedelja}}
sr_latn_ba: {weeks, plural, =1{za {weeks} nedjelju} few{za {weeks} nedjelje} other{za {weeks} nedjelja}}
sv: {weeks, plural, =0{denna vecka} =1{om {weeks} vecka} other{om {weeks} veckor}}
sw: {weeks, plural, =0{wiki hii} =1{wiki ijayo} other{baada ya wiki {weeks}}}
ta: {weeks, plural, =0{இந்த வாரம்} =1{{weeks} வாரத்தில்} other{{weeks} வாரங்களில்}}
te: {weeks, plural, =0{ఈ వారం} =1{తదుపరి వారం} other{{weeks} వారాల్లో}}
tg: {weeks, plural, =0{ҳафтаи ҷорӣ} other{пас аз {weeks} ҳафта}}
th: {weeks, plural, =0{สัปดาห์นี้} =1{สัปดาห์หน้า} other{ในอีก {weeks} สัปดาห์}}
tk: {weeks, plural, =0{şu hepde} =1{indiki hepde} other{{weeks} hepdeden}}
tr: {weeks, plural, =0{bu hafta} =1{{weeks} hafta sonra} other{{weeks} hafta sonra}}
tt: {weeks, plural, =0{бу атнада} =1{киләсе атнада} other{{weeks} атнадан}}
uk: {weeks, plural, =1{через {weeks} тиждень} few{через {weeks} тижні} many{через {weeks} тижнів} other{через {weeks} тижня}}
ur: {weeks, plural, =0{اس ہفتہ} =1{{weeks} ہفتہ میں} other{{weeks} ہفتے میں}}
uz: {weeks, plural, =0{shu hafta} =1{keyingi hafta} other{{weeks} haftadan keyin}}
uz_cyrl: {weeks, plural, =0{бу ҳафта} =1{кейинги ҳафта} other{{weeks} ҳафтадан сўнг}}
vi: {weeks, plural, =0{tuần này} other{sau {weeks} tuần nữa}}
zh: {weeks, plural, =0{本周} =1{下周} other{{weeks}周后}}
zh_hant: {weeks, plural, =0{本週} =1{下週} other{{weeks} 週後}}
zu: {weeks, plural, =0{leli viki} =1{iviki elizayo} other{emavikini angu-{weeks}}}

# weeksFutureNumeric
source: {weeks, plural, =1{in {weeks} week} other{in {weeks} weeks}}
as: {weeks, plural, =1{{weeks} সপ্তাহত} other{{weeks} সপ্তাহত}}
bg: {weeks, plural, =1{след {weeks} седмица} other{след {weeks} седмици}}
da: {weeks, plural, =1{om {weeks} uge} other{om {weeks} uger}}
es: {weeks, plural, =1{dentro de {weeks} semana} other{dentro de {weeks} semanas}}
gu: {weeks, plural, =1{{weeks} અઠવાડિયામાં} other{{weeks} અઠવાડિયામાં}}
it: {weeks, plural, =1{tra {weeks} settimana} other{tra {weeks} settimane}}
ka: {weeks, plural, =1{{weeks} კვირაში} other{{weeks} კვირაში}}
kab: {weeks, plural, =1{deg {weeks} n dduṛt} other{deg {weeks} n dduṛtat}}
ky: {weeks, plural, =1{{weeks} аптадан кийин} other{{weeks} аптадан кийин}}
lb: {weeks, plural, =1{an {weeks} Woch} other{a(n) {weeks} Wochen}}
lv: {weeks, plural, zero{pēc {weeks} nedēļām} =1{pēc {weeks} nedēļas} other{pēc {weeks} nedēļām}}
ml: {weeks, plural, =1{{weeks} ആഴ്ചയിൽ} other{{weeks} ആഴ്ചയിൽ}}
mr: {weeks, plural, =1{{weeks} आठवड्यामध्ये} other{{weeks} आठवड्यांमध्ये}}
ms: {weeks, plural, other{dalam {weeks} minggu}}
mt: {weeks, plural, =1{sa ġimgħa oħra} few{sa {weeks} ġimgħat oħra} many{sa {weeks} ġimgħat oħra} other{sa {weeks} ġimgħat oħra}}
ne: {weeks, plural, =1{{weeks} हप्तामा} other{{weeks} हप्तामा}}
pt_pt: {weeks, plural, =1{dentro de {weeks} semana} other{dentro de {weeks} semanas}}
ro: {weeks, plural, =1{peste {weeks} săptămână} few{peste {weeks} săptămâni} other{peste {weeks} de săptămâni}}
si: {weeks, plural, =1{සති {weeks}කින්} other{සති {weeks}කින්}}
sl: {weeks, plural, =1{čez {weeks} teden} =2{čez {weeks} tedna} few{čez {weeks} tedne} other{čez {weeks} tednov}}
sq: {weeks, plural, =1{pas {weeks} jave} other{pas {weeks} javësh}}
sr_latn: {weeks, plural, =1{za {weeks} nedelju} few{za {weeks} nedelje} other{za {weeks} nedelja}}
sw: {weeks, plural, =1{baada ya wiki {weeks}} other{baada ya wiki {weeks}}}
te: {weeks, plural, =1{{weeks} వారంలో} other{{weeks} వారాల్లో}}
th: {weeks, plural, other{ในอีก {weeks} สัปดาห์}}
tk: {weeks, plural, =1{{weeks} hepdeden} other{{weeks} hepdeden}}
tt: {weeks, plural, other{{weeks} атнадан}}
uz: {weeks, plural, =1{{weeks} haftadan keyin} other{{weeks} haftadan keyin}}
uz_cyrl: {weeks, plural, =1{{weeks} ҳафтадан сўнг} other{{weeks} ҳафтадан сўнг}}
zh: {weeks, plural, other{{weeks}周后}}
zh_hant: {weeks, plural, other{{weeks} 週後}}
zu: {weeks, plural, =1{evikini elingu-{weeks}} other{emavikini angu-{weeks}}}

# weeksPast
source: {weeks, plural, =0{this week} =1{last week} other{{weeks} weeks ago}}
af: {weeks, plural, =0{hierdie week} =1{{weeks} week gelede} other{{weeks} weke gelede}}
am: {weeks, plural, =0{በዚህ ሳምንት} =1{ከ{weeks} ሳምንት በፊት} other{ከ{weeks} ሳምንታት በፊት}}
ar: {weeks, plural, =0{هذا الأسبوع} zero{قبل {weeks} أسبوع} =1{قبل أسبوع واحد} =2{قبل أسبوعين} few{قبل {weeks} أسابيع} many{قبل {weeks} أسبوعًا} other{قبل {weeks} أسبوع}}
as: {weeks, plural, =0{এই সপ্তাহ} =1{যোৱা সপ্তাহ} other{{weeks} সপ্তাহ পূৰ্বে}}
ast: {weeks, plural, =0{esta selmana} =1{hai {weeks} selmana} other{hai {weeks} selmanes}}
az: {weeks, plural, =0{bu həftə} =1{{weeks} həftə öncə} other{{weeks} həftə öncə}}
bg: {weeks, plural, =0{тази седмица} =1{предходната седмица} other{преди {weeks} седмици}}
bn: {weeks, plural, =0{এই সপ্তাহ} =1{{weeks} সপ্তাহ আগে} other{{weeks} সপ্তাহ আগে}}
br: {weeks, plural, =0{ar sizhun-mañ} =1{{weeks} sizhun zo} =2{{weeks} sizhun zo} few{{weeks} sizhun zo} many{{weeks} a sizhunioù zo} other{{weeks} sizhun zo}}
bs: {weeks, plural, =0{ove sedmice} =1{prije {weeks} sedmicu} few{prije {weeks} sedmice} other{prije {weeks} sedmica}}
bs_cyrl: {weeks, plural, =0{ове седмице} =1{прије {weeks} седмицу} few{прије {weeks} седмице} other{прије {weeks} седмица}}
ca: {weeks, plural, =1{fa {weeks} setmana} other{fa {weeks} setmanes}}
cs: {weeks, plural, =1{před {weeks} týdnem} few{před {weeks} týdny} many{před {weeks} týdne} other{před {weeks} týdny}}
cy: {weeks, plural, =0{yr wythnos hon} zero{{weeks} wythnos yn ôl} =1{{weeks} wythnos yn ôl} =2{{weeks} wythnos yn ôl} few{{weeks} wythnos yn ôl} many{{weeks} wythnos yn ôl} other{{weeks} wythnos yn ôl}}
da: {weeks, plural, =0{denne uge} =1{sidste uge} other{for {weeks} uger siden}}
de: {weeks, plural, =0{diese Woche} =1{vor {weeks} Woche} other{vor {weeks} Wochen}}
el: {weeks, plural, =0{τρέχουσα εβδομάδα} =1{πριν από {weeks} εβδομάδα} other{πριν από {weeks} εβδομάδες}}
eo: {weeks, plural, =0{nuna semajno} =1{antaŭ {weeks} semajno} other{antaŭ {weeks} semajnoj}}
es: {weeks, plural, =0{esta semana} =1{la semana pasada} other{hace {weeks} semanas}}
et: {weeks, plural, =0{käesolev nädal} =1{{weeks} nädala eest} other{{weeks} nädala eest}}
eu: {weeks, plural, =0{aste honetan} =1{Duela {weeks} aste} other{Duela {weeks} aste}}
fa: {weeks, plural, =0{این هفته} =1{{weeks} هفته پیش} other{{weeks} هفته پیش}}
fi: {weeks, plural, =0{tällä viikolla} =1{{weeks} viikko sitten} other{{weeks} viikkoa sitten}}
fil: {weeks, plural, =0{sa linggong ito} =1{{weeks} linggo ang nakalipas} other{{weeks} (na) linggo ang nakalipas}}
fo: {weeks, plural, =0{hesu viku} =1{{weeks} vika síðan} other{{weeks} vikur síðan}}
fr: {weeks, plural, =0{cette semaine} =1{il y a {weeks} semaine} other{il y a {weeks} semaines}}
fy: {weeks, plural, =0{dizze wike} =1{{weeks} wike lyn} other{{weeks} wiken lyn}}
ga: {weeks, plural, =0{an tseachtain seo} =1{{weeks} seachtain ó shin} =2{{weeks} sheachtain ó shin} few{{weeks} seachtaine ó shin} many{{weeks} seachtaine ó shin} other{{weeks} seachtain ó shin}}
gd: {weeks, plural, =1{{weeks} seachdain air ais} =2{{weeks} sheachdain air ais} few{{weeks} seachdainean air ais} other{{weeks} seachdain air ais}}
gl: {weeks, plural, =0{esta semana} =1{hai {weeks} semana} other{hai {weeks} semanas}}
gu: {weeks, plural, =0{આ અઠવાડિયે} =1{ગયા અઠવાડિયે} other{{weeks} અઠવાડિયા પહેલાં}}
he: {weeks, plural, =0{השבוע} =1{לפני שבוע} =2{לפני שבועיים} many{לפני {weeks} שבועות} other{לפני {weeks} שבועות}}
hi: {weeks, plural, =0{इस सप्ताह} =1{{weeks} सप्ताह पहले} other{{weeks} सप्ताह पहले}}
hi_latn: {weeks, plural, =0{is hafte} =1{{weeks} hafte pehle} other{{weeks} hafte pehle}}
hu: {weeks, plural, =0{ez a hét} =1{{weeks} héttel ezelőtt} other{{weeks} héttel ezelőtt}}
hy: {weeks, plural, =0{այս շաբաթ} =1{{weeks} շաբաթ առաջ} other{{weeks} շաբաթ առաջ}}
ia: {weeks, plural, =0{iste septimana} =1{{weeks} septimana retro} other{{weeks} septimanas retro}}
id: {weeks, plural, =0{minggu ini} other{{weeks} minggu yang lalu}}
is: {weeks, plural, =0{í þessari viku} =1{fyrir {weeks} viku} other{fyrir {weeks} vikum}}
it: {weeks, plural, =0{questa settimana} =1{settimana scorsa} other{{weeks} settimane fa}}
ja: {weeks, plural, =0{今週} other{{weeks} 週間前}}
ka: {weeks, plural, =0{ამ კვირაში} =1{გასულ კვირაში} other{{weeks} კვირის წინ}}
kab: {weeks, plural, =0{dduṛt -a} =1{dduṛt izrin} other{{weeks} n dduṛtat aya}}
kk: {weeks, plural, =1{{weeks} апта бұрын} other{{weeks} апта бұрын}}
km: {weeks, plural, =0{សប្ដាហ៍​នេះ} other{{weeks} សប្ដាហ៍​មុន}}
kn: {weeks, plural, =0{ಈ ವಾರ} =1{{weeks} ವಾರದ ಹಿಂದೆ} other{{weeks} ವಾರಗಳ ಹಿಂದೆ}}
ko: {weeks, plural, =0{이번 주} other{{weeks}주 전}}
ky: {weeks, plural, =0{ушул аптада} =1{өткөн аптада} other{{weeks} апта мурун}}
lb: {weeks, plural, =0{dës Woch} =1{lescht Woch} other{viru(n) {weeks} Wochen}}
lo: {weeks, plural, =0{ອາທິດນີ້} other{{weeks} ອາທິດກ່ອນ}}
lt: {weeks, plural, =1{prieš {weeks} savaitę} few{prieš {weeks} savaites} many{prieš {weeks} savaitės} other{prieš {weeks} savaičių}}
lv: {weeks, plural, =0{šajā nedēļā} =1{pagājušajā nedēļā} zero{pirms {weeks} nedēļām} other{pirms {weeks} nedēļām}}
mk: {weeks, plural, =0{оваа седмица} =1{пред {weeks} седмица} other{пред {weeks} седмици}}
ml: {weeks, plural, =0{ഈ ആഴ്ച} =1{കഴിഞ്ഞ ആഴ്‌ച} other{{weeks} ആഴ്ച മുമ്പ്}}
mn: {weeks, plural, =0{энэ долоо хоног} =1{{weeks} долоо хоногийн өмнө} other{{weeks} долоо хоногийн өмнө}}
mr: {weeks, plural, =0{हा आठवडा} =1{मागील आठवडा} other{{weeks} आठवड्यांपूर्वी}}
ms: {weeks, plural, =0{minggu ini} =1{minggu lalu} other{{weeks} minggu lalu}}
mt: {weeks, plural, =0{din il-ġimgħa} =1{il-ġimgħa li għaddiet} few{{weeks} ġimgħat ilu} many{{weeks} ġimgħat ilu} other{{weeks} ġimgħat ilu}}
my: {weeks, plural, =0{ယခု သီတင်းပတ်} other{ပြီးခဲ့သည့် {weeks} ပတ်}}
ne: {weeks, plural, =0{यो हप्ता} =1{गत हप्ता} other{{weeks} हप्ता पहिले}}
nl: {weeks, plural, =0{deze week} =1{{weeks} week geleden} other{{weeks} weken geleden}}
no: {weeks, plural, =0{denne uken} =1{for {weeks} uke siden} other{for {weeks} uker siden}}
or: {weeks, plural, =0{ଏହି ସପ୍ତାହ} =1{{weeks} ସପ୍ତାହରେ} other{{weeks} ସପ୍ତାହ ପୂର୍ବେ}}
pa: {weeks, plural, =0{ਇਹ ਹਫ਼ਤਾ} =1{{weeks} ਹਫ਼ਤਾ ਪਹਿਲਾਂ} other{{weeks} ਹਫ਼ਤੇ ਪਹਿਲਾਂ}}
pl: {weeks, plural, =0{w tym tygodniu} =1{{weeks} tydzień temu} few{{weeks} tygodnie temu} many{{weeks} tygodni temu} other{{weeks} tygodnia temu}}
ps: {weeks, plural, =0{دا اونۍ} =1{{weeks} اونۍ مخکې} other{{weeks} اونۍ مخکې}}
pt: {weeks, plural, =0{esta semana} =1{há {weeks} semana} other{há {weeks} semanas}}
ro: {weeks, plural, =0{săptămâna aceasta} =1{săptămâna trecută} few{acum {weeks} săptămâni} other{acum {weeks} de săptămâni}}
sc: {weeks, plural, =1{{weeks} chida a como} other{{weeks} chidas a como}}
sd: {weeks, plural, =0{هن هفتي} =1{{weeks} هفتا پهرين} other{{weeks} هفتا پهرين}}
se_fi: {weeks, plural, =0{dán vahku} =1{{weeks} vahkku dás ovdal} =2{{weeks} vahku dás ovdal} other{{weeks} vahku dás ovdal}}
si: {weeks, plural, =0{මෙම සතිය} =1{පසුගිය සතිය} other{සති {weeks}කට පෙර}}
sk: {weeks, plural, =0{tento týždeň} =1{pred {weeks} týždňom} few{pred {weeks} týždňami} many{pred {weeks} týždňa} other{pred {weeks} týždňami}}
sl: {weeks, plural, =0{ta teden} =1{prejšnji teden} =2{pred {weeks} tednoma} few{pred {weeks} tedni} other{pred {weeks} tedni}}
sq: {weeks, plural, =0{këtë javë} =1{javën e kaluar} other{{weeks} javë më parë}}
sr: {weeks, plural, =0{ове недеље} =1{пре {weeks} недеље} few{пре {weeks} недеље} other{пре {weeks} недеља}}
sr_cyrl_ba: {weeks, plural, =0{ове недјеље} =1{прије {weeks} недјеље} few{прије {weeks} недјеље} other{прије {weeks} недјеља}}
sr_latn: {weeks, plural, =0{ove nedelje} =1{prošle nedelje} few{pre {weeks} nedelje} other{pre {weeks} nedelja}}
sr_latn_ba: {weeks, plural, =1{prije {weeks} nedjelje} few{prije {weeks} nedjelje} other{prije {weeks} nedjelja}}
sv: {weeks, plural, =0{denna vecka} =1{för {weeks} vecka sedan} other{för {weeks} veckor sedan}}
sw: {weeks, plural, =0{wiki hii} =1{wiki iliyopita} other{wiki {weeks} zilizopita}}
ta: {weeks, plural, =0{இந்த வாரம்} =1{{weeks} வாரத்திற்கு முன்} other{{weeks} வாரங்களுக்கு முன்}}
te: {weeks, plural, =0{ఈ వారం} =1{గత వారం} other{{weeks} వారాల క్రితం}}
tg: {weeks, plural, =0{ҳафтаи ҷорӣ} other{{weeks} ҳафта пеш}}
th: {weeks, plural, =0{สัปดาห์นี้} =1{สัปดาห์ที่แล้ว} other{{weeks} สัปดาห์ที่ผ่านมา}}
tk: {weeks, plural, =0{şu hepde} =1{geçen hepde} other{{weeks} hepde öň}}
tr: {weeks, plural, =0{bu hafta} =1{{weeks} hafta önce} other{{weeks} hafta önce}}
tt: {weeks, plural, =0{бу атнада} =1{узган атнада} other{{weeks} атна элек}}
uk: {weeks, plural, =1{{weeks} тиждень тому} few{{weeks} тижні тому} many{{weeks} тижнів тому} other{{weeks} тижня тому}}
ur: {weeks, plural, =0{اس ہفتہ} =1{{weeks} ہفتہ پہلے} other{{weeks} ہفتے پہلے}}
uz: {weeks, plural, =0{shu hafta} =1{o‘tgan hafta} other{{weeks} hafta oldin}}
uz_cyrl: {weeks, plural, =0{бу ҳафта} =1{ўтган ҳафта} other{{weeks} ҳафта олдин}}
vi: {weeks, plural, =0{tuần này} other{{weeks} tuần trước}}
zh: {weeks, plural, =0{本周} =1{上周} other{{weeks}周前}}
zh_hant: {weeks, plural, =0{本週} =1{上週} other{{weeks} 週前}}
zu: {weeks, plural, =0{leli viki} =1{iviki eledlule} other{amaviki angu-{weeks} edlule}}
