Repository: Mosc/relative_time
Catalog: lib/src/l10n/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, el, eo, es, et, eu, fa, fi, fil, fo, fr, fy, ga, gd, gl, gu, he, hi, hi_latn, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mk, ml, mn, mr, ms, mt, my, ne, nl, no, or, pa, pl, ps, pt, pt_pt, ro, sc, sd, se_fi, si, sk, sl, sq, sr, sr_cyrl_ba, sr_latn, sr_latn_ba, sv, sw, ta, te, tg, th, tk, tr, tt, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# secondsPast
source: {seconds, plural, =0{now} =1{{seconds} second ago} other{{seconds} seconds ago}}
af: {seconds, plural, =0{nou} =1{{seconds} sekonde gelede} other{{seconds} sekondes gelede}}
am: {seconds, plural, =0{አሁን} =1{ከ{seconds} ሰከንድ በፊት} other{ከ{seconds} ሰከንዶች በፊት}}
ar: {seconds, plural, =0{الآن} zero{قبل {seconds} ثانية} =1{قبل ثانية واحدة} =2{قبل ثانيتين} few{قبل {seconds} ثوانِ} many{قبل {seconds} ثانية} other{قبل {seconds} ثانية}}
as: {seconds, plural, =0{এতিয়া} =1{{seconds} ছেকেণ্ড পূৰ্বে} other{{seconds} ছেকেণ্ড পূৰ্বে}}
ast: {seconds, plural, =0{agora} =1{hai {seconds} segundu} other{hai {seconds} segundos}}
az: {seconds, plural, =0{indi} =1{{seconds} saniyə öncə} other{{seconds} saniyə öncə}}
bg: {seconds, plural, =0{сега} =1{преди {seconds} секунда} other{преди {seconds} секунди}}
bn: {seconds, plural, =0{এখন} =1{{seconds} সেকেন্ড পূর্বে} other{{seconds} সেকেন্ড পূর্বে}}
br: {seconds, plural, =0{bremañ} =1{{seconds} eilenn zo} =2{{seconds} eilenn zo} few{{seconds} eilenn zo} many{{seconds} eilenn zo} other{{seconds} eilenn zo}}
bs: {seconds, plural, =0{sada} =1{prije {seconds} sekundu} few{prije {seconds} sekunde} other{prije {seconds} sekundi}}
bs_cyrl: {seconds, plural, =0{сада} =1{прије {seconds} секунд} few{прије {seconds} секунде} other{прије {seconds} секунди}}
ca: {seconds, plural, =1{fa {seconds} segon} other{fa {seconds} segons}}
cs: {seconds, plural, =1{před {seconds} sekundou} few{před {seconds} sekundami} many{před {seconds} sekundy} other{před {seconds} sekundami}}
cy: {seconds, plural, =0{nawr} zero{{seconds} eiliad yn ôl} =1{{seconds} eiliad yn ôl} =2{{seconds} eiliad yn ôl} few{{seconds} eiliad yn ôl} many{{seconds} eiliad yn ôl} other{{seconds} eiliad yn ôl}}
da: {seconds, plural, =0{nu} =1{for {seconds} sekund siden} other{for {seconds} sekunder siden}}
de: {seconds, plural, =0{jetzt} =1{vor {seconds} Sekunde} other{vor {seconds} Sekunden}}
el: {seconds, plural, =0{τώρα} =1{πριν από {seconds} δευτερόλεπτο} other{πριν από {seconds} δευτερόλεπτα}}
eo: {seconds, plural, =1{antaŭ {seconds} sekundo} other{antaŭ {seconds} sekundoj}}
es: {seconds, plural, =0{ahora} =1{hace {seconds} segundo} other{hace {seconds} segundos}}
et: {seconds, plural, =0{nüüd} =1{{seconds} sekundi eest} other{{seconds} sekundi eest}}
eu: {seconds, plural, =0{orain} =1{Duela {seconds} segundo} other{Duela {seconds} segundo}}
fa: {seconds, plural, =0{اکنون} =1{{seconds} ثانیه پیش} other{{seconds} ثانیه پیش}}
fi: {seconds, plural, =0{nyt} =1{{seconds} sekunti sitten} other{{seconds} sekuntia sitten}}
fil: {seconds, plural, =0{ngayon} =1{{seconds} segundo ang nakalipas} other{{seconds} (na) segundo ang nakalipas}}
fo: {seconds, plural, =0{nú} =1{{seconds} sekund síðan} other{{seconds} sekund síðan}}
fr: {seconds, plural, =0{maintenant} =1{il y a {seconds} seconde} other{il y a {seconds} secondes}}
fy: {seconds, plural, =0{nu} =1{{seconds} sekonde lyn} other{{seconds} sekonden lyn}}
ga: {seconds, plural, =0{anois} =1{{seconds} soicind ó shin} =2{{seconds} shoicind ó shin} few{{seconds} shoicind ó shin} many{{seconds} soicind ó shin} other{{seconds} soicind ó shin}}
gd: {seconds, plural, =1{{seconds} diog air ais} =2{{seconds} dhiog air ais} few{{seconds} diogan air ais} other{{seconds} diog air ais}}
gl: {seconds, plural, =0{agora} =1{hai {seconds} segundo} other{hai {seconds} segundos}}
gu: {seconds, plural, =0{હમણાં} =1{{seconds} સેકંડ પહેલાં} other{{seconds} સેકંડ પહેલાં}}
he: {seconds, plural, =0{עכשיו} =1{לפני שנייה} =2{לפני שתי שניות} many{לפני {seconds} שניות} other{לפני {seconds} שניות}}
hi: {seconds, plural, =0{अब} =1{{seconds} सेकंड पहले} other{{seconds} सेकंड पहले}}
hi_latn: {seconds, plural, =0{abhi} =1{{seconds} second pehle} other{{seconds} second pehle}}
hu: {seconds, plural, =0{most} =1{{seconds} másodperccel ezelőtt} other{{seconds} másodperccel ezelőtt}}
hy: {seconds, plural, =0{հիմա} =1{{seconds} վայրկյան առաջ} other{{seconds} վայրկյան առաջ}}
ia: {seconds, plural, =0{ora} =1{{seconds} secunda retro} other{{seconds} secundas retro}}
id: {seconds, plural, =0{sekarang} other{{seconds} detik yang lalu}}
is: {seconds, plural, =0{núna} =1{fyrir {seconds} sekúndu} other{fyrir {seconds} sekúndum}}
it: {seconds, plural, =0{ora} =1{{seconds} secondo fa} other{{seconds} secondi fa}}
ja: {seconds, plural, =0{今} other{{seconds} 秒前}}
ka: {seconds, plural, =0{ახლა} =1{{seconds} წამის წინ} other{{seconds} წამის წინ}}
kab: {seconds, plural, =0{tura} =1{{seconds} n tasint aya} other{{seconds} n tasinin aya}}
kk: {seconds, plural, =1{{seconds} секунд бұрын} other{{seconds} секунд бұрын}}
km: {seconds, plural, =0{ឥឡូវ} other{{seconds} វិនាទី​មុន}}
kn: {seconds, plural, =0{ಈಗ} =1{{seconds} ಸೆಕೆಂಡ್ ಹಿಂದೆ} other{{seconds} ಸೆಕೆಂಡುಗಳ ಹಿಂದೆ}}
ko: {seconds, plural, =0{지금} other{{seconds}초 전}}
ky: {seconds, plural, =0{азыр} =1{{seconds} секунд мурун} other{{seconds} секунд мурун}}
lb: {seconds, plural, =1{virun {seconds} Sekonn} other{viru(n) {seconds} Sekonnen}}
lo: {seconds, plural, =0{ຕອນນີ້} other{{seconds} ວິນາທີກ່ອນ}}
lt: {seconds, plural, =1{prieš {seconds} sekundę} few{prieš {seconds} sekundes} many{prieš {seconds} sekundės} other{prieš {seconds} sekundžių}}
lv: {seconds, plural, =0{tagad} zero{pirms {seconds} sekundēm} =1{pirms {seconds} sekundes} other{pirms {seconds} sekundēm}}
mk: {seconds, plural, =0{сега} =1{пред {seconds} секунда} other{пред {seconds} секунди}}
ml: {seconds, plural, =0{ഇപ്പോൾ} =1{{seconds} സെക്കൻഡ് മുമ്പ്} other{{seconds} സെക്കൻഡ് മുമ്പ്}}
mn: {seconds, plural, =0{одоо} =1{{seconds} секундын өмнө} other{{seconds} секундын өмнө}}
mr: {seconds, plural, =0{आत्ता} =1{{seconds} सेकंदापूर्वी} other{{seconds} सेकंदांपूर्वी}}
ms: {seconds, plural, =0{sekarang} other{{seconds} saat lalu}}
mt: {seconds, plural, =0{issa} =1{sekonda ilu} few{{seconds} sekondi ilu} many{{seconds} sekondi ilu} other{{seconds} sekondi ilu}}
my: {seconds, plural, =0{ယခု} other{ပြီးခဲ့သည့် {seconds} စက္ကန့်}}
ne: {seconds, plural, =0{अहिले} =1{{seconds} सेकेन्ड पहिले} other{{seconds} सेकेन्ड पहिले}}
nl: {seconds, plural, =0{nu} =1{{seconds} seconde geleden} other{{seconds} seconden geleden}}
no: {seconds, plural, =0{nå} =1{for {seconds} sekund siden} other{for {seconds} sekunder siden}}
or: {seconds, plural, =0{ବର୍ତ୍ତମାନ} =1{{seconds} ସେକେଣ୍ଡ ପୂର୍ବେ} other{{seconds} ସେକେଣ୍ଡ ପୂର୍ବେ}}
pa: {seconds, plural, =0{ਹੁਣ} =1{{seconds} ਸਕਿੰਟ ਪਹਿਲਾਂ} other{{seconds} ਸਕਿੰਟ ਪਹਿਲਾਂ}}
pl: {seconds, plural, =0{teraz} =1{{seconds} sekundę temu} few{{seconds} sekundy temu} many{{seconds} sekund temu} other{{seconds} sekundy temu}}
ps: {seconds, plural, =0{اوس} =1{{seconds} ثانيه مخکې} other{{seconds} ثانيې مخکې}}
pt: {seconds, plural, =0{agora} =1{há {seconds} segundo} other{há {seconds} segundos}}
ro: {seconds, plural, =0{acum} =1{acum {seconds} secundă} few{acum {seconds} secunde} other{acum {seconds} de secunde}}
sc: {seconds, plural, =1{{seconds} segundu a como} other{{seconds} segundos a como}}
sd: {seconds, plural, =0{هاڻي} =1{{seconds} سيڪنڊ پهرين} other{{seconds} سيڪنڊ پهرين}}
se_fi: {seconds, plural, =0{dál} =1{{seconds} sekunda áigi} =2{{seconds} sekundda áigi} other{{seconds} sekundda áigi}}
si: {seconds, plural, =0{දැන්} =1{තත්පර {seconds}කට පෙර} other{තත්පර {seconds}කට පෙර}}
sk: {seconds, plural, =0{teraz} =1{pred {seconds} sekundou} few{pred {seconds} sekundami} many{pred {seconds} sekundy} other{pred {seconds} sekundami}}
sl: {seconds, plural, =0{zdaj} =1{pred {seconds} sekundo} =2{pred {seconds} sekundama} few{pred {seconds} sekundami} other{pred {seconds} sekundami}}
sq: {seconds, plural, =0{tani} =1{{seconds} sekondë më parë} other{{seconds} sekonda më parë}}
sr: {seconds, plural, =0{сада} =1{пре {seconds} секунде} few{пре {seconds} секунде} other{пре {seconds} секунди}}
sr_cyrl_ba: {seconds, plural, =1{прије {seconds} секунде} few{прије {seconds} секунде} other{прије {seconds} секунди}}
sr_latn: {seconds, plural, =0{sada} =1{pre {seconds} sekunde} few{pre {seconds} sekunde} other{pre {seconds} sekundi}}
sr_latn_ba: {seconds, plural, =1{prije {seconds} sekunde} few{prije {seconds} sekunde} other{prije {seconds} sekundi}}
sv: {seconds, plural, =0{nu} =1{för {seconds} sekund sedan} other{för {seconds} sekunder sedan}}
sw: {seconds, plural, =0{sasa hivi} =1{Sekunde {seconds} iliyopita} other{Sekunde {seconds} zilizopita}}
ta: {seconds, plural, =0{இப்போது} =1{{seconds} விநாடிக்கு முன்} other{{seconds} விநாடிகளுக்கு முன்}}
te: {seconds, plural, =0{ప్రస్తుతం} =1{{seconds} సెకను క్రితం} other{{seconds} సెకన్ల క్రితం}}
tg: {seconds, plural, =0{ҳозир} other{{seconds} сония пеш}}
th: {seconds, plural, =0{ขณะนี้} other{{seconds} วินาทีที่ผ่านมา}}
tk: {seconds, plural, =0{häzir} =1{{seconds} sekunt öň} other{{seconds} sekunt öň}}
tr: {seconds, plural, =0{şimdi} =1{{seconds} saniye önce} other{{seconds} saniye önce}}
tt: {seconds, plural, =0{хәзер} other{{seconds} секунд элек}}
uk: {seconds, plural, =1{{seconds} секунду тому} few{{seconds} секунди тому} many{{seconds} секунд тому} other{{seconds} секунди тому}}
ur: {seconds, plural, =0{اب} =1{{seconds} سیکنڈ پہلے} other{{seconds} سیکنڈ پہلے}}
uz: {seconds, plural, =0{hozir} =1{{seconds} soniya oldin} other{{seconds} soniya oldin}}
uz_cyrl: {seconds, plural, =0{ҳозир} =1{{seconds} сония олдин} other{{seconds} сония олдин}}
vi: {seconds, plural, =0{bây giờ} other{{seconds} giây trước}}
zh: {seconds, plural, =0{现在} other{{seconds}秒钟前}}
zh_hant: {seconds, plural, =0{現在} other{{seconds} 秒前}}
zu: {seconds, plural, =0{manje} =1{{seconds} isekhondi eledlule} other{{seconds} amasekhondi edlule}}

# secondsPastNumeric
source: {seconds, plural, =1{{seconds} second ago} other{{seconds} seconds ago}}
as: {seconds, plural, =1{{seconds} ছেকেণ্ড পূৰ্বে} other{{seconds} ছেকেণ্ড পূৰ্বে}}
bg: {seconds, plural, =1{преди {seconds} секунда} other{преди {seconds} секунди}}
da: {seconds, plural, =1{for {seconds} sekund siden} other{for {seconds} sekunder siden}}
es: {seconds, plural, =1{hace {seconds} segundo} other{hace {seconds} segundos}}
gu: {seconds, plural, =1{{seconds} સેકંડ પહેલાં} other{{seconds} સેકંડ પહેલાં}}
it: {seconds, plural, =1{{seconds} secondo fa} other{{seconds} secondi fa}}
ka: {seconds, plural, =1{{seconds} წამის წინ} other{{seconds} წამის წინ}}
kab: {seconds, plural, =1{{seconds} n tasint aya} other{{seconds} n tasinin aya}}
ky: {seconds, plural, =1{{seconds} секунд мурун} other{{seconds} секунд мурун}}
lb: {seconds, plural, =1{virun {seconds} Sekonn} other{viru(n) {seconds} Sekonnen}}
lv: {seconds, plural, zero{pirms {seconds} sekundēm} =1{pirms {seconds} sekundes} other{pirms {seconds} sekundēm}}
ml: {seconds, plural, =1{{seconds} സെക്കൻഡ് മുമ്പ്} other{{seconds} സെക്കൻഡ് മുമ്പ്}}
mr: {seconds, plural, =1{{seconds} सेकंदापूर्वी} other{{seconds} सेकंदांपूर्वी}}
ms: {seconds, plural, other{{seconds} saat lalu}}
mt: {seconds, plural, =1{sekonda ilu} few{{seconds} sekondi ilu} many{{seconds} sekondi ilu} other{{seconds} sekondi ilu}}
ne: {seconds, plural, =1{{seconds} सेकेन्ड पहिले} other{{seconds} सेकेन्ड पहिले}}
ro: {seconds, plural, =1{acum {seconds} secundă} few{acum {seconds} secunde} other{acum {seconds} de secunde}}
si: {seconds, plural, =1{තත්පර {seconds}කට පෙර} other{තත්පර {seconds}කට පෙර}}
sl: {seconds, plural, =1{pred {seconds} sekundo} =2{pred {seconds} sekundama} few{pred {seconds} sekundami} other{pred {seconds} sekundami}}
sq: {seconds, plural, =1{{seconds} sekondë më parë} other{{seconds} sekonda më parë}}
sr_latn: {seconds, plural, =1{pre {seconds} sekunde} few{pre {seconds} sekunde} other{pre {seconds} sekundi}}
sw: {seconds, plural, =1{Sekunde {seconds} iliyopita} other{Sekunde {seconds} zilizopita}}
te: {seconds, plural, =1{{seconds} సెకను క్రితం} other{{seconds} సెకన్ల క్రితం}}
th: {seconds, plural, other{{seconds} วินาทีที่ผ่านมา}}
tk: {seconds, plural, =1{{seconds} sekunt öň} other{{seconds} sekunt öň}}
tt: {seconds, plural, other{{seconds} секунд элек}}
uz: {seconds, plural, =1{{seconds} soniya oldin} other{{seconds} soniya oldin}}
uz_cyrl: {seconds, plural, =1{{seconds} сония олдин} other{{seconds} сония олдин}}
zh: {seconds, plural, other{{seconds}秒钟前}}
zh_hant: {seconds, plural, other{{seconds} 秒前}}
zu: {seconds, plural, =1{{seconds} isekhondi eledlule} other{{seconds} amasekhondi edlule}}
