Repository: Mosc/relative_time
Catalog: lib/src/l10n/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, el, eo, es, et, eu, fa, fi, fil, fo, fr, fy, ga, gd, gl, gu, he, hi, hi_latn, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mk, ml, mn, mr, ms, mt, my, ne, nl, no, or, pa, pl, ps, pt, pt_pt, ro, sc, sd, se_fi, si, sk, sl, sq, sr, sr_cyrl_ba, sr_latn, sr_latn_ba, sv, sw, ta, te, tg, th, tk, tr, tt, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# quartersFuture
source: {quarters, plural, =0{this quarter} =1{next quarter} other{in {quarters} quarters}}
af: {quarters, plural, =0{hierdie kwartaal} =1{oor {quarters} kwartaal} other{oor {quarters} kwartale}}
am: {quarters, plural, =0{ይህ ሩብ} =1{+{quarters} ሩብ} other{+{quarters} ሩብ}}
ar: {quarters, plural, =0{هذا الربع} zero{خلال {quarters} ربع سنة} =1{خلال ربع سنة واحد} =2{خلال ربعي سنة} few{خلال {quarters} أرباع سنة} many{خلال {quarters} ربع سنة} other{خلال {quarters} ربع سنة}}
as: {quarters, plural, =0{এই তিনি মাহ} =1{অহা তিনি মাহ} other{{quarters} তিনি মাহত}}
ast: {quarters, plural, =0{esti trimestre} =1{en {quarters} trimestre} other{en {quarters} trimestres}}
az: {quarters, plural, =0{bu rüb} =1{{quarters} rüb ərzində} other{{quarters} rüb ərzində}}
bg: {quarters, plural, =0{това тримесечие} =1{следващо тримесечие} other{след {quarters} тримесечия}}
bn: {quarters, plural, =0{এই ত্রৈমাসিক} =1{{quarters} ত্রৈমাসিকে} other{{quarters} ত্রৈমাসিকে}}
br: {quarters, plural, =0{an trimiziad-mañ} =1{a-benn {quarters} trimiziad} =2{a-benn {quarters} drimiziad} few{a-benn {quarters} zrimiziad} many{a-benn {quarters} a drimiziadoù} other{a-benn {quarters} trimiziad}}
bs: {quarters, plural, =0{ovaj kvartal} =1{za {quarters} kvartal} few{za {quarters} kvartala} other{za {quarters} kvartala}}
ca: {quarters, plural, =1{d’aquí a {quarters} trimestre} other{d’aquí a {quarters} trimestres}}
cs: {quarters, plural, =1{za {quarters} čtvrtletí} few{za {quarters} čtvrtletí} many{za {quarters} čtvrtletí} other{za {quarters} čtvrtletí}}
cy: {quarters, plural, =0{chwarter hwn} zero{ymhen {quarters} chwarter} =1{ymhen {quarters} chwarter} =2{ymhen {quarters} chwarter} few{ymhen {quarters} chwarter} many{ymhen {quarters} chwarter} other{ymhen {quarters} chwarter}}
da: {quarters, plural, =0{dette kvartal} =1{næste kvartal} other{om {quarters} kvartaler}}
de: {quarters, plural, =0{dieses Quartal} =1{in {quarters} Quartal} other{in {quarters} Quartalen}}
el: {quarters, plural, =0{τρέχον τρίμηνο} =1{σε {quarters} τρίμηνο} other{σε {quarters} τρίμηνα}}
eo: {quarters, plural, =1{post {quarters} kvaronjaro} other{post {quarters} kvaronjaroj}}
es: {quarters, plural, =0{este trimestre} =1{el próximo trimestre} other{dentro de {quarters} trimestres}}
et: {quarters, plural, =0{käesolev kvartal} =1{{quarters} kvartali pärast} other{{quarters} kvartali pärast}}
eu: {quarters, plural, =0{hiruhileko hau} =1{{quarters} hiruhileko barru} other{{quarters} hiruhileko barru}}
fa: {quarters, plural, =0{سه‌ماههٔ کنونی} =1{{quarters} سه‌ماههٔ بعد} other{{quarters} سه‌ماههٔ بعد}}
fi: {quarters, plural, =0{tänä neljännesvuonna} =1{{quarters} neljännesvuoden päästä} other{{quarters} neljännesvuoden päästä}}
fil: {quarters, plural, =0{ngayong quarter} =1{sa {quarters} quarter} other{sa {quarters} (na) quarter}}
fo: {quarters, plural, =0{hendan ársfjórðingin} =1{um {quarters} ársfjórðing} other{um {quarters} ársfjórðingar}}
fr: {quarters, plural, =0{ce trimestre} =1{dans {quarters} trimestre} other{dans {quarters} trimestres}}
fy: {quarters, plural, =0{dit fearnsjier} =1{oer {quarters} fearnsjier} other{oer {quarters} fearnsjier}}
ga: {quarters, plural, =0{an ráithe seo} =1{i gceann {quarters} ráithe} =2{i gceann {quarters} ráithe} few{i gceann {quarters} ráithe} many{i gceann {quarters} ráithe} other{i gceann {quarters} ráithe}}
gd: {quarters, plural, =1{an ceann {quarters} chairteil} =2{an ceann {quarters} chairteil} few{an ceann {quarters} cairtealan} other{an ceann {quarters} cairteil}}
gl: {quarters, plural, =0{este trimestre} =1{en {quarters} trimestre} other{en {quarters} trimestres}}
gu: {quarters, plural, =0{આ ત્રિમાસિક} =1{પછીનું ત્રિમાસિક} other{{quarters} ત્રિમાસિકમાં}}
he: {quarters, plural, =0{רבעון זה} =1{ברבעון הבא} =2{בעוד שני רבעונים} many{בעוד {quarters} רבעונים} other{בעוד {quarters} רבעונים}}
hi: {quarters, plural, =0{इस तिमाही} =1{{quarters} तिमाही में} other{{quarters} तिमाहियों में}}
hu: {quarters, plural, =0{ez a negyedév} =1{{quarters} negyedév múlva} other{{quarters} negyedév múlva}}
hy: {quarters, plural, =0{այս եռամսյակ} =1{{quarters} եռամսյակից} other{{quarters} եռամսյակից}}
ia: {quarters, plural, =0{iste trimestre} =1{in {quarters} trimestre} other{in {quarters} trimestres}}
id: {quarters, plural, =0{kuartal ini} other{dalam {quarters} kuartal}}
is: {quarters, plural, =0{þessi ársfjórðungur} =1{eftir {quarters} ársfjórðung} other{eftir {quarters} ársfjórðunga}}
it: {quarters, plural, =0{questo trimestre} =1{trimestre prossimo} other{tra {quarters} trimestri}}
ja: {quarters, plural, =0{今四半期} other{{quarters} 四半期後}}
ka: {quarters, plural, =0{ამ კვარტალში} =1{შემდეგ კვარტალში} other{{quarters} კვარტალში}}
kab: {quarters, plural, =0{akraḍyur-agi} =1{akraḍyur d-iteddun} other{deg {quarters} n ikraḍyuren}}
kk: {quarters, plural, =1{{quarters} тоқсаннан кейін} other{{quarters} тоқсаннан кейін}}
km: {quarters, plural, =0{ត្រីមាស​នេះ} other{{quarters} ត្រីមាសទៀត}}
kn: {quarters, plural, =0{ಈ ತ್ರೈಮಾಸಿಕ} =1{{quarters} ತ್ರೈಮಾಸಿಕದಲ್ಲಿ} other{{quarters} ತ್ರೈಮಾಸಿಕಗಳಲ್ಲಿ}}
ko: {quarters, plural, =0{이번 분기} other{{quarters}분기 후}}
ky: {quarters, plural, =0{бул чейрек} =1{кийинки чейрек} other{{quarters} чейректен кийин}}
lb: {quarters, plural, =1{an {quarters} Quartal} other{a(n) {quarters} Quartaler}}
lo: {quarters, plural, =0{ໄຕຣມາດນີ້} other{ໃນອີກ {quarters} ໄຕຣມາດ}}
lt: {quarters, plural, =1{po {quarters} ketvirčio} few{po {quarters} ketvirčių} many{po {quarters} ketvirčio} other{po {quarters} ketvirčių}}
lv: {quarters, plural, =0{šis ceturksnis} =1{nākamais ceturksnis} zero{pēc {quarters} ceturkšņiem} other{pēc {quarters} ceturkšņiem}}
mk: {quarters, plural, =0{ова тромесечје} =1{за {quarters} тромесечје} other{за {quarters} тромесечја}}
ml: {quarters, plural, =0{ഈ പാദം} =1{അടുത്ത പാദം} other{{quarters} പാദത്തിൽ}}
mn: {quarters, plural, =0{энэ улирал} =1{{quarters} улирлын дараа} other{{quarters} улирлын дараа}}
mr: {quarters, plural, =0{ही तिमाही} =1{पुढील तिमाही} other{{quarters} तिमाहींमध्ये}}
ms: {quarters, plural, =0{suku tahun ini} =1{suku tahun seterusnya} other{dalam {quarters} suku tahun}}
mt: {quarters, plural, =0{il-kwart ta’ sena li qegħdin fih} =1{il-kwart li jmiss tas-sena} few{f’{quarters} kwarti ta’ sena oħrajn} many{f’{quarters} kwarti ta’ sena oħrajn} other{f’{quarters} kwarti ta’ sena oħrajn}}
my: {quarters, plural, =0{ယခု သုံးလပတ်} other{သုံးလပတ်ကာလ {quarters} အတွင်း}}
ne: {quarters, plural, =0{यो सत्र} =1{अर्को सत्र} other{{quarters}सत्रमा}}
nl: {quarters, plural, =0{dit kwartaal} =1{over {quarters} kwartaal} other{over {quarters} kwartalen}}
no: {quarters, plural, =0{dette kvartalet} =1{om {quarters} kvartal} other{om {quarters} kvartaler}}
or: {quarters, plural, =0{ଗତ ତ୍ରୟମାସ} =1{{quarters} ତ୍ରୟମାସରେ} other{{quarters} ତ୍ରୟମାସରେ}}
pa: {quarters, plural, =0{ਇਸ ਤਿਮਾਹੀ} =1{{quarters} ਤਿਮਾਹੀ ਵਿੱਚ} other{{quarters} ਤਿਮਾਹੀਆਂ ਵਿੱਚ}}
pl: {quarters, plural, =0{w tym kwartale} =1{za {quarters} kwartał} few{za {quarters} kwartały} many{za {quarters} kwartałów} other{za {quarters} kwartału}}
ps: {quarters, plural, =0{دا ربع} =1{په {quarters} ربع کې} other{په {quarters} ربعو کې}}
pt: {quarters, plural, =0{este trimestre} =1{em {quarters} trimestre} other{em {quarters} trimestres}}
pt_pt: {quarters, plural, =0{este trimestre} =1{próximo trimestre} other{dentro de {quarters} trimestres}}
ro: {quarters, plural, =0{trimestrul acesta} =1{trimestrul viitor} few{peste {quarters} trimestre} other{peste {quarters} de trimestre}}
sc: {quarters, plural, =1{intro de {quarters} trimestre} other{intro de {quarters} trimestres}}
sd: {quarters, plural, =0{هن ٽي ماهي} =1{{quarters} ٽي ماهي ۾} other{{quarters} ٽي ماهي ۾}}
se_fi: {quarters, plural, =0{dán njealjádasjagi} =1{čuovvovaš {quarters} njealjádasjagi} =2{čuovvovaš {quarters} njealjádasjagi} other{čuovvovaš {quarters} njealjádasjagi}}
si: {quarters, plural, =0{මෙම කාර්තුව} =1{ඊළඟ කාර්තුව} other{කාර්තු {quarters}කින්}}
sk: {quarters, plural, =0{tento štvrťrok} =1{o {quarters} štvrťrok} few{o {quarters} štvrťroky} many{o {quarters} štvrťroka} other{o {quarters} štvrťrokov}}
sl: {quarters, plural, =0{to četrtletje} =1{naslednje četrtletje} =2{čez {quarters} četrtletji} few{čez {quarters} četrtletja} other{čez {quarters} četrtletij}}
sq: {quarters, plural, =0{këtë tremujor} =1{tremujorin e ardhshëm} other{pas {quarters} tremujorësh}}
sr: {quarters, plural, =0{овог квартала} =1{за {quarters} квартал} few{за {quarters} квартала} other{за {quarters} квартала}}
sr_latn: {quarters, plural, =0{ovog kvartala} =1{sledećeg kvartala} few{za {quarters} kvartala} other{za {quarters} kvartala}}
sv: {quarters, plural, =0{detta kvartal} =1{om {quarters} kvartal} other{om {quarters} kvartal}}
sw: {quarters, plural, =0{robo hii ya mwaka} =1{robo ya mwaka inayofuata} other{baada ya robo {quarters}}}
ta: {quarters, plural, =0{இந்த காலாண்டு} =1{+{quarters} காலாண்டில்} other{{quarters} காலாண்டுகளில்}}
te: {quarters, plural, =0{ఈ త్రైమాసికం} =1{తదుపరి త్రైమాసికం} other{{quarters} త్రైమాసికాల్లో}}
tg: {quarters, plural, =0{чоряки ҷорӣ} other{пас аз {quarters} чоряк}}
th: {quarters, plural, =0{ไตรมาสนี้} =1{ไตรมาสหน้า} other{ในอีก {quarters} ไตรมาส}}
tk: {quarters, plural, =0{şu çärýek} =1{indiki çärýek} other{{quarters} çärýekden}}
tr: {quarters, plural, =0{bu çeyrek} =1{{quarters} çeyrek sonra} other{{quarters} çeyrek sonra}}
tt: {quarters, plural, =0{бу кварталда} =1{киләсе кварталда} other{{quarters} кварталдан}}
uk: {quarters, plural, =1{через {quarters} квартал} few{через {quarters} квартали} many{через {quarters} кварталів} other{через {quarters} кварталу}}
ur: {quarters, plural, =0{اس سہ ماہی} =1{{quarters} سہ ماہی میں} other{{quarters} سہ ماہی میں}}
uz: {quarters, plural, =0{shu chorak} =1{keyingi chorak} other{{quarters} chorakdan keyin}}
vi: {quarters, plural, =0{quý này} other{sau {quarters} quý nữa}}
zh: {quarters, plural, =0{本季度} =1{下季度} other{{quarters}个季度后}}
zh_hant: {quarters, plural, =0{這一季} =1{下一季} other{{quarters} 季後}}
zu: {quarters, plural, =0{le kota} =1{ikota ezayo} other{kumakota angu-{quarters} ezayo}}

# quartersFutureNumeric
source: {quarters, plural, =1{in {quarters} quarter} other{in {quarters} quarters}}
as: {quarters, plural, =1{{quarters} তিনি মাহত} other{{quarters} তিনি মাহত}}
bg: {quarters, plural, =1{след {quarters} тримесечие} other{след {quarters} тримесечия}}
da: {quarters, plural, =1{om {quarters} kvartal} other{om {quarters} kvartaler}}
es: {quarters, plural, =1{dentro de {quarters} trimestre} other{dentro de {quarters} trimestres}}
gu: {quarters, plural, =1{{quarters} ત્રિમાસિકમાં} other{{quarters} ત્રિમાસિકમાં}}
it: {quarters, plural, =1{tra {quarters} trimestre} other{tra {quarters} trimestri}}
ka: {quarters, plural, =1{{quarters} კვარტალში} other{{quarters} კვარტალში}}
kab: {quarters, plural, =1{deg {quarters} n ukraḍyur} other{deg {quarters} n ikraḍyuren}}
ky: {quarters, plural, =1{{quarters} чейректен кийин} other{{quarters} чейректен кийин}}
lb: {quarters, plural, =1{an {quarters} Quartal} other{a(n) {quarters} Quartaler}}
lv: {quarters, plural, zero{pēc {quarters} ceturkšņiem} =1{pēc {quarters} ceturkšņa} other{pēc {quarters} ceturkšņiem}}
ml: {quarters, plural, =1{{quarters} പാദത്തിൽ} other{{quarters} പാദത്തിൽ}}
mr: {quarters, plural, =1{{quarters} तिमाहीमध्ये} other{{quarters} तिमाहींमध्ये}}
ms: {quarters, plural, other{dalam {quarters} suku tahun}}
mt: {quarters, plural, =1{f’{quarters} kwarti ta’ sena oħrajn} few{f’{quarters} kwarti ta’ sena oħrajn} many{f’{quarters} kwarti ta’ sena oħrajn} other{f’{quarters} kwarti ta’ sena oħrajn}}
ne: {quarters, plural, =1{+{quarters} सत्रमा} other{{quarters}सत्रमा}}
pt_pt: {quarters, plural, =1{dentro de {quarters} trimestre} other{dentro de {quarters} trimestres}}
ro: {quarters, plural, =1{peste {quarters} trimestru} few{peste {quarters} trimestre} other{peste {quarters} de trimestre}}
si: {quarters, plural, =1{කාර්තු {quarters}කින්} other{කාර්තු {quarters}කින්}}
sl: {quarters, plural, =1{čez {quarters} četrtletje} =2{čez {quarters} četrtletji} few{čez {quarters} četrtletja} other{čez {quarters} četrtletij}}
sq: {quarters, plural, =1{pas {quarters} tremujori} other{pas {quarters} tremujorësh}}
sr_latn: {quarters, plural, =1{za {quarters} kvartal} few{za {quarters} kvartala} other{za {quarters} kvartala}}
sw: {quarters, plural, =1{baada ya robo {quarters}} other{baada ya robo {quarters}}}
te: {quarters, plural, =1{{quarters} త్రైమాసికంలో} other{{quarters} త్రైమాసికాల్లో}}
th: {quarters, plural, other{ในอีก {quarters} ไตรมาส}}
tk: {quarters, plural, =1{{quarters} çärýekden} other{{quarters} çärýekden}}
tt: {quarters, plural, other{{quarters} кварталдан}}
uz: {quarters, plural, =1{{quarters} chorakdan keyin} other{{quarters} chorakdan keyin}}
zh: {quarters, plural, other{{quarters}个季度后}}
zh_hant: {quarters, plural, other{{quarters} 季後}}
zu: {quarters, plural, =1{kwikota engu-{quarters} ezayo} other{kumakota angu-{quarters} ezayo}}

# quartersPast
source: {quarters, plural, =0{this quarter} =1{last quarter} other{{quarters} quarters ago}}
af: {quarters, plural, =0{hierdie kwartaal} =1{{quarters} kwartaal gelede} other{{quarters} kwartale gelede}}
am: {quarters, plural, =0{ይህ ሩብ} =1{{quarters} ሩብ በፊት} other{{quarters} ሩብ በፊት}}
ar: {quarters, plural, =0{هذا الربع} zero{قبل {quarters} ربع سنة} =1{قبل ربع سنة واحد} =2{قبل ربعي سنة} few{قبل {quarters} أرباع سنة} many{قبل {quarters} ربع سنة} other{قبل {quarters} ربع سنة}}
as: {quarters, plural, =0{এই তিনি মাহ} =1{যোৱা তিনি মাহ} other{{quarters} তিনি মাহ পূৰ্বে}}
ast: {quarters, plural, =0{esti trimestre} =1{hai {quarters} trimestre} other{hai {quarters} trimestres}}
az: {quarters, plural, =0{bu rüb} =1{{quarters} rüb öncə} other{{quarters} rüb öncə}}
bg: {quarters, plural, =0{това тримесечие} =1{предходно тримесечие} other{преди {quarters} тримесечия}}
bn: {quarters, plural, =0{এই ত্রৈমাসিক} =1{{quarters} ত্রৈমাসিক আগে} other{{quarters} ত্রৈমাসিক আগে}}
br: {quarters, plural, =0{an trimiziad-mañ} =1{{quarters} trimiziad zo} =2{{quarters} drimiziad zo} few{{quarters} zrimiziad zo} many{{quarters} a zrimiziadoù zo} other{{quarters} trimiziad zo}}
bs: {quarters, plural, =0{ovaj kvartal} =1{prije {quarters} kvartala} few{prije {quarters} kvartala} other{prije {quarters} kvartala}}
ca: {quarters, plural, =1{fa {quarters} trimestre} other{fa {quarters} trimestres}}
cs: {quarters, plural, =1{před {quarters} čtvrtletím} few{před {quarters} čtvrtletími} many{před {quarters} čtvrtletí} other{před {quarters} čtvrtletími}}
cy: {quarters, plural, =0{chwarter hwn} zero{{quarters} o chwarteri yn ôl} =1{{quarters} chwarter yn ôl} =2{{quarters} chwarter yn ôl} few{{quarters} chwarter yn ôl} many{{quarters} chwarter yn ôl} other{{quarters} o chwarteri yn ôl}}
da: {quarters, plural, =0{dette kvartal} =1{sidste kvartal} other{for {quarters} kvartaler siden}}
de: {quarters, plural, =0{dieses Quartal} =1{vor {quarters} Quartal} other{vor {quarters} Quartalen}}
el: {quarters, plural, =0{τρέχον τρίμηνο} =1{πριν από {quarters} τρίμηνο} other{πριν από {quarters} τρίμηνα}}
eo: {quarters, plural, =1{antaŭ {quarters} kvaronjaro} other{antaŭ {quarters} kvaronjaroj}}
es: {quarters, plural, =0{este trimestre} =1{el trimestre pasado} other{hace {quarters} trimestres}}
et: {quarters, plural, =0{käesolev kvartal} =1{{quarters} kvartali eest} other{{quarters} kvartali eest}}
eu: {quarters, plural, =0{hiruhileko hau} =1{Duela {quarters} hiruhileko} other{Duela {quarters} hiruhileko}}
fa: {quarters, plural, =0{سه‌ماههٔ کنونی} =1{{quarters} سه‌ماههٔ پیش} other{{quarters} سه‌ماههٔ پیش}}
fi: {quarters, plural, =0{tänä neljännesvuonna} =1{{quarters} neljännesvuosi sitten} other{{quarters} neljännesvuotta sitten}}
fil: {quarters, plural, =0{ngayong quarter} =1{{quarters} quarter ang nakalipas} other{{quarters} (na) quarter ang nakalipas}}
fo: {quarters, plural, =0{hendan ársfjórðingin} =1{{quarters} ársfjórðing síðan} other{{quarters} ársfjórðingar síðan}}
fr: {quarters, plural, =0{ce trimestre} =1{il y a {quarters} trimestre} other{il y a {quarters} trimestres}}
fy: {quarters, plural, =0{dit fearnsjier} =1{{quarters} fearnsjier lyn} other{{quarters} fearnsjier lyn}}
ga: {quarters, plural, =0{an ráithe seo} =1{{quarters} ráithe ó shin} =2{{quarters} ráithe ó shin} few{{quarters} ráithe ó shin} many{{quarters} ráithe ó shin} other{{quarters} ráithe ó shin}}
gd: {quarters, plural, =1{{quarters} chairteal air ais} =2{{quarters} chairteal air ais} few{{quarters} cairtealan air ais} other{{quarters} cairteal air ais}}
gl: {quarters, plural, =0{este trimestre} =1{hai {quarters} trimestre} other{hai {quarters} trimestres}}
gu: {quarters, plural, =0{આ ત્રિમાસિક} =1{છેલ્લું ત્રિમાસિક} other{{quarters} ત્રિમાસિક પહેલાં}}
he: {quarters, plural, =0{רבעון זה} =1{ברבעון הקודם} =2{לפני שני רבעונים} many{לפני {quarters} רבעונים} other{לפני {quarters} רבעונים}}
hi: {quarters, plural, =0{इस तिमाही} =1{{quarters} तिमाही पहले} other{{quarters} तिमाही पहले}}
hu: {quarters, plural, =0{ez a negyedév} =1{{quarters} negyedévvel ezelőtt} other{{quarters} negyedévvel ezelőtt}}
hy: {quarters, plural, =0{այս եռամսյակ} =1{{quarters} եռամսյակ առաջ} other{{quarters} եռամսյակ առաջ}}
ia: {quarters, plural, =0{iste trimestre} =1{{quarters} trimestre retro} other{{quarters} trimestres retro}}
id: {quarters, plural, =0{kuartal ini} other{{quarters} kuartal yang lalu}}
is: {quarters, plural, =0{þessi ársfjórðungur} =1{fyrir {quarters} ársfjórðungi} other{fyrir {quarters} ársfjórðungum}}
it: {quarters, plural, =0{questo trimestre} =1{trimestre scorso} other{{quarters} trimestri fa}}
ja: {quarters, plural, =0{今四半期} other{{quarters} 四半期前}}
ka: {quarters, plural, =0{ამ კვარტალში} =1{გასულ კვარტალში} other{{quarters} კვარტალის წინ}}
kab: {quarters, plural, =0{akraḍyur-agi} =1{akraḍyur izrin} other{{quarters} n yikraḍyuren aya}}
kk: {quarters, plural, =1{{quarters} тоқсан бұрын} other{{quarters} тоқсан бұрын}}
km: {quarters, plural, =0{ត្រីមាស​នេះ} other{{quarters} ត្រីមាស​មុន}}
kn: {quarters, plural, =0{ಈ ತ್ರೈಮಾಸಿಕ} =1{{quarters} ತ್ರೈಮಾಸಿಕದ ಹಿಂದೆ} other{{quarters} ತ್ರೈಮಾಸಿಕಗಳ ಹಿಂದೆ}}
ko: {quarters, plural, =0{이번 분기} other{{quarters}분기 전}}
ky: {quarters, plural, =0{бул чейрек} =1{акыркы чейрек} other{{quarters} чейрек мурун}}
lb: {quarters, plural, =1{virun {quarters} Quartal} other{viru(n) {quarters} Quartaler}}
lo: {quarters, plural, =0{ໄຕຣມາດນີ້} other{{quarters} ໄຕຣມາດກ່ອນ}}
lt: {quarters, plural, =1{prieš {quarters} ketvirtį} few{prieš {quarters} ketvirčius} many{prieš {quarters} ketvirčio} other{prieš {quarters} ketvirčių}}
lv: {quarters, plural, =0{šis ceturksnis} =1{pēdējais ceturksnis} zero{pirms {quarters} ceturkšņiem} other{pirms {quarters} ceturkšņiem}}
mk: {quarters, plural, =0{ова тромесечје} =1{пред {quarters} тромесечје} other{пред {quarters} тромесечја}}
ml: {quarters, plural, =0{ഈ പാദം} =1{കഴിഞ്ഞ പാദം} other{{quarters} പാദം മുമ്പ്}}
mn: {quarters, plural, =0{энэ улирал} =1{{quarters} улирлын өмнө} other{{quarters} улирлын өмнө}}
mr: {quarters, plural, =0{ही तिमाही} =1{मागील तिमाही} other{{quarters} तिमाहींपूर्वी}}
ms: {quarters, plural, =0{suku tahun ini} =1{suku tahun lalu} other{{quarters} suku tahun lalu}}
mt: {quarters, plural, =0{il-kwart ta’ sena li qegħdin fih} =1{il-kwart ta’ sena li għadda} few{{quarters} kwarti ta’ sena li għaddew} many{{quarters} kwarti ta’ sena li għaddew} other{{quarters} kwarti ta’ sena li għaddew}}
my: {quarters, plural, =0{ယခု သုံးလပတ်} other{ပြီးခဲ့သည့် သုံးလပတ်ကာလ {quarters} ခုအတွင်း}}
ne: {quarters, plural, =0{यो सत्र} =1{अघिल्लो सत्र} other{{quarters}सत्र अघि}}
nl: {quarters, plural, =0{dit kwartaal} =1{{quarters} kwartaal geleden} other{{quarters} kwartalen geleden}}
no: {quarters, plural, =0{dette kvartalet} =1{for {quarters} kvartal siden} other{for {quarters} kvartaler siden}}
or: {quarters, plural, =0{ଗତ ତ୍ରୟମାସ} =1{{quarters} ତ୍ରୟମାସ ପୂର୍ବେ} other{{quarters} ତ୍ରୟମାସ ପୂର୍ବେ}}
pa: {quarters, plural, =0{ਇਸ ਤਿਮਾਹੀ} =1{{quarters} ਤਿਮਾਹੀ ਪਹਿਲਾਂ} other{{quarters} ਤਿਮਾਹੀਆਂ ਪਹਿਲਾਂ}}
pl: {quarters, plural, =0{w tym kwartale} =1{{quarters} kwartał temu} few{{quarters} kwartały temu} many{{quarters} kwartałów temu} other{{quarters} kwartału temu}}
ps: {quarters, plural, =0{دا ربع} =1{{quarters} ربع مخکې} other{{quarters} ربعې مخکې}}
pt: {quarters, plural, =0{este trimestre} =1{há {quarters} trimestre} other{há {quarters} trimestres}}
ro: {quarters, plural, =0{trimestrul acesta} =1{trimestrul trecut} few{acum {quarters} trimestre} other{acum {quarters} de trimestre}}
sc: {quarters, plural, =1{{quarters} trimestre a como} other{{quarters} trimestres a como}}
sd: {quarters, plural, =0{هن ٽي ماهي} =1{{quarters} ٽي ماهي پهرين} other{{quarters} ٽي ماهي پهرين}}
se_fi: {quarters, plural, =0{dán njealjádasjagi} =1{-{quarters} njealjádasjagi dás ovdal} =2{-{quarters} njealjádasjagi dás ovdal} other{-{quarters} njealjádasjagi dás ovdal}}
si: {quarters, plural, =0{මෙම කාර්තුව} =1{පසුගිය කාර්තුව} other{කාර්තු {quarters}කට පෙර}}
sk: {quarters, plural, =0{tento štvrťrok} =1{pred {quarters} štvrťrokom} few{pred {quarters} štvrťrokmi} many{pred {quarters} štvrťroka} other{pred {quarters} štvrťrokmi}}
sl: {quarters, plural, =0{to četrtletje} =1{zadnje četrtletje} =2{pred {quarters} četrtletjema} few{pred {quarters} četrtletji} other{pred {quarters} četrtletji}}
sq: {quarters, plural, =0{këtë tremujor} =1{tremujorin e kaluar} other{{quarters} tremujorë më parë}}
sr: {quarters, plural, =0{овог квартала} =1{пре {quarters} квартала} few{пре {quarters} квартала} other{пре {quarters} квартала}}
sr_cyrl_ba: {quarters, plural, =0{овог квартала} =1{прије {quarters} квартала} few{прије {quarters} квартала} other{прије {quarters} квартала}}
sr_latn: {quarters, plural, =0{ovog kvartala} =1{prošlog kvartala} few{pre {quarters} kvartala} other{pre {quarters} kvartala}}
sr_latn_ba: {quarters, plural, =1{prije {quarters} kvartala} few{prije {quarters} kvartala} other{prije {quarters} kvartala}}
sv: {quarters, plural, =0{detta kvartal} =1{för {quarters} kvartal sedan} other{för {quarters} kvartal sedan}}
sw: {quarters, plural, =0{robo hii ya mwaka} =1{robo ya mwaka iliyopita} other{robo {quarters} zilizopita}}
ta: {quarters, plural, =0{இந்த காலாண்டு} =1{{quarters} காலாண்டுக்கு முன்} other{{quarters} காலாண்டுகளுக்கு முன்}}
te: {quarters, plural, =0{ఈ త్రైమాసికం} =1{గత త్రైమాసికం} other{{quarters} త్రైమాసికాల క్రితం}}
tg: {quarters, plural, =0{чоряки ҷорӣ} other{{quarters} чоряк пеш}}
th: {quarters, plural, =0{ไตรมาสนี้} =1{ไตรมาสที่แล้ว} other{{quarters} ไตรมาสที่แล้ว}}
tk: {quarters, plural, =0{şu çärýek} =1{geçen çärýek} other{{quarters} çärýek öň}}
tr: {quarters, plural, =0{bu çeyrek} =1{{quarters} çeyrek önce} other{{quarters} çeyrek önce}}
tt: {quarters, plural, =0{бу кварталда} =1{узган кварталда} other{{quarters} квартал элек}}
uk: {quarters, plural, =1{{quarters} квартал тому} few{{quarters} квартали тому} many{{quarters} кварталів тому} other{{quarters} кварталу тому}}
ur: {quarters, plural, =0{اس سہ ماہی} =1{{quarters} سہ ماہی پہلے} other{{quarters} سہ ماہی پہلے}}
uz: {quarters, plural, =0{shu chorak} =1{o‘tgan chorak} other{{quarters} chorak oldin}}
vi: {quarters, plural, =0{quý này} other{{quarters} quý trước}}
zh: {quarters, plural, =0{本季度} =1{上季度} other{{quarters}个季度前}}
zh_hant: {quarters, plural, =0{這一季} =1{上一季} other{{quarters} 季前}}
zu: {quarters, plural, =0{le kota} =1{ikota edlule} other{{quarters} amakota adlule}}
