Repository: Mosc/relative_time
Catalog: lib/src/l10n/relative_time_localizations_*.arb
Languages: af, am, ar, as, ast, az, bg, bn, br, bs, bs_cyrl, ca, cs, cy, da, de, el, eo, es, et, eu, fa, fi, fil, fo, fr, fy, ga, gd, gl, gu, he, hi, hi_latn, hu, hy, ia, id, is, it, ja, ka, kab, kk, km, kn, ko, ky, lb, lo, lt, lv, mk, ml, mn, mr, ms, mt, my, ne, nl, no, or, pa, pl, ps, pt, pt_pt, ro, sc, sd, se_fi, si, sk, sl, sq, sr, sr_cyrl_ba, sr_latn, sr_latn_ba, sv, sw, ta, te, tg, th, tk, tr, tt, uk, ur, uz, uz_cyrl, vi, zh, zh_hant, zu

# minutesPastNumeric
source: {minutes, plural, =1{{minutes} minute ago} other{{minutes} minutes ago}}
as: {minutes, plural, =1{{minutes} মিনিট পূৰ্বে} other{{minutes} মিনিট পূৰ্বে}}
bg: {minutes, plural, =1{преди {minutes} минута} other{преди {minutes} минути}}
da: {minutes, plural, =1{for {minutes} minut siden} other{for {minutes} minutter siden}}
es: {minutes, plural, =1{hace {minutes} minuto} other{hace {minutes} minutos}}
gu: {minutes, plural, =1{{minutes} મિનિટ પહેલાં} other{{minutes} મિનિટ પહેલાં}}
it: {minutes, plural, =1{{minutes} minuto fa} other{{minutes} minuti fa}}
ka: {minutes, plural, =1{{minutes} წუთის წინ} other{{minutes} წუთის წინ}}
kab: {minutes, plural, =1{{minutes} n tesdat aya} other{{minutes} n tesdatin aya}}
ky: {minutes, plural, =1{{minutes} мүнөт мурун} other{{minutes} мүнөт мурун}}
lb: {minutes, plural, =1{virun {minutes} Minutt} other{viru(n) {minutes} Minutten}}
lv: {minutes, plural, zero{pirms {minutes} minūtēm} =1{pirms {minutes} minūtes} other{pirms {minutes} minūtēm}}
ml: {minutes, plural, =1{{minutes} മിനിറ്റ് മുമ്പ്} other{{minutes} മിനിറ്റ് മുമ്പ്}}
mr: {minutes, plural, =1{{minutes} मिनिटापूर्वी} other{{minutes} मिनिटांपूर्वी}}
ms: {minutes, plural, other{{minutes} minit lalu}}
mt: {minutes, plural, =1{minuta ilu} few{{minutes} minuti ilu} many{{minutes} minuti ilu} other{{minutes} minuti ilu}}
ne: {minutes, plural, =1{{minutes} मिनेट पहिले} other{{minutes} मिनेट पहिले}}
ro: {minutes, plural, =1{acum {minutes} minut} few{acum {minutes} minute} other{acum {minutes} de minute}}
si: {minutes, plural, =1{මිනිත්තු {minutes}කට පෙර} other{මිනිත්තු {minutes}කට පෙර}}
sl: {minutes, plural, =1{pred {minutes} minuto} =2{pred {minutes} minutama} few{pred {minutes} minutami} other{pred {minutes} minutami}}
sq: {minutes, plural, =1{{minutes} minutë më parë} other{{minutes} minuta më parë}}
sr_latn: {minutes, plural, =1{pre {minutes} minuta} few{pre {minutes} minuta} other{pre {minutes} minuta}}
sw: {minutes, plural, =1{dakika {minutes} iliyopita} other{dakika {minutes} zilizopita}}
te: {minutes, plural, =1{{minutes} నిమిషం క్రితం} other{{minutes} నిమిషాల క్రితం}}
th: {minutes, plural, other{{minutes} นาทีที่ผ่านมา}}
tk: {minutes, plural, =1{{minutes} minut öň} other{{minutes} minut öň}}
tt: {minutes, plural, other{{minutes} минут элек}}
uz: {minutes, plural, =1{{minutes} daqiqa oldin} other{{minutes} daqiqa oldin}}
uz_cyrl: {minutes, plural, =1{{minutes} дақиқа олдин} other{{minutes} дақиқа олдин}}
zh: {minutes, plural, other{{minutes}分钟前}}
zh_hant: {minutes, plural, other{{minutes} 分鐘前}}
zu: {minutes, plural, =1{{minutes} iminithi eledlule} other{{minutes} amaminithi edlule}}

# secondsFuture
source: {seconds, plural, =0{now} =1{in {seconds} second} other{in {seconds} seconds}}
af: {seconds, plural, =0{nou} =1{oor {seconds} sekonde} other{oor {seconds} sekondes}}
am: {seconds, plural, =0{አሁን} =1{በ{seconds} ሰከንድ ውስጥ} other{በ{seconds} ሰከንዶች ውስጥ}}
ar: {seconds, plural, =0{الآن} zero{خلال {seconds} ثانية} =1{خلال ثانية واحدة} =2{خلال ثانيتين} few{خلال {seconds} ثوانٍ} many{خلال {seconds} ثانية} other{خلال {seconds} ثانية}}
as: {seconds, plural, =0{এতিয়া} =1{{seconds} ছেকেণ্ডত} other{{seconds} ছেকেণ্ডত}}
ast: {seconds, plural, =0{agora} =1{en {seconds} segundu} other{en {seconds} segundos}}
az: {seconds, plural, =0{indi} =1{{seconds} saniyə ərzində} other{{seconds} saniyə ərzində}}
bg: {seconds, plural, =0{сега} =1{след {seconds} секунда} other{след {seconds} секунди}}
bn: {seconds, plural, =0{এখন} =1{{seconds} সেকেন্ডে} other{{seconds} সেকেন্ডে}}
br: {seconds, plural, =0{bremañ} =1{a-benn {seconds} eilenn} =2{a-benn {seconds} eilenn} few{a-benn {seconds} eilenn} many{a-benn {seconds} a eilennoù} other{a-benn {seconds} eilenn}}
bs: {seconds, plural, =0{sada} =1{za {seconds} sekundu} few{za {seconds} sekunde} other{za {seconds} sekundi}}
bs_cyrl: {seconds, plural, =0{сада} =1{за {seconds} секунд} few{за {seconds} секунде} other{за {seconds} секунди}}
ca: {seconds, plural, =1{d’aquí a {seconds} segon} other{d’aquí a {seconds} segons}}
cs: {seconds, plural, =1{za {seconds} sekundu} few{za {seconds} sekundy} many{za {seconds} sekundy} other{za {seconds} sekund}}
cy: {seconds, plural, =0{nawr} zero{ymhen {seconds} eiliad} =1{ymhen {seconds} eiliad} =2{ymhen {seconds} eiliad} few{ymhen {seconds} eiliad} many{ymhen {seconds} eiliad} other{ymhen {seconds} eiliad}}
da: {seconds, plural, =0{nu} =1{om {seconds} sekund} other{om {seconds} sekunder}}
de: {seconds, plural, =0{jetzt} =1{in {seconds} Sekunde} other{in {seconds} Sekunden}}
el: {seconds, plural, =0{τώρα} =1{σε {seconds} δευτερόλεπτο} other{σε {seconds} δευτερόλεπτα}}
eo: {seconds, plural, =1{post {seconds} sekundo} other{post {seconds} sekundoj}}
es: {seconds, plural, =0{ahora} =1{dentro de {seconds} segundo} other{dentro de {seconds} segundos}}
et: {seconds, plural, =0{nüüd} =1{{seconds} sekundi pärast} other{{seconds} sekundi pärast}}
eu: {seconds, plural, =0{orain} =1{{seconds} segundo barru} other{{seconds} segundo barru}}
fa: {seconds, plural, =0{اکنون} =1{{seconds} ثانیه بعد} other{{seconds} ثانیه بعد}}
fi: {seconds, plural, =0{nyt} =1{{seconds} sekunnin päästä} other{{seconds} sekunnin päästä}}
fil: {seconds, plural, =0{ngayon} =1{sa {seconds} segundo} other{sa {seconds} (na) segundo}}
fo: {seconds, plural, =0{nú} =1{um {seconds} sekund} other{um {seconds} sekund}}
fr: {seconds, plural, =0{maintenant} =1{dans {seconds} seconde} other{dans {seconds} secondes}}
fy: {seconds, plural, =0{nu} =1{Oer {seconds} sekonde} other{Oer {seconds} sekonden}}
ga: {seconds, plural, =0{anois} =1{i gceann {seconds} soicind} =2{i gceann {seconds} shoicind} few{i gceann {seconds} shoicind} many{i gceann {seconds} soicind} other{i gceann {seconds} soicind}}
gd: {seconds, plural, =1{an ceann {seconds} diog} =2{an ceann {seconds} dhiog} few{an ceann {seconds} diogan} other{an ceann {seconds} diog}}
gl: {seconds, plural, =0{agora} =1{en {seconds} segundo} other{en {seconds} segundos}}
gu: {seconds, plural, =0{હમણાં} =1{{seconds} સેકંડમાં} other{{seconds} સેકંડમાં}}
he: {seconds, plural, =0{עכשיו} =1{בעוד שנייה} =2{בעוד שתי שניות} many{בעוד {seconds} שניות} other{בעוד {seconds} שניות}}
hi: {seconds, plural, =0{अब} =1{{seconds} सेकंड में} other{{seconds} सेकंड में}}
hi_latn: {seconds, plural, =0{abhi} =1{{seconds} second mein} other{{seconds} second mein}}
hu: {seconds, plural, =0{most} =1{{seconds} másodperc múlva} other{{seconds} másodperc múlva}}
hy: {seconds, plural, =0{հիմա} =1{{seconds} վայրկյանից} other{{seconds} վայրկյանից}}
ia: {seconds, plural, =0{ora} =1{in {seconds} secunda} other{in {seconds} secundas}}
id: {seconds, plural, =0{sekarang} other{dalam {seconds} detik}}
is: {seconds, plural, =0{núna} =1{eftir {seconds} sekúndu} other{eftir {seconds} sekúndur}}
it: {seconds, plural, =0{ora} =1{tra {seconds} secondo} other{tra {seconds} secondi}}
ja: {seconds, plural, =0{今} other{{seconds} 秒後}}
ka: {seconds, plural, =0{ახლა} =1{{seconds} წამში} other{{seconds} წამში}}
kab: {seconds, plural, =0{tura} =1{deg {seconds} n tasint} other{deg {seconds} n tasinin}}
kk: {seconds, plural, =1{{seconds} секундтан кейін} other{{seconds} секундтан кейін}}
km: {seconds, plural, =0{ឥឡូវ} other{{seconds} វិនាទីទៀត}}
kn: {seconds, plural, =0{ಈಗ} =1{{seconds} ಸೆಕೆಂಡ್‌ನಲ್ಲಿ} other{{seconds} ಸೆಕೆಂಡ್‌ಗಳಲ್ಲಿ}}
ko: {seconds, plural, =0{지금} other{{seconds}초 후}}
ky: {seconds, plural, =0{азыр} =1{{seconds} секунддан кийин} other{{seconds} секунддан кийин}}
lb: {seconds, plural, =1{an {seconds} Sekonn} other{a(n) {seconds} Sekonnen}}
lo: {seconds, plural, =0{ຕອນນີ້} other{ໃນອີກ {seconds} ວິນາທີ}}
lt: {seconds, plural, =1{po {seconds} sekundės} few{po {seconds} sekundžių} many{po {seconds} sekundės} other{po {seconds} sekundžių}}
lv: {seconds, plural, =0{tagad} zero{pēc {seconds} sekundēm} =1{pēc {seconds} sekundes} other{pēc {seconds} sekundēm}}
mk: {seconds, plural, =0{сега} =1{за {seconds} секунда} other{за {seconds} секунди}}
ml: {seconds, plural, =0{ഇപ്പോൾ} =1{{seconds} സെക്കൻഡിൽ} other{{seconds} സെക്കൻഡിൽ}}
mn: {seconds, plural, =0{одоо} =1{{seconds} секундын дараа} other{{seconds} секундын дараа}}
mr: {seconds, plural, =0{आत्ता} =1{{seconds} सेकंदामध्ये} other{{seconds} सेकंदांमध्ये}}
ms: {seconds, plural, =0{sekarang} other{dalam {seconds} saat}}
mt: {seconds, plural, =0{issa} =1{sa {seconds} sekondi oħra} few{sa {seconds} sekondi oħra} many{sa {seconds} sekondi oħra} other{sa {seconds} sekondi oħra}}
my: {seconds, plural, =0{ယခု} other{{seconds} စက္ကန့်အတွင်း}}
ne: {seconds, plural, =0{अहिले} =1{{seconds} सेकेन्डमा} other{{seconds} सेकेन्डमा}}
nl: {seconds, plural, =0{nu} =1{over {seconds} seconde} other{over {seconds} seconden}}
no: {seconds, plural, =0{nå} =1{om {seconds} sekund} other{om {seconds} sekunder}}
or: {seconds, plural, =0{ବର୍ତ୍ତମାନ} =1{{seconds} ସେକେଣ୍ଡରେ} other{{seconds} ସେକେଣ୍ଡରେ}}
pa: {seconds, plural, =0{ਹੁਣ} =1{{seconds} ਸਕਿੰਟ ਵਿੱਚ} other{{seconds} ਸਕਿੰਟਾਂ ਵਿੱਚ}}
pl: {seconds, plural, =0{teraz} =1{za {seconds} sekundę} few{za {seconds} sekundy} many{za {seconds} sekund} other{za {seconds} sekundy}}
ps: {seconds, plural, =0{اوس} =1{په {seconds} ثانيه کې} other{په {seconds} ثانيو کې}}
pt: {seconds, plural, =0{agora} =1{em {seconds} segundo} other{em {seconds} segundos}}
pt_pt: {seconds, plural, =1{dentro de {seconds} segundo} other{dentro de {seconds} segundos}}
ro: {seconds, plural, =0{acum} =1{peste {seconds} secundă} few{peste {seconds} secunde} other{peste {seconds} de secunde}}
sc: {seconds, plural, =1{intro de {seconds} segundu} other{intro de {seconds} segundos}}
sd: {seconds, plural, =0{هاڻي} =1{{seconds} سيڪنڊن ۾} other{{seconds} سيڪنڊن ۾}}
se_fi: {seconds, plural, =0{dál} =1{{seconds} sekundda siste} =2{{seconds} sekundda siste} other{{seconds} sekundda siste}}
si: {seconds, plural, =0{දැන්} =1{තත්පර {seconds}කින්} other{තත්පර {seconds}කින්}}
sk: {seconds, plural, =0{teraz} =1{o {seconds} sekundu} few{o {seconds} sekundy} many{o {seconds} sekundy} other{o {seconds} sekúnd}}
sl: {seconds, plural, =0{zdaj} =1{čez {seconds} sekundo} =2{čez {seconds} sekundi} few{čez {seconds} sekunde} other{čez {seconds} sekund}}
sq: {seconds, plural, =0{tani} =1{pas {seconds} sekonde} other{pas {seconds} sekondash}}
sr: {seconds, plural, =0{сада} =1{за {seconds} секунду} few{за {seconds} секунде} other{за {seconds} секунди}}
sr_latn: {seconds, plural, =0{sada} =1{za {seconds} sekundu} few{za {seconds} sekunde} other{za {seconds} sekundi}}
sv: {seconds, plural, =0{nu} =1{om {seconds} sekund} other{om {seconds} sekunder}}
sw: {seconds, plural, =0{sasa hivi} =1{baada ya sekunde {seconds}} other{baada ya sekunde {seconds}}}
ta: {seconds, plural, =0{இப்போது} =1{{seconds} விநாடியில்} other{{seconds} விநாடிகளில்}}
te: {seconds, plural, =0{ప్రస్తుతం} =1{{seconds} సెకనులో} other{{seconds} సెకన్లలో}}
tg: {seconds, plural, =0{ҳозир} other{пас аз {seconds} сония}}
th: {seconds, plural, =0{ขณะนี้} other{ในอีก {seconds} วินาที}}
tk: {seconds, plural, =0{häzir} =1{{seconds} sekuntdan} other{{seconds} sekuntdan}}
tr: {seconds, plural, =0{şimdi} =1{{seconds} saniye sonra} other{{seconds} saniye sonra}}
tt: {seconds, plural, =0{хәзер} other{{seconds} секундтан}}
uk: {seconds, plural, =1{через {seconds} секунду} few{через {seconds} секунди} many{через {seconds} секунд} other{через {seconds} секунди}}
ur: {seconds, plural, =0{اب} =1{{seconds} سیکنڈ میں} other{{seconds} سیکنڈ میں}}
uz: {seconds, plural, =0{hozir} =1{{seconds} soniyadan keyin} other{{seconds} soniyadan keyin}}
uz_cyrl: {seconds, plural, =0{ҳозир} =1{{seconds} сониядан сўнг} other{{seconds} сониядан сўнг}}
vi: {seconds, plural, =0{bây giờ} other{sau {seconds} giây nữa}}
zh: {seconds, plural, =0{现在} other{{seconds}秒钟后}}
zh_hant: {seconds, plural, =0{現在} other{{seconds} 秒後}}
zu: {seconds, plural, =0{manje} =1{kusekhondi elingu-{seconds} elizayo} other{kumasekhondi angu-{seconds} ezayo}}

# secondsFutureNumeric
source: {seconds, plural, =1{in {seconds} second} other{in {seconds} seconds}}
as: {seconds, plural, =1{{seconds} ছেকেণ্ডত} other{{seconds} ছেকেণ্ডত}}
bg: {seconds, plural, =1{след {seconds} секунда} other{след {seconds} секунди}}
da: {seconds, plural, =1{om {seconds} sekund} other{om {seconds} sekunder}}
es: {seconds, plural, =1{dentro de {seconds} segundo} other{dentro de {seconds} segundos}}
gu: {seconds, plural, =1{{seconds} સેકંડમાં} other{{seconds} સેકંડમાં}}
it: {seconds, plural, =1{tra {seconds} secondo} other{tra {seconds} secondi}}
ka: {seconds, plural, =1{{seconds} წამში} other{{seconds} წამში}}
kab: {seconds, plural, =1{deg {seconds} n tasint} other{deg {seconds} n tasinin}}
ky: {seconds, plural, =1{{seconds} секунддан кийин} other{{seconds} секунддан кийин}}
lb: {seconds, plural, =1{an {seconds} Sekonn} other{a(n) {seconds} Sekonnen}}
lv: {seconds, plural, zero{pēc {seconds} sekundēm} =1{pēc {seconds} sekundes} other{pēc {seconds} sekundēm}}
ml: {seconds, plural, =1{{seconds} സെക്കൻഡിൽ} other{{seconds} സെക്കൻഡിൽ}}
mr: {seconds, plural, =1{{seconds} सेकंदामध्ये} other{{seconds} सेकंदांमध्ये}}
ms: {seconds, plural, other{dalam {seconds} saat}}
mt: {seconds, plural, =1{sa {seconds} sekondi oħra} few{sa {seconds} sekondi oħra} many{sa {seconds} sekondi oħra} other{sa {seconds} sekondi oħra}}
ne: {seconds, plural, =1{{seconds} सेकेन्डमा} other{{seconds} सेकेन्डमा}}
pt_pt: {seconds, plural, =1{dentro de {seconds} segundo} other{dentro de {seconds} segundos}}
ro: {seconds, plural, =1{peste {seconds} secundă} few{peste {seconds} secunde} other{peste {seconds} de secunde}}
si: {seconds, plural, =1{තත්පර {seconds}කින්} other{තත්පර {seconds}කින්}}
sl: {seconds, plural, =1{čez {seconds} sekundo} =2{čez {seconds} sekundi} few{čez {seconds} sekunde} other{čez {seconds} sekund}}
sq: {seconds, plural, =1{pas {seconds} sekonde} other{pas {seconds} sekondash}}
sr_latn: {seconds, plural, =1{za {seconds} sekundu} few{za {seconds} sekunde} other{za {seconds} sekundi}}
sw: {seconds, plural, =1{baada ya sekunde {seconds}} other{baada ya sekunde {seconds}}}
te: {seconds, plural, =1{{seconds} సెకనులో} other{{seconds} సెకన్లలో}}
th: {seconds, plural, other{ในอีก {seconds} วินาที}}
tk: {seconds, plural, =1{{seconds} sekuntdan} other{{seconds} sekuntdan}}
tt: {seconds, plural, other{{seconds} секундтан}}
uz: {seconds, plural, =1{{seconds} soniyadan keyin} other{{seconds} soniyadan keyin}}
uz_cyrl: {seconds, plural, =1{{seconds} сониядан сўнг} other{{seconds} сониядан сўнг}}
zh: {seconds, plural, other{{seconds}秒钟后}}
zh_hant: {seconds, plural, other{{seconds} 秒後}}
zu: {seconds, plural, =1{kusekhondi elingu-{seconds} elizayo} other{kumasekhondi angu-{seconds} ezayo}}
